{
  "title": "Alice's Adventures in Wonderland",
  "type": "Book",
  "author": "Lewis Carroll",
  "year": 1865,
  "url": "https://www.gutenberg.org/ebooks/11",
  "image": "https://m.media-amazon.com/images/I/71PdNDqqDzL._AC_UF1000,1000_QL80_.jpg",
  "num_chapters": 12,
  "num_scenes": 99,
  "num_characters": 40,
  "num_locations": 23,
  "chapters": [
    {
      "chapter": "CHAPTER I.",
      "scenes": 7,
      "length": 13011,
      "num_lines": 181,
      "summary": "Alice's curiosity leads her to follow the White Rabbit and discover a mysterious hall with locked doors, where she shrinks after drinking from a bottle and struggles to retrieve a key.",
      "importance": 0.8,
      "conflict": 0.3,
      "locations": {
        "Riverbank": 1,
        "Rabbit-hole": 1,
        "Hall": 1,
        "Wonderland": 2,
        "Alice's Room": 1,
        "Under The Table": 1
      },
      "characters": {
        "Alice": 8,
        "White Rabbit": 2,
        "Dinah": 1
      },
      "importance_rank": 3,
      "conflict_rank": 11
    },
    {
      "chapter": "CHAPTER II.",
      "scenes": 10,
      "length": 12499,
      "num_lines": 172,
      "summary": "Alice navigates her feelings of identity and size while swimming in her own tears, leading to an encounter with a Mouse as they both seek to escape the pool.",
      "importance": 0.75,
      "conflict": 0.46,
      "locations": {
        "Pool Of Tears": 6,
        "Hall": 3,
        "Riverbank": 1
      },
      "characters": {
        "Alice": 10,
        "White Rabbit": 1,
        "Mabel": 1,
        "Mouse": 5,
        "Dodo": 1,
        "Duck": 1,
        "Lory": 1,
        "Eaglet": 1
      },
      "importance_rank": 10,
      "conflict_rank": 6
    },
    {
      "chapter": "CHAPTER III.",
      "scenes": 9,
      "length": 10588,
      "num_lines": 156,
      "summary": "Alice encounters a group of wet animals who hold a Caucus-race to dry off, leading to a series of misunderstandings and Alice's feelings of loneliness.",
      "importance": 0.72,
      "conflict": 0.33,
      "locations": {
        "Riverbank": 1,
        "Clearing": 7,
        "Wonderland": 1
      },
      "characters": {
        "Alice": 9,
        "Lory": 2,
        "Mouse": 4,
        "Dodo": 3,
        "Eaglet": 1,
        "Magpie": 1,
        "Canary": 1
      },
      "importance_rank": 12,
      "conflict_rank": 8
    },
    {
      "chapter": "CHAPTER IV.",
      "scenes": 9,
      "length": 15881,
      "num_lines": 216,
      "summary": "Alice navigates a series of chaotic encounters in Wonderland, including being mistaken for a maid, growing and shrinking, and meeting various whimsical characters.",
      "importance": 0.76,
      "conflict": 0.53,
      "locations": {
        "Hall": 1,
        "Rabbit's House": 6,
        "Wood": 1,
        "Caterpillar's Garden": 1
      },
      "characters": {
        "White Rabbit": 5,
        "Alice": 9,
        "Magic Bottle": 1,
        "Bill": 1,
        "Enormous Puppy": 1,
        "Blue Caterpillar": 1
      },
      "importance_rank": 8,
      "conflict_rank": 2
    },
    {
      "chapter": "CHAPTER V.",
      "scenes": 8,
      "length": 13788,
      "num_lines": 213,
      "summary": "Alice engages in a philosophical discussion about identity with the Caterpillar, who challenges her to recite a poem and debates size preferences before advising her about a magical mushroom that alters her height.",
      "importance": 0.78,
      "conflict": 0.5,
      "locations": {
        "Caterpillar's Garden": 5,
        "Wood": 2,
        "Clearing": 1
      },
      "characters": {
        "Blue Caterpillar": 4,
        "Alice": 8,
        "Pigeon": 3
      },
      "importance_rank": 6,
      "conflict_rank": 3
    },
    {
      "chapter": "CHAPTER VI.",
      "scenes": 9,
      "length": 15971,
      "num_lines": 235,
      "summary": "Alice navigates a series of absurd encounters in a chaotic kitchen, meets the Cheshire Cat, and feels uneasy as she approaches the March Hare's house.",
      "importance": 0.76,
      "conflict": 0.38,
      "locations": {
        "Duchess's House": 5,
        "Alice's Room": 1,
        "Meadow": 1,
        "Wonderland": 1,
        "House Of The March Hare": 1
      },
      "characters": {
        "Alice": 9,
        "Fish-footman": 1,
        "Frog-footman": 2,
        "Duchess": 3,
        "Cook": 2,
        "Baby": 3,
        "Cheshire Cat": 3
      },
      "importance_rank": 9,
      "conflict_rank": 7
    },
    {
      "chapter": "CHAPTER VII.",
      "scenes": 3,
      "length": 14775,
      "num_lines": 232,
      "summary": "Alice leaves the chaotic tea party with the March Hare, Hatter, and Dormouse, and discovers a door that leads to a beautiful garden.",
      "importance": 0.8,
      "conflict": 0.33,
      "locations": {
        "Meadow": 1,
        "House Of The March Hare": 1,
        "Queen's Garden": 1
      },
      "characters": {
        "Alice": 3,
        "Hatter": 1,
        "March Hare": 1,
        "Dormouse": 1
      },
      "importance_rank": 4,
      "conflict_rank": 9
    },
    {
      "chapter": "CHAPTER VIII.",
      "scenes": 8,
      "length": 15786,
      "num_lines": 231,
      "summary": "Alice confronts the Queen amidst chaos, witnesses the gardeners' punishment, and navigates a bizarre croquet game while discussing the Cheshire Cat.",
      "importance": 0.82,
      "conflict": 0.61,
      "locations": {
        "Queen's Garden": 7,
        "King's Court": 1
      },
      "characters": {
        "Alice": 8,
        "Five": 1,
        "Seven": 1,
        "Two": 2,
        "White Rabbit": 2,
        "Knave Of Hearts": 3,
        "King Of Hearts": 4,
        "Queen Of Hearts": 6,
        "Cheshire Cat": 3,
        "Executioner": 1,
        "Duchess": 1
      },
      "importance_rank": 1,
      "conflict_rank": 1
    },
    {
      "chapter": "CHAPTER IX.",
      "scenes": 15,
      "length": 14658,
      "num_lines": 224,
      "summary": "Alice reunites with the Duchess, who shares convoluted morals before the Queen interrupts, leading to chaos at the croquet game and a meeting with the humorous Gryphon and the melancholic Mock Turtle.",
      "importance": 0.73,
      "conflict": 0.32,
      "locations": {
        "Path": 1,
        "Alice's Kitchen": 1,
        "Duchess's House": 4,
        "King's Court": 1,
        "Queen's Garden": 1,
        "Meadow": 1,
        "Unknown Location": 1,
        "Ledge": 1,
        "Mock Turtle's Area": 1,
        "Underwater": 2,
        "Whimsical Scene": 1
      },
      "characters": {
        "Duchess": 6,
        "Alice": 14,
        "Queen Of Hearts": 4,
        "King Of Hearts": 1,
        "Gryphon": 6,
        "Mock Turtle": 5
      },
      "importance_rank": 11,
      "conflict_rank": 10
    },
    {
      "chapter": "CHAPTER X.",
      "scenes": 4,
      "length": 13278,
      "num_lines": 210,
      "summary": "Alice learns about the Lobster Quadrille and shares her adventures while the Mock Turtle expresses his sadness.",
      "importance": 0.8,
      "conflict": 0.28,
      "locations": {
        "Underwater": 1,
        "Whimsical Scene": 3
      },
      "characters": {
        "Mock Turtle": 4,
        "Gryphon": 4,
        "Alice": 4
      },
      "importance_rank": 5,
      "conflict_rank": 12
    },
    {
      "chapter": "CHAPTER XI.",
      "scenes": 8,
      "length": 11993,
      "num_lines": 181,
      "summary": "Alice witnesses the chaotic court proceedings where the Knave is on trial, leading to absurd testimonies and unexpected chaos.",
      "importance": 0.77,
      "conflict": 0.5,
      "locations": {
        "King's Court": 8
      },
      "characters": {
        "King Of Hearts": 6,
        "Queen Of Hearts": 4,
        "Knave Of Hearts": 2,
        "White Rabbit": 5,
        "Alice": 5,
        "Gryphon": 1,
        "Hatter": 1,
        "March Hare": 1,
        "Dormouse": 2,
        "Guinea-pig": 1,
        "Officers Of The Court": 1,
        "Cook": 1
      },
      "importance_rank": 7,
      "conflict_rank": 4
    },
    {
      "chapter": "CHAPTER XII.",
      "scenes": 9,
      "length": 13522,
      "num_lines": 212,
      "summary": "Alice's chaotic courtroom experience culminates in her defiance against the absurdity of the trial, leading to her awakening and reflection on her adventures.",
      "importance": 0.81,
      "conflict": 0.47,
      "locations": {
        "King's Court": 7,
        "Riverbank": 1,
        "Wonderland": 1
      },
      "characters": {
        "Alice": 6,
        "King Of Hearts": 6,
        "Lizard": 1,
        "White Rabbit": 3,
        "Queen Of Hearts": 4,
        "Juryman": 1,
        "Another Juryman": 1,
        "Knave Of Hearts": 2,
        "Bill": 1,
        "Alice's Sister": 1,
        "Mock Turtle": 1,
        "March Hare": 1
      },
      "importance_rank": 2,
      "conflict_rank": 5
    }
  ],
  "scenes": [
    {
      "title": "Alice by the Bank",
      "summary": "Alice grows bored sitting by her sister.",
      "chapter": "CHAPTER I.",
      "first_line": 1,
      "last_line": 21,
      "text": "Alice was beginning to get very tired of sitting by her sister on the\nbank, and of having nothing to do: once or twice she had peeped into\nthe book her sister was reading, but it had no pictures or\nconversations in it, \"and what is the use of a book,\" thought Alice\n\"without pictures or conversations?\"\nSo she was considering in her own mind (as well as she could, for the\nhot day made her feel very sleepy and stupid), whether the pleasure of\nmaking a daisy-chain would be worth the trouble of getting up and\npicking the daisies, when suddenly a White Rabbit with pink eyes ran\nclose by her.\nThere was nothing so _very_ remarkable in that; nor did Alice think it\nso _very_ much out of the way to hear the Rabbit say to itself, \"Oh\ndear! Oh dear! I shall be late!\" (when she thought it over afterwards,\nit occurred to her that she ought to have wondered at this, but at the\ntime it all seemed quite natural); but when the Rabbit actually _took a\nwatch out of its waistcoat-pocket_, and looked at it, and then hurried\non, Alice started to her feet, for it flashed across her mind that she\nhad never before seen a rabbit with either a waistcoat-pocket, or a\nwatch to take out of it, and burning with curiosity, she ran across the\nfield after it, and fortunately was just in time to see it pop down a\nlarge rabbit-hole under the hedge.",
      "length": 1332,
      "num_lines": 21,
      "location": "Riverbank",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and bored observer",
          "importance": 1.0,
          "emotion": "Curious and restless",
          "sentiment": 0.5,
          "quote": "\"and what is the use of a book,\" thought Alice \"without pictures or conversations?\"",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Anxious and hurried character",
          "importance": 0.8,
          "emotion": "Anxious and hurried",
          "sentiment": -0.5,
          "quote": "\"Oh dear! Oh dear! I shall be late!\"",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 1,
      "importance_rank": 2,
      "conflict_rank": 4
    },
    {
      "title": "Falling Down the Rabbit Hole",
      "summary": "Alice follows the White Rabbit down a hole.",
      "chapter": "CHAPTER I.",
      "first_line": 22,
      "last_line": 78,
      "text": "In another moment down went Alice after it, never once considering how\nin the world she was to get out again.\nThe rabbit-hole went straight on like a tunnel for some way, and then\ndipped suddenly down, so suddenly that Alice had not a moment to think\nabout stopping herself before she found herself falling down a very\ndeep well.\nEither the well was very deep, or she fell very slowly, for she had\nplenty of time as she went down to look about her and to wonder what\nwas going to happen next. First, she tried to look down and make out\nwhat she was coming to, but it was too dark to see anything; then she\nlooked at the sides of the well, and noticed that they were filled with\ncupboards and book-shelves; here and there she saw maps and pictures\nhung upon pegs. She took down a jar from one of the shelves as she\npassed; it was labelled \"ORANGE MARMALADE\", but to her great\ndisappointment it was empty: she did not like to drop the jar for fear\nof killing somebody underneath, so managed to put it into one of the\ncupboards as she fell past it.\n\"Well!\" thought Alice to herself, \"after such a fall as this, I shall\nthink nothing of tumbling down stairs! How brave they'll all think me\nat home! Why, I wouldn't say anything about it, even if I fell off the\ntop of the house!\" (Which was very likely true.)\nDown, down, down. Would the fall _never_ come to an end? \"I wonder how\nmany miles I've fallen by this time?\" she said aloud. \"I must be\ngetting somewhere near the centre of the earth. Let me see: that would\nbe four thousand miles down, I think—\" (for, you see, Alice had learnt\nseveral things of this sort in her lessons in the schoolroom, and\nthough this was not a _very_ good opportunity for showing off her\nknowledge, as there was no one to listen to her, still it was good\npractice to say it over) \"—yes, that's about the right distance—but\nthen I wonder what Latitude or Longitude I've got to?\" (Alice had no\nidea what Latitude was, or Longitude either, but thought they were nice\ngrand words to say.)\nPresently she began again. \"I wonder if I shall fall right _through_\nthe earth! How funny it'll seem to come out among the people that walk\nwith their heads downward! The Antipathies, I think—\" (she was rather\nglad there _was_ no one listening, this time, as it didn't sound at all\nthe right word) \"—but I shall have to ask them what the name of the\ncountry is, you know. Please, Ma'am, is this New Zealand or Australia?\"\n(and she tried to curtsey as she spoke—fancy _curtseying_ as you're\nfalling through the air! Do you think you could manage it?) \"And what\nan ignorant little girl she'll think me for asking! No, it'll never do\nto ask: perhaps I shall see it written up somewhere.\"\nDown, down, down. There was nothing else to do, so Alice soon began\ntalking again. \"Dinah'll miss me very much to-night, I should think!\"\n(Dinah was the cat.) \"I hope they'll remember her saucer of milk at\ntea-time. Dinah my dear! I wish you were down here with me! There are\nno mice in the air, I'm afraid, but you might catch a bat, and that's\nvery like a mouse, you know. But do cats eat bats, I wonder?\" And here\nAlice began to get rather sleepy, and went on saying to herself, in a\ndreamy sort of way, \"Do cats eat bats? Do cats eat bats?\" and\nsometimes, \"Do bats eat cats?\" for, you see, as she couldn't answer\neither question, it didn't much matter which way she put it. She felt\nthat she was dozing off, and had just begun to dream that she was\nwalking hand in hand with Dinah, and saying to her very earnestly,\n\"Now, Dinah, tell me the truth: did you ever eat a bat?\" when suddenly,\nthump! thump! down she came upon a heap of sticks and dry leaves, and\nthe fall was over.",
      "length": 3678,
      "num_lines": 57,
      "location": "Rabbit-hole",
      "importance": 0.9,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and adventurous girl",
          "importance": 1.0,
          "emotion": "Curious and whimsical",
          "sentiment": 0.8,
          "quote": "I wonder how many miles I've fallen by this time?",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Dinah",
          "role": "Alice's pet cat",
          "importance": 0.2,
          "emotion": "Longing",
          "sentiment": 0.5,
          "quote": "Dinah'll miss me very much to-night, I should think!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 2,
      "importance_rank": 1,
      "conflict_rank": 5
    },
    {
      "title": "Exploring the Hall",
      "summary": "Alice finds herself in a hall with locked doors.",
      "chapter": "CHAPTER I.",
      "first_line": 79,
      "last_line": 110,
      "text": "Alice was not a bit hurt, and she jumped up on to her feet in a moment:\nshe looked up, but it was all dark overhead; before her was another\nlong passage, and the White Rabbit was still in sight, hurrying down\nit. There was not a moment to be lost: away went Alice like the wind,\nand was just in time to hear it say, as it turned a corner, \"Oh my ears\nand whiskers, how late it's getting!\" She was close behind it when she\nturned the corner, but the Rabbit was no longer to be seen: she found\nherself in a long, low hall, which was lit up by a row of lamps hanging\nfrom the roof.\nThere were doors all round the hall, but they were all locked; and when\nAlice had been all the way down one side and up the other, trying every\ndoor, she walked sadly down the middle, wondering how she was ever to\nget out again.\nSuddenly she came upon a little three-legged table, all made of solid\nglass; there was nothing on it except a tiny golden key, and Alice's\nfirst thought was that it might belong to one of the doors of the hall;\nbut, alas! either the locks were too large, or the key was too small,\nbut at any rate it would not open any of them. However, on the second\ntime round, she came upon a low curtain she had not noticed before, and\nbehind it was a little door about fifteen inches high: she tried the\nlittle golden key in the lock, and to her great delight it fitted!\nAlice opened the door and found that it led into a small passage, not\nmuch larger than a rat-hole: she knelt down and looked along the\npassage into the loveliest garden you ever saw. How she longed to get\nout of that dark hall, and wander about among those beds of bright\nflowers and those cool fountains, but she could not even get her head\nthrough the doorway; \"and even if my head would go through,\" thought\npoor Alice, \"it would be of very little use without my shoulders. Oh,\nhow I wish I could shut up like a telescope! I think I could, if I only\nknew how to begin.\" For, you see, so many out-of-the-way things had\nhappened lately, that Alice had begun to think that very few things\nindeed were really impossible.",
      "length": 2086,
      "num_lines": 32,
      "location": "Hall",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and determined to explore",
          "importance": 1.0,
          "emotion": "Longing and frustrated",
          "sentiment": -0.5,
          "quote": "Oh, how I wish I could shut up like a telescope!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Hurrying and anxious about time",
          "importance": 0.5,
          "emotion": "Worried and hurried",
          "sentiment": -0.3,
          "quote": "Oh my ears and whiskers, how late it's getting!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 3,
      "importance_rank": 3,
      "conflict_rank": 1
    },
    {
      "title": "The Drink Me Bottle",
      "summary": "Alice finds a bottle labeled 'Drink Me'.",
      "chapter": "CHAPTER I.",
      "first_line": 117,
      "last_line": 132,
      "text": "letters.\nIt was all very well to say \"Drink me,\" but the wise little Alice was\nnot going to do _that_ in a hurry. \"No, I'll look first,\" she said,\n\"and see whether it's marked '_poison_' or not\"; for she had read\nseveral nice little histories about children who had got burnt, and\neaten up by wild beasts and other unpleasant things, all because they\n_would_ not remember the simple rules their friends had taught them:\nsuch as, that a red-hot poker will burn you if you hold it too long;\nand that if you cut your finger _very_ deeply with a knife, it usually\nbleeds; and she had never forgotten that, if you drink much from a\nbottle marked \"poison,\" it is almost certain to disagree with you,\nsooner or later.\nHowever, this bottle was _not_ marked \"poison,\" so Alice ventured to\ntaste it, and finding it very nice, (it had, in fact, a sort of mixed\nflavour of cherry-tart, custard, pine-apple, roast turkey, toffee, and\nhot buttered toast,) she very soon finished it off.",
      "length": 972,
      "num_lines": 16,
      "location": "Wonderland",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Cautious and curious about the bottle",
          "importance": 1.0,
          "emotion": "Cautious and inquisitive",
          "sentiment": 0.5,
          "quote": "No, I'll look first, and see whether it's marked 'poison' or not",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 4,
      "importance_rank": 4,
      "conflict_rank": 6
    },
    {
      "title": "Alice Shrinks",
      "summary": "Alice shrinks down to the right size.",
      "chapter": "CHAPTER I.",
      "first_line": 136,
      "last_line": 140,
      "text": "\"What a curious feeling!\" said Alice; \"I must be shutting up like a\ntelescope.\"\nAnd so it was indeed: she was now only ten inches high, and her face\nbrightened up at the thought that she was now the right size for going\nthrough the little door into that lovely garden. First, however, she",
      "length": 288,
      "num_lines": 5,
      "location": "Wonderland",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Experiencing transformation and excitement",
          "importance": 1.0,
          "emotion": "Curious and excited",
          "sentiment": 0.8,
          "quote": "What a curious feeling!",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 5,
      "importance_rank": 5,
      "conflict_rank": 7
    },
    {
      "title": "The Key Dilemma",
      "summary": "Alice forgets the key and can't reach it.",
      "chapter": "CHAPTER I.",
      "first_line": 141,
      "last_line": 154,
      "text": "waited for a few minutes to see if she was going to shrink any further:\nshe felt a little nervous about this; \"for it might end, you know,\"\nsaid Alice to herself, \"in my going out altogether, like a candle. I\nwonder what I should be like then?\" And she tried to fancy what the\nflame of a candle is like after the candle is blown out, for she could\nnot remember ever having seen such a thing.\nAfter a while, finding that nothing more happened, she decided on going\ninto the garden at once; but, alas for poor Alice! when she got to the\ndoor, she found she had forgotten the little golden key, and when she\nwent back to the table for it, she found she could not possibly reach\nit: she could see it quite plainly through the glass, and she tried her\nbest to climb up one of the legs of the table, but it was too slippery;\nand when she had tired herself out with trying, the poor little thing\nsat down and cried.",
      "length": 908,
      "num_lines": 14,
      "location": "Alice's Room",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Struggles with her size and emotions",
          "importance": 1.0,
          "emotion": "Nervous and frustrated",
          "sentiment": -0.5,
          "quote": "\"for it might end, you know,\" said Alice to herself, \"in my going out altogether, like a candle. I wonder what I should be like then?\"",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 6,
      "importance_rank": 7,
      "conflict_rank": 2
    },
    {
      "title": "The Eat Me Cake",
      "summary": "Alice finds a cake labeled 'Eat Me'.",
      "chapter": "CHAPTER I.",
      "first_line": 165,
      "last_line": 178,
      "text": "Soon her eye fell on a little glass box that was lying under the table:\nshe opened it, and found in it a very small cake, on which the words\n\"EAT ME\" were beautifully marked in currants. \"Well, I'll eat it,\" said\nAlice, \"and if it makes me grow larger, I can reach the key; and if it\nmakes me grow smaller, I can creep under the door; so either way I'll\nget into the garden, and I don't care which happens!\"\nShe ate a little bit, and said anxiously to herself, \"Which way? Which\nway?\", holding her hand on the top of her head to feel which way it was\ngrowing, and she was quite surprised to find that she remained the same\nsize: to be sure, this generally happens when one eats cake, but Alice\nhad got so much into the way of expecting nothing but out-of-the-way\nthings to happen, that it seemed quite dull and stupid for life to go\non in the common way.\nSo she set to work, and very soon finished off the cake.",
      "length": 911,
      "num_lines": 14,
      "location": "Under The Table",
      "importance": 0.8,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and adventurous girl",
          "importance": 1.0,
          "emotion": "Anxious and determined",
          "sentiment": 0.5,
          "quote": "Well, I'll eat it,",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Exploring her options",
          "importance": 1.0,
          "emotion": "Surprised and disappointed",
          "sentiment": -0.2,
          "quote": "Which way? Which way?",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 7,
      "importance_rank": 6,
      "conflict_rank": 3
    },
    {
      "title": "Alice's Transformation",
      "summary": "Alice reflects on her size and feet.",
      "chapter": "CHAPTER II.",
      "first_line": 1,
      "last_line": 18,
      "text": "The Pool of Tears\n\"Curiouser and curiouser!\" cried Alice (she was so much surprised, that\nfor the moment she quite forgot how to speak good English); \"now I'm\nopening out like the largest telescope that ever was! Good-bye, feet!\"\n(for when she looked down at her feet, they seemed to be almost out of\nsight, they were getting so far off). \"Oh, my poor little feet, I\nwonder who will put on your shoes and stockings for you now, dears? I'm\nsure _I_ shan't be able! I shall be a great deal too far off to trouble\nmyself about you: you must manage the best way you can;—but I must be\nkind to them,\" thought Alice, \"or perhaps they won't walk the way I\nwant to go! Let me see: I'll give them a new pair of boots every\nChristmas.\"\nAnd she went on planning to herself how she would manage it. \"They must\ngo by the carrier,\" she thought; \"and how funny it'll seem, sending\npresents to one's own feet! And how odd the directions will look!\n_Alice's Right Foot, Esq., Hearthrug, near the Fender,_ (_with\nAlice's love_).\nOh dear, what nonsense I'm talking!\"",
      "length": 1047,
      "num_lines": 18,
      "location": "Pool Of Tears",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Experiencing confusion and surprise",
          "importance": 1.0,
          "emotion": "Surprised and whimsical",
          "sentiment": 0.5,
          "quote": "Curiouser and curiouser!",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 1,
      "importance_rank": 6,
      "conflict_rank": 10
    },
    {
      "title": "Alice's Tears",
      "summary": "Alice cries and creates a pool of tears.",
      "chapter": "CHAPTER II.",
      "first_line": 19,
      "last_line": 29,
      "text": "Just then her head struck against the roof of the hall: in fact she was\nnow more than nine feet high, and she at once took up the little golden\nkey and hurried off to the garden door.\nPoor Alice! It was as much as she could do, lying down on one side, to\nlook through into the garden with one eye; but to get through was more\nhopeless than ever: she sat down and began to cry again.\n\"You ought to be ashamed of yourself,\" said Alice, \"a great girl like\nyou,\" (she might well say this), \"to go on crying in this way! Stop\nthis moment, I tell you!\" But she went on all the same, shedding\ngallons of tears, until there was a large pool all round her, about\nfour inches deep and reaching half down the hall.",
      "length": 703,
      "num_lines": 11,
      "location": "Hall",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Alice",
          "role": "Struggling with her size and emotions",
          "importance": 1.0,
          "emotion": "Frustrated and sad",
          "sentiment": -0.5,
          "quote": "You ought to be ashamed of yourself, a great girl like you, to go on crying in this way! Stop this moment, I tell you!",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 2,
      "importance_rank": 1,
      "conflict_rank": 2
    },
    {
      "title": "The White Rabbit Appears",
      "summary": "The White Rabbit rushes past Alice.",
      "chapter": "CHAPTER II.",
      "first_line": 30,
      "last_line": 39,
      "text": "After a time she heard a little pattering of feet in the distance, and\nshe hastily dried her eyes to see what was coming. It was the White\nRabbit returning, splendidly dressed, with a pair of white kid gloves\nin one hand and a large fan in the other: he came trotting along in a\ngreat hurry, muttering to himself as he came, \"Oh! the Duchess, the\nDuchess! Oh! won't she be savage if I've kept her waiting!\" Alice felt\nso desperate that she was ready to ask help of any one; so, when the\nRabbit came near her, she began, in a low, timid voice, \"If you please,\nsir—\" The Rabbit started violently, dropped the white kid gloves and\nthe fan, and skurried away into the darkness as hard as he could go.",
      "length": 696,
      "num_lines": 10,
      "location": "Hall",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "White Rabbit",
          "role": "In a hurry, worried about the Duchess",
          "importance": 1.0,
          "emotion": "Anxious and flustered",
          "sentiment": -0.5,
          "quote": "Oh! the Duchess, the Duchess! Oh! won't she be savage if I've kept her waiting!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Desperate for help",
          "importance": 1.0,
          "emotion": "Timid and anxious",
          "sentiment": -0.3,
          "quote": "If you please, sir—",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 3,
      "importance_rank": 7,
      "conflict_rank": 5
    },
    {
      "title": "Alice's Identity Crisis",
      "summary": "Alice questions her identity and knowledge.",
      "chapter": "CHAPTER II.",
      "first_line": 40,
      "last_line": 80,
      "text": "Alice took up the fan and gloves, and, as the hall was very hot, she\nkept fanning herself all the time she went on talking: \"Dear, dear! How\nqueer everything is to-day! And yesterday things went on just as usual.\nI wonder if I've been changed in the night? Let me think: was I the\nsame when I got up this morning? I almost think I can remember feeling\na little different. But if I'm not the same, the next question is, Who\nin the world am I? Ah, _that's_ the great puzzle!\" And she began\nthinking over all the children she knew that were of the same age as\nherself, to see if she could have been changed for any of them.\n\"I'm sure I'm not Ada,\" she said, \"for her hair goes in such long\nringlets, and mine doesn't go in ringlets at all; and I'm sure I can't\nbe Mabel, for I know all sorts of things, and she, oh! she knows such a\nvery little! Besides, _she's_ she, and _I'm_ I, and—oh dear, how\npuzzling it all is! I'll try if I know all the things I used to know.\nLet me see: four times five is twelve, and four times six is thirteen,\nand four times seven is—oh dear! I shall never get to twenty at that\nrate! However, the Multiplication Table doesn't signify: let's try\nGeography. London is the capital of Paris, and Paris is the capital of\nRome, and Rome—no, _that's_ all wrong, I'm certain! I must have been\nchanged for Mabel! I'll try and say '_How doth the little_—'\" and she\ncrossed her hands on her lap as if she were saying lessons, and began\nto repeat it, but her voice sounded hoarse and strange, and the words\ndid not come the same as they used to do:—\n\"How doth the little crocodile\nImprove his shining tail,\nAnd pour the waters of the Nile\nOn every golden scale!\n\"How cheerfully he seems to grin,\nHow neatly spread his claws,\nAnd welcome little fishes in\nWith gently smiling jaws!\"\n\"I'm sure those are not the right words,\" said poor Alice, and her eyes\nfilled with tears again as she went on, \"I must be Mabel after all, and\nI shall have to go and live in that poky little house, and have next to\nno toys to play with, and oh! ever so many lessons to learn! No, I've\nmade up my mind about it; if I'm Mabel, I'll stay down here! It'll be\nno use their putting their heads down and saying 'Come up again, dear!'\nI shall only look up and say 'Who am I then? Tell me that first, and\nthen, if I like being that person, I'll come up: if not, I'll stay down\nhere till I'm somebody else'—but, oh dear!\" cried Alice, with a sudden\nburst of tears, \"I do wish they _would_ put their heads down! I am so",
      "length": 2505,
      "num_lines": 41,
      "location": "Hall",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Alice",
          "role": "Struggling with her identity",
          "importance": 1.0,
          "emotion": "Confused and distressed",
          "sentiment": -0.5,
          "quote": "I wonder if I've been changed in the night?",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mabel",
          "role": "Comparison for Alice's identity",
          "importance": 0.3,
          "emotion": "No direct emotion expressed",
          "sentiment": 0.0,
          "quote": "I'm sure I can't be Mabel, for I know all sorts of things, and she, oh! she knows such a very little!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 4,
      "importance_rank": 2,
      "conflict_rank": 3
    },
    {
      "title": "Alice in the Pool of Tears",
      "summary": "Alice finds herself swimming in her tears.",
      "chapter": "CHAPTER II.",
      "first_line": 81,
      "last_line": 110,
      "text": "_very_ tired of being all alone here!\"\nAs she said this she looked down at her hands, and was surprised to see\nthat she had put on one of the Rabbit's little white kid gloves while\nshe was talking. \"How _can_ I have done that?\" she thought. \"I must be\ngrowing small again.\" She got up and went to the table to measure\nherself by it, and found that, as nearly as she could guess, she was\nnow about two feet high, and was going on shrinking rapidly: she soon\nfound out that the cause of this was the fan she was holding, and she\ndropped it hastily, just in time to avoid shrinking away altogether.\n\"That _was_ a narrow escape!\" said Alice, a good deal frightened at the\nsudden change, but very glad to find herself still in existence; \"and\nnow for the garden!\" and she ran with all speed back to the little\ndoor: but, alas! the little door was shut again, and the little golden\nkey was lying on the glass table as before, \"and things are worse than\never,\" thought the poor child, \"for I never was so small as this\nbefore, never! And I declare it's too bad, that it is!\"\nAs she said these words her foot slipped, and in another moment,\nsplash! she was up to her chin in salt water. Her first idea was that\nshe had somehow fallen into the sea, \"and in that case I can go back by\nrailway,\" she said to herself. (Alice had been to the seaside once in\nher life, and had come to the general conclusion, that wherever you go\nto on the English coast you find a number of bathing machines in the\nsea, some children digging in the sand with wooden spades, then a row\nof lodging houses, and behind them a railway station.) However, she\nsoon made out that she was in the pool of tears which she had wept when\nshe was nine feet high.\n\"I wish I hadn't cried so much!\" said Alice, as she swam about, trying\nto find her way out. \"I shall be punished for it now, I suppose, by\nbeing drowned in my own tears! That _will_ be a queer thing, to be\nsure! However, everything is queer to-day.\"",
      "length": 1968,
      "num_lines": 30,
      "location": "Pool Of Tears",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Alice",
          "role": "Struggling with her size and emotions",
          "importance": 1.0,
          "emotion": "Frustrated and frightened",
          "sentiment": -0.5,
          "quote": "I wish I hadn't cried so much!",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 5,
      "importance_rank": 3,
      "conflict_rank": 4
    },
    {
      "title": "Meeting the Mouse",
      "summary": "Alice encounters a mouse in the pool.",
      "chapter": "CHAPTER II.",
      "first_line": 111,
      "last_line": 125,
      "text": "Just then she heard something splashing about in the pool a little way\noff, and she swam nearer to make out what it was: at first she thought\nit must be a walrus or hippopotamus, but then she remembered how small\nshe was now, and she soon made out that it was only a mouse that had\nslipped in like herself.\n\"Would it be of any use, now,\" thought Alice, \"to speak to this mouse?\nEverything is so out-of-the-way down here, that I should think very\nlikely it can talk: at any rate, there's no harm in trying.\" So she\nbegan: \"O Mouse, do you know the way out of this pool? I am very tired\nof swimming about here, O Mouse!\" (Alice thought this must be the right\nway of speaking to a mouse: she had never done such a thing before, but\nshe remembered having seen in her brother's Latin Grammar, \"A mouse—of\na mouse—to a mouse—a mouse—O mouse!\") The Mouse looked at her rather\ninquisitively, and seemed to her to wink with one of its little eyes,\nbut it said nothing.",
      "length": 959,
      "num_lines": 15,
      "location": "Pool Of Tears",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to communicate with the mouse",
          "importance": 0.8,
          "emotion": "Curious and hopeful",
          "sentiment": 0.5,
          "quote": "O Mouse, do you know the way out of this pool? I am very tired of swimming about here, O Mouse!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mouse",
          "role": "Silent observer of Alice",
          "importance": 0.5,
          "emotion": "Inquisitive but unresponsive",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "I wonder what this strange creature wants from me.",
          "importance_rank": 2
        }
      ],
      "number": 6,
      "importance_rank": 8,
      "conflict_rank": 7
    },
    {
      "title": "Language Misunderstanding",
      "summary": "Alice tries to speak French to the Mouse.",
      "chapter": "CHAPTER II.",
      "first_line": 126,
      "last_line": 134,
      "text": "\"Perhaps it doesn't understand English,\" thought Alice; \"I daresay it's\na French mouse, come over with William the Conqueror.\" (For, with all\nher knowledge of history, Alice had no very clear notion how long ago\nanything had happened.) So she began again: \"Où est ma chatte?\" which\nwas the first sentence in her French lesson-book. The Mouse gave a\nsudden leap out of the water, and seemed to quiver all over with\nfright. \"Oh, I beg your pardon!\" cried Alice hastily, afraid that she\nhad hurt the poor animal's feelings. \"I quite forgot you didn't like\ncats.\"",
      "length": 559,
      "num_lines": 9,
      "location": "Pool Of Tears",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to communicate with the Mouse",
          "importance": 0.8,
          "emotion": "Curious and apologetic",
          "sentiment": 0.5,
          "quote": "Oh, I beg your pardon!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mouse",
          "role": "Reacting to Alice's words",
          "importance": 0.7,
          "emotion": "Frightened",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "I can't stand the thought of cats!",
          "importance_rank": 2
        }
      ],
      "number": 7,
      "importance_rank": 9,
      "conflict_rank": 8
    },
    {
      "title": "Mouse's Anger",
      "summary": "The Mouse expresses its dislike for cats.",
      "chapter": "CHAPTER II.",
      "first_line": 135,
      "last_line": 150,
      "text": "\"Not like cats!\" cried the Mouse, in a shrill, passionate voice. \"Would\n_you_ like cats if you were me?\"\n\"Well, perhaps not,\" said Alice in a soothing tone: \"don't be angry\nabout it. And yet I wish I could show you our cat Dinah: I think you'd\ntake a fancy to cats if you could only see her. She is such a dear\nquiet thing,\" Alice went on, half to herself, as she swam lazily about\nin the pool, \"and she sits purring so nicely by the fire, licking her\npaws and washing her face—and she is such a nice soft thing to\nnurse—and she's such a capital one for catching mice—oh, I beg your\npardon!\" cried Alice again, for this time the Mouse was bristling all\nover, and she felt certain it must be really offended. \"We won't talk\nabout her any more if you'd rather not.\"\n\"We indeed!\" cried the Mouse, who was trembling down to the end of his\ntail. \"As if _I_ would talk on such a subject! Our family always\n_hated_ cats: nasty, low, vulgar things! Don't let me hear the name\nagain!\"",
      "length": 975,
      "num_lines": 16,
      "location": "Pool Of Tears",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Mouse",
          "role": "Expresses strong dislike for cats",
          "importance": 1.0,
          "emotion": "Angry and offended",
          "sentiment": -1.0,
          "quote": "As if _I_ would talk on such a subject! Our family always _hated_ cats: nasty, low, vulgar things! Don't let me hear the name again!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Tries to soothe the Mouse",
          "importance": 0.8,
          "emotion": "Calm and apologetic",
          "sentiment": 0.5,
          "quote": "I wish I could show you our cat Dinah: I think you'd take a fancy to cats if you could only see her.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 8,
      "importance_rank": 4,
      "conflict_rank": 1
    },
    {
      "title": "Alice's Apology",
      "summary": "Alice tries to change the subject to dogs.",
      "chapter": "CHAPTER II.",
      "first_line": 151,
      "last_line": 162,
      "text": "\"I won't indeed!\" said Alice, in a great hurry to change the subject of\nconversation. \"Are you—are you fond—of—of dogs?\" The Mouse did not\nanswer, so Alice went on eagerly: \"There is such a nice little dog near\nour house I should like to show you! A little bright-eyed terrier, you\nknow, with oh, such long curly brown hair! And it'll fetch things when\nyou throw them, and it'll sit up and beg for its dinner, and all sorts\nof things—I can't remember half of them—and it belongs to a farmer, you\nknow, and he says it's so useful, it's worth a hundred pounds! He says\nit kills all the rats and—oh dear!\" cried Alice in a sorrowful tone,\n\"I'm afraid I've offended it again!\" For the Mouse was swimming away\nfrom her as hard as it could go, and making quite a commotion in the\npool as it went.",
      "length": 790,
      "num_lines": 12,
      "location": "Pool Of Tears",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to change the subject",
          "importance": 0.8,
          "emotion": "Eager and anxious",
          "sentiment": 0.5,
          "quote": "I won't indeed!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mouse",
          "role": "Feeling offended and swimming away",
          "importance": 0.7,
          "emotion": "Offended and distressed",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "I can't believe you would say that!",
          "importance_rank": 2
        }
      ],
      "number": 9,
      "importance_rank": 10,
      "conflict_rank": 6
    },
    {
      "title": "The Group Forms",
      "summary": "Alice and the Mouse lead a group to shore.",
      "chapter": "CHAPTER II.",
      "first_line": 163,
      "last_line": 172,
      "text": "So she called softly after it, \"Mouse dear! Do come back again, and we\nwon't talk about cats or dogs either, if you don't like them!\" When the\nMouse heard this, it turned round and swam slowly back to her: its face\nwas quite pale (with passion, Alice thought), and it said in a low\ntrembling voice, \"Let us get to the shore, and then I'll tell you my\nhistory, and you'll understand why it is I hate cats and dogs.\"\nIt was high time to go, for the pool was getting quite crowded with the\nbirds and animals that had fallen into it: there were a Duck and a\nDodo, a Lory and an Eaglet, and several other curious creatures. Alice\nled the way, and the whole party swam to the shore.",
      "length": 676,
      "num_lines": 10,
      "location": "Riverbank",
      "importance": 0.8,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to comfort the Mouse",
          "importance": 0.7,
          "emotion": "gentle and persuasive",
          "sentiment": 0.5,
          "quote": "Mouse dear! Do come back again, and we won't talk about cats or dogs either, if you don't like them!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mouse",
          "role": "Reluctantly agreeing to share its story",
          "importance": 0.6,
          "emotion": "anxious and passionate",
          "sentiment": -0.5,
          "quote": "Let us get to the shore, and then I'll tell you my history, and you'll understand why it is I hate cats and dogs.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Dodo",
          "role": "Part of the group, no significant action",
          "importance": 0.0,
          "emotion": "No significant emotion",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "I wonder what will happen next.",
          "importance_rank": 3
        },
        {
          "name": "Duck",
          "role": "Part of the group, no significant action",
          "importance": 0.0,
          "emotion": "No significant emotion",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "I hope we find a way out.",
          "importance_rank": 4
        },
        {
          "name": "Lory",
          "role": "Part of the group, no significant action",
          "importance": 0.0,
          "emotion": "No significant emotion",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "Let's stick together!",
          "importance_rank": 5
        },
        {
          "name": "Eaglet",
          "role": "Part of the group, no significant action",
          "importance": 0.0,
          "emotion": "No significant emotion",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "I feel a bit lost.",
          "importance_rank": 6
        }
      ],
      "number": 10,
      "importance_rank": 5,
      "conflict_rank": 9
    },
    {
      "title": "Queer-Looking Party",
      "summary": "Alice meets a group of wet animals.",
      "chapter": "CHAPTER III.",
      "first_line": 1,
      "last_line": 12,
      "text": "A Caucus-Race and a Long Tale\nThey were indeed a queer-looking party that assembled on the bank—the\nbirds with draggled feathers, the animals with their fur clinging close\nto them, and all dripping wet, cross, and uncomfortable.\nThe first question of course was, how to get dry again: they had a\nconsultation about this, and after a few minutes it seemed quite\nnatural to Alice to find herself talking familiarly with them, as if\nshe had known them all her life. Indeed, she had quite a long argument\nwith the Lory, who at last turned sulky, and would only say, \"I am\nolder than you, and must know better;\" and this Alice would not allow\nwithout knowing how old it was, and, as the Lory positively refused to\ntell its age, there was no more to be said.",
      "length": 752,
      "num_lines": 12,
      "location": "Riverbank",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Engaging in conversation and debate",
          "importance": 0.8,
          "emotion": "Curious and assertive",
          "sentiment": 0.5,
          "quote": "I am older than you, and must know better;",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Lory",
          "role": "Defensive and sulky",
          "importance": 0.6,
          "emotion": "Irritated and stubborn",
          "sentiment": -0.5,
          "quote": "I am older than you, and must know better;",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 1,
      "importance_rank": 3,
      "conflict_rank": 3
    },
    {
      "title": "Mouse's Authority",
      "summary": "The Mouse attempts to dry everyone with a speech.",
      "chapter": "CHAPTER III.",
      "first_line": 13,
      "last_line": 22,
      "text": "At last the Mouse, who seemed to be a person of authority among them,\ncalled out, \"Sit down, all of you, and listen to me! _I'll_ soon make\nyou dry enough!\" They all sat down at once, in a large ring, with the\nMouse in the middle. Alice kept her eyes anxiously fixed on it, for she\nfelt sure she would catch a bad cold if she did not get dry very soon.\n\"Ahem!\" said the Mouse with an important air, \"are you all ready? This\nis the driest thing I know. Silence all round, if you please! 'William\nthe Conqueror, whose cause was favoured by the pope, was soon submitted\nto by the English, who wanted leaders, and had been of late much\naccustomed to usurpation and conquest. Edwin and Morcar, the earls of",
      "length": 701,
      "num_lines": 10,
      "location": "Clearing",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Mouse",
          "role": "Leader of the group, trying to entertain and dry everyone off",
          "importance": 1.0,
          "emotion": "Confident and authoritative",
          "sentiment": 0.8,
          "quote": "Sit down, all of you, and listen to me! _I'll_ soon make you dry enough!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Concerned about getting dry and catching a cold",
          "importance": 0.5,
          "emotion": "Anxious and worried",
          "sentiment": -0.5,
          "quote": "I felt sure I would catch a bad cold if I did not get dry very soon.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 2,
      "importance_rank": 4,
      "conflict_rank": 4
    },
    {
      "title": "Dodo's Proposal",
      "summary": "The Dodo suggests a Caucus-race to dry off.",
      "chapter": "CHAPTER III.",
      "first_line": 44,
      "last_line": 56,
      "text": "\"In that case,\" said the Dodo solemnly, rising to its feet, \"I move\nthat the meeting adjourn, for the immediate adoption of more energetic\nremedies—\"\n\"Speak English!\" said the Eaglet. \"I don't know the meaning of half\nthose long words, and, what's more, I don't believe you do either!\" And\nthe Eaglet bent down its head to hide a smile: some of the other birds\ntittered audibly.\n\"What I was going to say,\" said the Dodo in an offended tone, \"was,\nthat the best thing to get us dry would be a Caucus-race.\"\n\"What _is_ a Caucus-race?\" said Alice; not that she wanted much to\nknow, but the Dodo had paused as if it thought that _somebody_ ought to\nspeak, and no one else seemed inclined to say anything.\n\"Why,\" said the Dodo, \"the best way to explain it is to do it.\" (And,",
      "length": 770,
      "num_lines": 13,
      "location": "Clearing",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Dodo",
          "role": "Proposes to adjourn the meeting",
          "importance": 0.8,
          "emotion": "Solemn and offended",
          "sentiment": 0.2,
          "quote": "I move that the meeting adjourn, for the immediate adoption of more energetic remedies—",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Eaglet",
          "role": "Challenges the Dodo's language",
          "importance": 0.6,
          "emotion": "Playful and mocking",
          "sentiment": 0.5,
          "quote": "Speak English! I don't know the meaning of half those long words, and, what's more, I don't believe you do either!",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Alice",
          "role": "Inquisitive and confused about the Caucus-race",
          "importance": 0.5,
          "emotion": "Curious and slightly bewildered",
          "sentiment": 0.3,
          "quote": "What _is_ a Caucus-race?",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 3,
      "importance_rank": 5,
      "conflict_rank": 5
    },
    {
      "title": "Caucus-Race Results",
      "summary": "The group finishes the race and demands prizes.",
      "chapter": "CHAPTER III.",
      "first_line": 65,
      "last_line": 78,
      "text": "again, the Dodo suddenly called out \"The race is over!\" and they all\ncrowded round it, panting, and asking, \"But who has won?\"\nThis question the Dodo could not answer without a great deal of\nthought, and it sat for a long time with one finger pressed upon its\nforehead (the position in which you usually see Shakespeare, in the\npictures of him), while the rest waited in silence. At last the Dodo\nsaid, \"_Everybody_ has won, and all must have prizes.\"\n\"But who is to give the prizes?\" quite a chorus of voices asked.\n\"Why, _she_, of course,\" said the Dodo, pointing to Alice with one\nfinger; and the whole party at once crowded round her, calling out in a\nconfused way, \"Prizes! Prizes!\"\nAlice had no idea what to do, and in despair she put her hand in her\npocket, and pulled out a box of comfits, (luckily the salt water had\nnot got into it), and handed them round as prizes. There was exactly",
      "length": 894,
      "num_lines": 14,
      "location": "Clearing",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Dodo",
          "role": "Announces the race outcome and assigns prizes",
          "importance": 0.9,
          "emotion": "Confused and authoritative",
          "sentiment": 0.2,
          "quote": "_Everybody_ has won, and all must have prizes.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Reluctantly gives out prizes to the group",
          "importance": 0.8,
          "emotion": "Desperate and unsure",
          "sentiment": -0.2,
          "quote": "No quote available",
          "fake_quote": "I wish I knew what to do!",
          "importance_rank": 2
        }
      ],
      "number": 4,
      "importance_rank": 1,
      "conflict_rank": 8
    },
    {
      "title": "Thimble Presentation",
      "summary": "Alice is presented with a thimble as a prize.",
      "chapter": "CHAPTER III.",
      "first_line": 80,
      "last_line": 92,
      "text": "\"But she must have a prize herself, you know,\" said the Mouse.\n\"Of course,\" the Dodo replied very gravely. \"What else have you got in\nyour pocket?\" he went on, turning to Alice.\n\"Only a thimble,\" said Alice sadly.\n\"Hand it over here,\" said the Dodo.\nThen they all crowded round her once more, while the Dodo solemnly\npresented the thimble, saying \"We beg your acceptance of this elegant\nthimble;\" and, when it had finished this short speech, they all\ncheered.\nAlice thought the whole thing very absurd, but they all looked so grave\nthat she did not dare to laugh; and, as she could not think of anything\nto say, she simply bowed, and took the thimble, looking as solemn as\nshe could.",
      "length": 683,
      "num_lines": 13,
      "location": "Clearing",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Dodo",
          "role": "Presents the thimble to Alice",
          "importance": 0.8,
          "emotion": "Serious and formal",
          "sentiment": 0.5,
          "quote": "We beg your acceptance of this elegant thimble;",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Recipient of the thimble, finds the situation absurd",
          "importance": 0.6,
          "emotion": "Confused and solemn",
          "sentiment": -0.2,
          "quote": "Only a thimble,",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Mouse",
          "role": "Suggests Alice should have a prize",
          "importance": 0.5,
          "emotion": "Inquisitive",
          "sentiment": 0.1,
          "quote": "But she must have a prize herself, you know,",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 5,
      "importance_rank": 6,
      "conflict_rank": 9
    },
    {
      "title": "Mouse's Sad Tale",
      "summary": "The Mouse begins to tell its sad story.",
      "chapter": "CHAPTER III.",
      "first_line": 101,
      "last_line": 112,
      "text": "\"Mine is a long and a sad tale!\" said the Mouse, turning to Alice, and\nsighing.\n\"It _is_ a long tail, certainly,\" said Alice, looking down with wonder\nat the Mouse's tail; \"but why do you call it sad?\" And she kept on\npuzzling about it while the Mouse was speaking, so that her idea of the\ntale was something like this:—\n\"Fury said to a mouse, That he met in the house, 'Let us both\ngo to law: _I_ will prosecute _you_.—Come, I'll take no\ndenial; We must have a trial: For really this morning I've\nnothing to do.' Said the mouse to the cur, 'Such a trial, dear\nsir, With no jury or judge, would be wasting our breath.'\n'I'll be judge, I'll be jury,' Said cunning old Fury: 'I'll",
      "length": 678,
      "num_lines": 12,
      "location": "Wonderland",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Mouse",
          "role": "Tells a sad tale and expresses emotions about it",
          "importance": 0.8,
          "emotion": "Melancholic and reflective",
          "sentiment": -0.5,
          "quote": "Mine is a long and a sad tale!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Curious and puzzled about the Mouse's tale",
          "importance": 0.6,
          "emotion": "Wondering and inquisitive",
          "sentiment": 0.5,
          "quote": "It _is_ a long tail, certainly, but why do you call it sad?",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 6,
      "importance_rank": 7,
      "conflict_rank": 2
    },
    {
      "title": "Mouse Leaves",
      "summary": "The Mouse gets offended and leaves the group.",
      "chapter": "CHAPTER III.",
      "first_line": 121,
      "last_line": 128,
      "text": "\"I shall do nothing of the sort,\" said the Mouse, getting up and\nwalking away. \"You insult me by talking such nonsense!\"\n\"I didn't mean it!\" pleaded poor Alice. \"But you're so easily offended,\nyou know!\"\nThe Mouse only growled in reply.\n\"Please come back and finish your story!\" Alice called after it; and\nthe others all joined in chorus, \"Yes, please do!\" but the Mouse only\nshook its head impatiently, and walked a little quicker.",
      "length": 432,
      "num_lines": 8,
      "location": "Clearing",
      "importance": 0.7,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Mouse",
          "role": "Refuses to continue the story",
          "importance": 0.8,
          "emotion": "Offended and irritated",
          "sentiment": -0.5,
          "quote": "I shall do nothing of the sort.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Attempts to persuade the Mouse",
          "importance": 0.6,
          "emotion": "Pleading and apologetic",
          "sentiment": 0.2,
          "quote": "I didn't mean it!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 7,
      "importance_rank": 8,
      "conflict_rank": 1
    },
    {
      "title": "Dinah Mentioned",
      "summary": "Alice talks about her cat, causing a stir.",
      "chapter": "CHAPTER III.",
      "first_line": 134,
      "last_line": 147,
      "text": "\"I wish I had our Dinah here, I know I do!\" said Alice aloud,\naddressing nobody in particular. \"She'd soon fetch it back!\"\n\"And who is Dinah, if I might venture to ask the question?\" said the\nLory.\nAlice replied eagerly, for she was always ready to talk about her pet:\n\"Dinah's our cat. And she's such a capital one for catching mice you\ncan't think! And oh, I wish you could see her after the birds! Why,\nshe'll eat a little bird as soon as look at it!\"\nThis speech caused a remarkable sensation among the party. Some of the\nbirds hurried off at once: one old Magpie began wrapping itself up very\ncarefully, remarking, \"I really must be getting home; the night-air\ndoesn't suit my throat!\" and a Canary called out in a trembling voice\nto its children, \"Come away, my dears! It's high time you were all in\nbed!\" On various pretexts they all moved off, and Alice was soon left",
      "length": 875,
      "num_lines": 14,
      "location": "Clearing",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Expresses longing for her cat Dinah",
          "importance": 1.0,
          "emotion": "Nostalgic and eager",
          "sentiment": 0.5,
          "quote": "I wish I had our Dinah here, I know I do!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Lory",
          "role": "Inquires about Dinah",
          "importance": 0.5,
          "emotion": "Curious",
          "sentiment": 0.2,
          "quote": "And who is Dinah, if I might venture to ask the question?",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Magpie",
          "role": "Decides to leave due to Alice's mention of Dinah",
          "importance": 0.4,
          "emotion": "Nervous",
          "sentiment": -0.3,
          "quote": "I really must be getting home; the night-air doesn't suit my throat!",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Canary",
          "role": "Calls its children to leave after Alice's speech",
          "importance": 0.4,
          "emotion": "Protective",
          "sentiment": -0.2,
          "quote": "Come away, my dears! It's high time you were all in bed!",
          "fake_quote": "",
          "importance_rank": 4
        }
      ],
      "number": 8,
      "importance_rank": 9,
      "conflict_rank": 6
    },
    {
      "title": "Alice Alone",
      "summary": "Alice feels lonely after the others leave.",
      "chapter": "CHAPTER III.",
      "first_line": 149,
      "last_line": 156,
      "text": "\"I wish I hadn't mentioned Dinah!\" she said to herself in a melancholy\ntone. \"Nobody seems to like her, down here, and I'm sure she's the best\ncat in the world! Oh, my dear Dinah! I wonder if I shall ever see you\nany more!\" And here poor Alice began to cry again, for she felt very\nlonely and low-spirited. In a little while, however, she again heard a\nlittle pattering of footsteps in the distance, and she looked up\neagerly, half hoping that the Mouse had changed his mind, and was\ncoming back to finish his story.",
      "length": 516,
      "num_lines": 8,
      "location": "Clearing",
      "importance": 0.8,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Feeling lonely and nostalgic",
          "importance": 1.0,
          "emotion": "Melancholy and longing",
          "sentiment": -0.5,
          "quote": "I wish I hadn't mentioned Dinah!",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 9,
      "importance_rank": 2,
      "conflict_rank": 7
    },
    {
      "title": "The Rabbit's Panic",
      "summary": "The White Rabbit frantically searches for lost items.",
      "chapter": "CHAPTER IV.",
      "first_line": 2,
      "last_line": 11,
      "text": "It was the White Rabbit, trotting slowly back again, and looking\nanxiously about as it went, as if it had lost something; and she heard\nit muttering to itself \"The Duchess! The Duchess! Oh my dear paws! Oh\nmy fur and whiskers! She'll get me executed, as sure as ferrets are\nferrets! Where _can_ I have dropped them, I wonder?\" Alice guessed in a\nmoment that it was looking for the fan and the pair of white kid\ngloves, and she very good-naturedly began hunting about for them, but\nthey were nowhere to be seen—everything seemed to have changed since\nher swim in the pool, and the great hall, with the glass table and the\nlittle door, had vanished completely.",
      "length": 658,
      "num_lines": 10,
      "location": "Hall",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "White Rabbit",
          "role": "Searching for lost items",
          "importance": 0.9,
          "emotion": "Anxious and worried",
          "sentiment": -0.5,
          "quote": "The Duchess! The Duchess! Oh my dear paws! Oh my fur and whiskers! She'll get me executed, as sure as ferrets are ferrets! Where _can_ I have dropped them, I wonder?",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Helping the White Rabbit",
          "importance": 0.6,
          "emotion": "Good-natured and helpful",
          "sentiment": 0.5,
          "quote": "No quote available",
          "fake_quote": "I will help you find them, don't worry!",
          "importance_rank": 2
        }
      ],
      "number": 1,
      "importance_rank": 6,
      "conflict_rank": 5
    },
    {
      "title": "Alice's Mistaken Identity",
      "summary": "Alice is mistaken for the Rabbit's maid.",
      "chapter": "CHAPTER IV.",
      "first_line": 12,
      "last_line": 25,
      "text": "Very soon the Rabbit noticed Alice, as she went hunting about, and\ncalled out to her in an angry tone, \"Why, Mary Ann, what _are_ you\ndoing out here? Run home this moment, and fetch me a pair of gloves and\na fan! Quick, now!\" And Alice was so much frightened that she ran off\nat once in the direction it pointed to, without trying to explain the\nmistake it had made.\n\"He took me for his housemaid,\" she said to herself as she ran. \"How\nsurprised he'll be when he finds out who I am! But I'd better take him\nhis fan and gloves—that is, if I can find them.\" As she said this, she\ncame upon a neat little house, on the door of which was a bright brass\nplate with the name \"W. RABBIT,\" engraved upon it. She went in without\nknocking, and hurried upstairs, in great fear lest she should meet the\nreal Mary Ann, and be turned out of the house before she had found the\nfan and gloves.",
      "length": 877,
      "num_lines": 14,
      "location": "Rabbit's House",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Mistaken for the Rabbit's maid",
          "importance": 0.9,
          "emotion": "Frustrated and anxious",
          "sentiment": -0.5,
          "quote": "He took me for his housemaid.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Commands Alice to fetch items",
          "importance": 0.8,
          "emotion": "Angry and demanding",
          "sentiment": -0.7,
          "quote": "Why, Mary Ann, what _are_ you doing out here? Run home this moment, and fetch me a pair of gloves and a fan! Quick, now!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 2,
      "importance_rank": 1,
      "conflict_rank": 6
    },
    {
      "title": "The Growing Dilemma",
      "summary": "Alice drinks from a bottle and grows larger.",
      "chapter": "CHAPTER IV.",
      "first_line": 33,
      "last_line": 58,
      "text": "By this time she had found her way into a tidy little room with a table\nin the window, and on it (as she had hoped) a fan and two or three\npairs of tiny white kid gloves: she took up the fan and a pair of the\ngloves, and was just going to leave the room, when her eye fell upon a\nlittle bottle that stood near the looking-glass. There was no label\nthis time with the words \"DRINK ME,\" but nevertheless she uncorked it\nand put it to her lips. \"I know _something_ interesting is sure to\nhappen,\" she said to herself, \"whenever I eat or drink anything; so\nI'll just see what this bottle does. I do hope it'll make me grow large\nagain, for really I'm quite tired of being such a tiny little thing!\"\nIt did so indeed, and much sooner than she had expected: before she had\ndrunk half the bottle, she found her head pressing against the ceiling,\nand had to stoop to save her neck from being broken. She hastily put\ndown the bottle, saying to herself \"That's quite enough—I hope I shan't\ngrow any more—As it is, I can't get out at the door—I do wish I hadn't\ndrunk quite so much!\"\nAlas! it was too late to wish that! She went on growing, and growing,\nand very soon had to kneel down on the floor: in another minute there\nwas not even room for this, and she tried the effect of lying down with\none elbow against the door, and the other arm curled round her head.\nStill she went on growing, and, as a last resource, she put one arm out\nof the window, and one foot up the chimney, and said to herself \"Now I\ncan do no more, whatever happens. What _will_ become of me?\"\nLuckily for Alice, the little magic bottle had now had its full effect,\nand she grew no larger: still it was very uncomfortable, and, as there\nseemed to be no sort of chance of her ever getting out of the room",
      "length": 1767,
      "num_lines": 26,
      "location": "Rabbit's House",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and adventurous girl",
          "importance": 1.0,
          "emotion": "Anxious and hopeful",
          "sentiment": 0.5,
          "quote": "I know _something_ interesting is sure to happen, whenever I eat or drink anything; so I'll just see what this bottle does.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Magic Bottle",
          "role": "Catalyst for Alice's transformation",
          "importance": 0.5,
          "emotion": "Neutral",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "I hold the power to change everything.",
          "importance_rank": 2
        }
      ],
      "number": 3,
      "importance_rank": 2,
      "conflict_rank": 1
    },
    {
      "title": "The Rabbit's Return",
      "summary": "The Rabbit returns, looking for Alice.",
      "chapter": "CHAPTER IV.",
      "first_line": 77,
      "last_line": 92,
      "text": "she heard a voice outside, and stopped to listen.\n\"Mary Ann! Mary Ann!\" said the voice. \"Fetch me my gloves this moment!\"\nThen came a little pattering of feet on the stairs. Alice knew it was\nthe Rabbit coming to look for her, and she trembled till she shook the\nhouse, quite forgetting that she was now about a thousand times as\nlarge as the Rabbit, and had no reason to be afraid of it.\nPresently the Rabbit came up to the door, and tried to open it; but, as\nthe door opened inwards, and Alice's elbow was pressed hard against it,\nthat attempt proved a failure. Alice heard it say to itself \"Then I'll\ngo round and get in at the window.\"\n\"_That_ you won't!\" thought Alice, and, after waiting till she fancied\nshe heard the Rabbit just under the window, she suddenly spread out her\nhand, and made a snatch in the air. She did not get hold of anything,\nbut she heard a little shriek and a fall, and a crash of broken glass,\nfrom which she concluded that it was just possible it had fallen into a\ncucumber-frame, or something of the sort.",
      "length": 1037,
      "num_lines": 16,
      "location": "Rabbit's House",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Alice",
          "role": "Alice is trying to defend her space from the Rabbit and feels a mix of fear and defiance.",
          "importance": 1.0,
          "emotion": "Defiant and anxious",
          "sentiment": 0.2,
          "quote": "_That_ you won't!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "The Rabbit is searching for Alice and is frustrated by the closed door.",
          "importance": 0.8,
          "emotion": "Frustrated and determined",
          "sentiment": -0.2,
          "quote": "Then I'll go round and get in at the window.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 4,
      "importance_rank": 3,
      "conflict_rank": 3
    },
    {
      "title": "Bill's Misadventure",
      "summary": "Bill the Lizard is sent down the chimney.",
      "chapter": "CHAPTER IV.",
      "first_line": 113,
      "last_line": 141,
      "text": "rumbling of little cartwheels, and the sound of a good many voices all\ntalking together: she made out the words: \"Where's the other\nladder?—Why, I hadn't to bring but one; Bill's got the other—Bill!\nfetch it here, lad!—Here, put 'em up at this corner—No, tie 'em\ntogether first—they don't reach half high enough yet—Oh! they'll do\nwell enough; don't be particular—Here, Bill! catch hold of this\nrope—Will the roof bear?—Mind that loose slate—Oh, it's coming down!\nHeads below!\" (a loud crash)—\"Now, who did that?—It was Bill, I\nfancy—Who's to go down the chimney?—Nay, _I_ shan't! _You_ do\nit!—_That_ I won't, then!—Bill's to go down—Here, Bill! the master says\nyou're to go down the chimney!\"\n\"Oh! So Bill's got to come down the chimney, has he?\" said Alice to\nherself. \"Shy, they seem to put everything upon Bill! I wouldn't be in\nBill's place for a good deal: this fireplace is narrow, to be sure; but\nI _think_ I can kick a little!\"\nShe drew her foot as far down the chimney as she could, and waited till\nshe heard a little animal (she couldn't guess of what sort it was)\nscratching and scrambling about in the chimney close above her: then,\nsaying to herself \"This is Bill,\" she gave one sharp kick, and waited\nto see what would happen next.\nThe first thing she heard was a general chorus of \"There goes Bill!\"\nthen the Rabbit's voice along—\"Catch him, you by the hedge!\" then\nsilence, and then another confusion of voices—\"Hold up his head—Brandy\nnow—Don't choke him—How was it, old fellow? What happened to you? Tell\nus all about it!\"\nLast came a little feeble, squeaking voice, (\"That's Bill,\" thought\nAlice,) \"Well, I hardly know—No more, thank ye; I'm better now—but I'm\na deal too flustered to tell you—all I know is, something comes at me\nlike a Jack-in-the-box, and up I goes like a sky-rocket!\"",
      "length": 1808,
      "num_lines": 29,
      "location": "Rabbit's House",
      "importance": 0.7,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Alice",
          "role": "Observing and commenting on Bill's situation",
          "importance": 0.8,
          "emotion": "Curious and amused",
          "sentiment": 0.5,
          "quote": "Shy, they seem to put everything upon Bill! I wouldn't be in Bill's place for a good deal: this fireplace is narrow, to be sure; but I think I can kick a little!",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Bill",
          "role": "The character who is forced to go down the chimney",
          "importance": 0.9,
          "emotion": "Flustered and confused",
          "sentiment": -0.5,
          "quote": "Well, I hardly know—No more, thank ye; I'm better now—but I'm a deal too flustered to tell you—all I know is, something comes at me like a Jack-in-the-box, and up I goes like a sky-rocket!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Instructing others and reacting to Bill's situation",
          "importance": 0.6,
          "emotion": "Urgent and concerned",
          "sentiment": 0.3,
          "quote": "Catch him, you by the hedge!",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 5,
      "importance_rank": 7,
      "conflict_rank": 4
    },
    {
      "title": "Alice's Threat",
      "summary": "Alice threatens the Rabbit and his friends.",
      "chapter": "CHAPTER IV.",
      "first_line": 143,
      "last_line": 153,
      "text": "\"We must burn the house down!\" said the Rabbit's voice; and Alice\ncalled out as loud as she could, \"If you do, I'll set Dinah at you!\"\nThere was a dead silence instantly, and Alice thought to herself, \"I\nwonder what they _will_ do next! If they had any sense, they'd take the\nroof off.\" After a minute or two, they began moving about again, and\nAlice heard the Rabbit say, \"A barrowful will do, to begin with.\"\n\"A barrowful of _what?_\" thought Alice; but she had not long to doubt,\nfor the next moment a shower of little pebbles came rattling in at the\nwindow, and some of them hit her in the face. \"I'll put a stop to\nthis,\" she said to herself, and shouted out, \"You'd better not do that\nagain!\" which produced another dead silence.",
      "length": 734,
      "num_lines": 11,
      "location": "Rabbit's House",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "Defends against the Rabbit's plan",
          "importance": 1.0,
          "emotion": "Defiant and protective",
          "sentiment": 0.5,
          "quote": "If you do, I'll set Dinah at you!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Proposes to burn the house down",
          "importance": 0.8,
          "emotion": "Urgent and reckless",
          "sentiment": -0.5,
          "quote": "We must burn the house down!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 6,
      "importance_rank": 4,
      "conflict_rank": 2
    },
    {
      "title": "The Cake Transformation",
      "summary": "Alice eats a cake and shrinks down.",
      "chapter": "CHAPTER IV.",
      "first_line": 154,
      "last_line": 161,
      "text": "Alice noticed with some surprise that the pebbles were all turning into\nlittle cakes as they lay on the floor, and a bright idea came into her\nhead. \"If I eat one of these cakes,\" she thought, \"it's sure to make\n_some_ change in my size; and as it can't possibly make me larger, it\nmust make me smaller, I suppose.\"\nSo she swallowed one of the cakes, and was delighted to find that she\nbegan shrinking directly. As soon as she was small enough to get\nthrough the door, she ran out of the house, and found quite a crowd of",
      "length": 521,
      "num_lines": 8,
      "location": "Rabbit's House",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and adventurous girl",
          "importance": 1.0,
          "emotion": "Surprised and delighted",
          "sentiment": 0.8,
          "quote": "If I eat one of these cakes, it's sure to make some change in my size; and as it can't possibly make me larger, it must make me smaller, I suppose.",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 7,
      "importance_rank": 5,
      "conflict_rank": 7
    },
    {
      "title": "The Enormous Puppy Encounter",
      "summary": "Alice meets a large puppy and plays with it.",
      "chapter": "CHAPTER IV.",
      "first_line": 166,
      "last_line": 197,
      "text": "safe in a thick wood.\n\"The first thing I've got to do,\" said Alice to herself, as she\nwandered about in the wood, \"is to grow to my right size again; and the\nsecond thing is to find my way into that lovely garden. I think that\nwill be the best plan.\"\nIt sounded an excellent plan, no doubt, and very neatly and simply\narranged; the only difficulty was, that she had not the smallest idea\nhow to set about it; and while she was peering about anxiously among\nthe trees, a little sharp bark just over her head made her look up in a\ngreat hurry.\nAn enormous puppy was looking down at her with large round eyes, and\nfeebly stretching out one paw, trying to touch her. \"Poor little\nthing!\" said Alice, in a coaxing tone, and she tried hard to whistle to\nit; but she was terribly frightened all the time at the thought that it\nmight be hungry, in which case it would be very likely to eat her up in\nspite of all her coaxing.\nHardly knowing what she did, she picked up a little bit of stick, and\nheld it out to the puppy; whereupon the puppy jumped into the air off\nall its feet at once, with a yelp of delight, and rushed at the stick,\nand made believe to worry it; then Alice dodged behind a great thistle,\nto keep herself from being run over; and the moment she appeared on the\nother side, the puppy made another rush at the stick, and tumbled head\nover heels in its hurry to get hold of it; then Alice, thinking it was\nvery like having a game of play with a cart-horse, and expecting every\nmoment to be trampled under its feet, ran round the thistle again; then\nthe puppy began a series of short charges at the stick, running a very\nlittle way forwards each time and a long way back, and barking hoarsely\nall the while, till at last it sat down a good way off, panting, with\nits tongue hanging out of its mouth, and its great eyes half shut.\nThis seemed to Alice a good opportunity for making her escape; so she\nset off at once, and ran till she was quite tired and out of breath,\nand till the puppy's bark sounded quite faint in the distance.",
      "length": 2039,
      "num_lines": 32,
      "location": "Wood",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to navigate her situation",
          "importance": 1.0,
          "emotion": "anxious and frightened",
          "sentiment": -0.5,
          "quote": "The first thing I've got to do... is to grow to my right size again; and the second thing is to find my way into that lovely garden.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Enormous Puppy",
          "role": "Playfully interacting with Alice",
          "importance": 0.8,
          "emotion": "playful and energetic",
          "sentiment": 0.5,
          "quote": "Poor little thing!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 8,
      "importance_rank": 8,
      "conflict_rank": 8
    },
    {
      "title": "The Caterpillar's Appearance",
      "summary": "Alice discovers a caterpillar on a mushroom.",
      "chapter": "CHAPTER IV.",
      "first_line": 208,
      "last_line": 216,
      "text": "There was a large mushroom growing near her, about the same height as\nherself; and when she had looked under it, and on both sides of it, and\nbehind it, it occurred to her that she might as well look and see what\nwas on the top of it.\nShe stretched herself up on tiptoe, and peeped over the edge of the\nmushroom, and her eyes immediately met those of a large blue\ncaterpillar, that was sitting on the top with its arms folded, quietly\nsmoking a long hookah, and taking not the smallest notice of her or of\nanything else.",
      "length": 520,
      "num_lines": 9,
      "location": "Caterpillar's Garden",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and exploring her surroundings",
          "importance": 0.8,
          "emotion": "Curiosity and determination",
          "sentiment": 0.5,
          "quote": "No quote available",
          "fake_quote": "I wonder what secrets this mushroom holds.",
          "importance_rank": 1
        },
        {
          "name": "Blue Caterpillar",
          "role": "Indifferent observer, smoking hookah",
          "importance": 0.5,
          "emotion": "Calm and detached",
          "sentiment": 0.2,
          "quote": "No quote available",
          "fake_quote": "Why bother with the world below?",
          "importance_rank": 2
        }
      ],
      "number": 9,
      "importance_rank": 9,
      "conflict_rank": 9
    },
    {
      "title": "Caterpillar's Inquiry",
      "summary": "Alice meets the Caterpillar and discusses identity.",
      "chapter": "CHAPTER V.",
      "first_line": 1,
      "last_line": 34,
      "text": "Advice from a Caterpillar\nThe Caterpillar and Alice looked at each other for some time in\nsilence: at last the Caterpillar took the hookah out of its mouth, and\naddressed her in a languid, sleepy voice.\n\"Who are _you?_\" said the Caterpillar.\nThis was not an encouraging opening for a conversation. Alice replied,\nrather shyly, \"I—I hardly know, sir, just at present—at least I know\nwho I _was_ when I got up this morning, but I think I must have been\nchanged several times since then.\"\n\"What do you mean by that?\" said the Caterpillar sternly. \"Explain\nyourself!\"\n\"I can't explain _myself_, I'm afraid, sir,\" said Alice, \"because I'm\nnot myself, you see.\"\n\"I don't see,\" said the Caterpillar.\n\"I'm afraid I can't put it more clearly,\" Alice replied very politely,\n\"for I can't understand it myself to begin with; and being so many\ndifferent sizes in a day is very confusing.\"\n\"It isn't,\" said the Caterpillar.\n\"Well, perhaps you haven't found it so yet,\" said Alice; \"but when you\nhave to turn into a chrysalis—you will some day, you know—and then\nafter that into a butterfly, I should think you'll feel it a little\nqueer, won't you?\"\n\"Not a bit,\" said the Caterpillar.\n\"Well, perhaps your feelings may be different,\" said Alice; \"all I know\nis, it would feel very queer to _me_.\"\n\"You!\" said the Caterpillar contemptuously. \"Who are _you?_\"\nWhich brought them back again to the beginning of the conversation.\nAlice felt a little irritated at the Caterpillar's making such _very_\nshort remarks, and she drew herself up and said, very gravely, \"I\nthink, you ought to tell me who _you_ are, first.\"\n\"Why?\" said the Caterpillar.\nHere was another puzzling question; and as Alice could not think of any\ngood reason, and as the Caterpillar seemed to be in a _very_ unpleasant\nstate of mind, she turned away.",
      "length": 1801,
      "num_lines": 34,
      "location": "Caterpillar's Garden",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Blue Caterpillar",
          "role": "Questioning Alice's identity",
          "importance": 1.0,
          "emotion": "Languid and contemptuous",
          "sentiment": -0.5,
          "quote": "Who are _you?_",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Trying to explain her confusion",
          "importance": 1.0,
          "emotion": "Shy and irritated",
          "sentiment": 0.2,
          "quote": "I—I hardly know, sir, just at present—at least I know who I _was_ when I got up this morning, but I think I must have been changed several times since then.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 1,
      "importance_rank": 1,
      "conflict_rank": 2
    },
    {
      "title": "Caterpillar's Riddles",
      "summary": "The Caterpillar challenges Alice to recite a poem.",
      "chapter": "CHAPTER V.",
      "first_line": 35,
      "last_line": 90,
      "text": "\"Come back!\" the Caterpillar called after her. \"I've something\nimportant to say!\"\nThis sounded promising, certainly: Alice turned and came back again.\n\"Keep your temper,\" said the Caterpillar.\n\"Is that all?\" said Alice, swallowing down her anger as well as she\ncould.\n\"No,\" said the Caterpillar.\nAlice thought she might as well wait, as she had nothing else to do,\nand perhaps after all it might tell her something worth hearing. For\nsome minutes it puffed away without speaking, but at last it unfolded\nits arms, took the hookah out of its mouth again, and said, \"So you\nthink you're changed, do you?\"\n\"I'm afraid I am, sir,\" said Alice; \"I can't remember things as I\nused—and I don't keep the same size for ten minutes together!\"\n\"Can't remember _what_ things?\" said the Caterpillar.\n\"Well, I've tried to say \"How doth the little busy bee,\" but it all\ncame different!\" Alice replied in a very melancholy voice.\n\"Repeat, \"_You are old, Father William_,'\" said the Caterpillar.\nAlice folded her hands, and began:—\n\"You are old, Father William,\" the young man said,\n\"And your hair has become very white;\nAnd yet you incessantly stand on your head—\nDo you think, at your age, it is right?\"\n\"In my youth,\" Father William replied to his son,\n\"I feared it might injure the brain;\nBut, now that I'm perfectly sure I have none,\nWhy, I do it again and again.\"\n\"You are old,\" said the youth, \"as I mentioned before,\nAnd have grown most uncommonly fat;\nYet you turned a back-somersault in at the door—\nPray, what is the reason of that?\"\n\"In my youth,\" said the sage, as he shook his grey locks,\n\"I kept all my limbs very supple\nBy the use of this ointment—one shilling the box—\nAllow me to sell you a couple?\"\n\"You are old,\" said the youth, \"and your jaws are too weak\nFor anything tougher than suet;\nYet you finished the goose, with the bones and the beak—\nPray, how did you manage to do it?\"\n\"In my youth,\" said his father, \"I took to the law,\nAnd argued each case with my wife;\nAnd the muscular strength, which it gave to my jaw,\nHas lasted the rest of my life.\"\n\"You are old,\" said the youth, \"one would hardly suppose\nThat your eye was as steady as ever;\nYet you balanced an eel on the end of your nose—\nWhat made you so awfully clever?\"\n\"I have answered three questions, and that is enough,\"\nSaid his father; \"don't give yourself airs!\nDo you think I can listen all day to such stuff?\nBe off, or I'll kick you down stairs!\"\n\"That is not said right,\" said the Caterpillar.\n\"Not _quite_ right, I'm afraid,\" said Alice, timidly; \"some of the\nwords have got altered.\"\n\"It is wrong from beginning to end,\" said the Caterpillar decidedly,\nand there was silence for some minutes.",
      "length": 2668,
      "num_lines": 56,
      "location": "Caterpillar's Garden",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Seeking answers about her changes",
          "importance": 0.9,
          "emotion": "Frustrated and melancholic",
          "sentiment": -0.5,
          "quote": "I'm afraid I am, sir; I can't remember things as I used—and I don't keep the same size for ten minutes together!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Blue Caterpillar",
          "role": "Questioning Alice's identity and knowledge",
          "importance": 0.8,
          "emotion": "Calm and authoritative",
          "sentiment": 0.2,
          "quote": "So you think you're changed, do you?",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 2,
      "importance_rank": 2,
      "conflict_rank": 5
    },
    {
      "title": "Size Matters",
      "summary": "Alice and the Caterpillar debate size preferences.",
      "chapter": "CHAPTER V.",
      "first_line": 91,
      "last_line": 107,
      "text": "The Caterpillar was the first to speak.\n\"What size do you want to be?\" it asked.\n\"Oh, I'm not particular as to size,\" Alice hastily replied; \"only one\ndoesn't like changing so often, you know.\"\n\"I _don't_ know,\" said the Caterpillar.\nAlice said nothing: she had never been so much contradicted in her life\nbefore, and she felt that she was losing her temper.\n\"Are you content now?\" said the Caterpillar.\n\"Well, I should like to be a _little_ larger, sir, if you wouldn't\nmind,\" said Alice: \"three inches is such a wretched height to be.\"\n\"It is a very good height indeed!\" said the Caterpillar angrily,\nrearing itself upright as it spoke (it was exactly three inches high).\n\"But I'm not used to it!\" pleaded poor Alice in a piteous tone. And she\nthought of herself, \"I wish the creatures wouldn't be so easily\noffended!\"\n\"You'll get used to it in time,\" said the Caterpillar; and it put the\nhookah into its mouth and began smoking again.",
      "length": 937,
      "num_lines": 17,
      "location": "Caterpillar's Garden",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Blue Caterpillar",
          "role": "Challenges Alice's feelings about size",
          "importance": 0.9,
          "emotion": "Defensive and confrontational",
          "sentiment": -0.5,
          "quote": "It is a very good height indeed!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Expresses frustration and confusion",
          "importance": 0.8,
          "emotion": "Frustrated and pleading",
          "sentiment": -0.3,
          "quote": "Well, I should like to be a _little_ larger, sir, if you wouldn't mind.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 3,
      "importance_rank": 3,
      "conflict_rank": 3
    },
    {
      "title": "Caterpillar Departs",
      "summary": "The Caterpillar leaves, giving Alice advice about the mushroom.",
      "chapter": "CHAPTER V.",
      "first_line": 108,
      "last_line": 117,
      "text": "This time Alice waited patiently until it chose to speak again. In a\nminute or two the Caterpillar took the hookah out of its mouth and\nyawned once or twice, and shook itself. Then it got down off the\nmushroom, and crawled away in the grass, merely remarking as it went,\n\"One side will make you grow taller, and the other side will make you\ngrow shorter.\"\n\"One side of _what?_ The other side of _what?_\" thought Alice to\nherself.\n\"Of the mushroom,\" said the Caterpillar, just as if she had asked it\naloud; and in another moment it was out of sight.",
      "length": 548,
      "num_lines": 10,
      "location": "Caterpillar's Garden",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and confused about the Caterpillar's advice",
          "importance": 0.8,
          "emotion": "Curiosity mixed with confusion",
          "sentiment": 0.2,
          "quote": "One side of _what?_ The other side of _what?_",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Blue Caterpillar",
          "role": "Mysterious guide providing cryptic advice",
          "importance": 0.7,
          "emotion": "Indifferent and enigmatic",
          "sentiment": 0.1,
          "quote": "One side will make you grow taller, and the other side will make you grow shorter.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 4,
      "importance_rank": 7,
      "conflict_rank": 8
    },
    {
      "title": "Alice's Transformation",
      "summary": "Alice eats the mushroom and begins to change size.",
      "chapter": "CHAPTER V.",
      "first_line": 118,
      "last_line": 131,
      "text": "Alice remained looking thoughtfully at the mushroom for a minute,\ntrying to make out which were the two sides of it; and as it was\nperfectly round, she found this a very difficult question. However, at\nlast she stretched her arms round it as far as they would go, and broke\noff a bit of the edge with each hand.\n\"And now which is which?\" she said to herself, and nibbled a little of\nthe right-hand bit to try the effect: the next moment she felt a\nviolent blow underneath her chin: it had struck her foot!\nShe was a good deal frightened by this very sudden change, but she felt\nthat there was no time to be lost, as she was shrinking rapidly; so she\nset to work at once to eat some of the other bit. Her chin was pressed\nso closely against her foot, that there was hardly room to open her\nmouth; but she did it at last, and managed to swallow a morsel of the\nlefthand bit.",
      "length": 872,
      "num_lines": 14,
      "location": "Caterpillar's Garden",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to understand the mushroom",
          "importance": 1.0,
          "emotion": "Curious and frightened",
          "sentiment": 0.2,
          "quote": "And now which is which?",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 5,
      "importance_rank": 8,
      "conflict_rank": 6
    },
    {
      "title": "Neck Trouble",
      "summary": "Alice discovers her long neck and encounters a Pigeon.",
      "chapter": "CHAPTER V.",
      "first_line": 132,
      "last_line": 151,
      "text": "* * * * * * *\n* * * * * *\n* * * * * * *\n\"Come, my head's free at last!\" said Alice in a tone of delight, which\nchanged into alarm in another moment, when she found that her shoulders\nwere nowhere to be found: all she could see, when she looked down, was\nan immense length of neck, which seemed to rise like a stalk out of a\nsea of green leaves that lay far below her.\n\"What _can_ all that green stuff be?\" said Alice. \"And where _have_ my\nshoulders got to? And oh, my poor hands, how is it I can't see you?\"\nShe was moving them about as she spoke, but no result seemed to follow,\nexcept a little shaking among the distant green leaves.\nAs there seemed to be no chance of getting her hands up to her head,\nshe tried to get her head down to them, and was delighted to find that\nher neck would bend about easily in any direction, like a serpent. She\nhad just succeeded in curving it down into a graceful zigzag, and was\ngoing to dive in among the leaves, which she found to be nothing but\nthe tops of the trees under which she had been wandering, when a sharp\nhiss made her draw back in a hurry: a large pigeon had flown into her\nface, and was beating her violently with its wings.",
      "length": 1178,
      "num_lines": 20,
      "location": "Wood",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and alarmed about her body",
          "importance": 1.0,
          "emotion": "Delight turning to alarm",
          "sentiment": 0.2,
          "quote": "Come, my head's free at last!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Pigeon",
          "role": "Aggressive and defensive towards Alice",
          "importance": 0.5,
          "emotion": "Aggressive",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "Stay away from my nest!",
          "importance_rank": 2
        }
      ],
      "number": 6,
      "importance_rank": 4,
      "conflict_rank": 4
    },
    {
      "title": "Pigeon Confrontation",
      "summary": "Alice argues with the Pigeon about her identity.",
      "chapter": "CHAPTER V.",
      "first_line": 152,
      "last_line": 190,
      "text": "\"Serpent!\" screamed the Pigeon.\n\"I'm _not_ a serpent!\" said Alice indignantly. \"Let me alone!\"\n\"Serpent, I say again!\" repeated the Pigeon, but in a more subdued\ntone, and added with a kind of sob, \"I've tried every way, and nothing\nseems to suit them!\"\n\"I haven't the least idea what you're talking about,\" said Alice.\n\"I've tried the roots of trees, and I've tried banks, and I've tried\nhedges,\" the Pigeon went on, without attending to her; \"but those\nserpents! There's no pleasing them!\"\nAlice was more and more puzzled, but she thought there was no use in\nsaying anything more till the Pigeon had finished.\n\"As if it wasn't trouble enough hatching the eggs,\" said the Pigeon;\n\"but I must be on the look-out for serpents night and day! Why, I\nhaven't had a wink of sleep these three weeks!\"\n\"I'm very sorry you've been annoyed,\" said Alice, who was beginning to\nsee its meaning.\n\"And just as I'd taken the highest tree in the wood,\" continued the\nPigeon, raising its voice to a shriek, \"and just as I was thinking I\nshould be free of them at last, they must needs come wriggling down\nfrom the sky! Ugh, Serpent!\"\n\"But I'm _not_ a serpent, I tell you!\" said Alice. \"I'm a—I'm a—\"\n\"Well! _What_ are you?\" said the Pigeon. \"I can see you're trying to\ninvent something!\"\n\"I—I'm a little girl,\" said Alice, rather doubtfully, as she remembered\nthe number of changes she had gone through that day.\n\"A likely story indeed!\" said the Pigeon in a tone of the deepest\ncontempt. \"I've seen a good many little girls in my time, but never\n_one_ with such a neck as that! No, no! You're a serpent; and there's\nno use denying it. I suppose you'll be telling me next that you never\ntasted an egg!\"\n\"I _have_ tasted eggs, certainly,\" said Alice, who was a very truthful\nchild; \"but little girls eat eggs quite as much as serpents do, you\nknow.\"\n\"I don't believe it,\" said the Pigeon; \"but if they do, why then\nthey're a kind of serpent, that's all I can say.\"\nThis was such a new idea to Alice, that she was quite silent for a\nminute or two, which gave the Pigeon the opportunity of adding, \"You're\nlooking for eggs, I know _that_ well enough; and what does it matter to\nme whether you're a little girl or a serpent?\"",
      "length": 2204,
      "num_lines": 39,
      "location": "Clearing",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "Defending herself against accusations",
          "importance": 1.0,
          "emotion": "Indignant and puzzled",
          "sentiment": 0.2,
          "quote": "I'm _not_ a serpent!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Pigeon",
          "role": "Accusing Alice of being a serpent",
          "importance": 1.0,
          "emotion": "Frustrated and distressed",
          "sentiment": -0.5,
          "quote": "I've tried every way, and nothing seems to suit them!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 7,
      "importance_rank": 5,
      "conflict_rank": 1
    },
    {
      "title": "Returning to Size",
      "summary": "Alice manages to return to her normal height.",
      "chapter": "CHAPTER V.",
      "first_line": 191,
      "last_line": 213,
      "text": "\"It matters a good deal to _me_,\" said Alice hastily; \"but I'm not\nlooking for eggs, as it happens; and if I was, I shouldn't want\n_yours_: I don't like them raw.\"\n\"Well, be off, then!\" said the Pigeon in a sulky tone, as it settled\ndown again into its nest. Alice crouched down among the trees as well\nas she could, for her neck kept getting entangled among the branches,\nand every now and then she had to stop and untwist it. After a while\nshe remembered that she still held the pieces of mushroom in her hands,\nand she set to work very carefully, nibbling first at one and then at\nthe other, and growing sometimes taller and sometimes shorter, until\nshe had succeeded in bringing herself down to her usual height.\nIt was so long since she had been anything near the right size, that it\nfelt quite strange at first; but she got used to it in a few minutes,\nand began talking to herself, as usual. \"Come, there's half my plan\ndone now! How puzzling all these changes are! I'm never sure what I'm\ngoing to be, from one minute to another! However, I've got back to my\nright size: the next thing is, to get into that beautiful garden—how\n_is_ that to be done, I wonder?\" As she said this, she came suddenly\nupon an open place, with a little house in it about four feet high.\n\"Whoever lives there,\" thought Alice, \"it'll never do to come upon them\n_this_ size: why, I should frighten them out of their wits!\" So she\nbegan nibbling at the righthand bit again, and did not venture to go\nnear the house till she had brought herself down to nine inches high.",
      "length": 1551,
      "num_lines": 23,
      "location": "Wood",
      "importance": 0.8,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Determined to return to her normal size and enter the garden",
          "importance": 1.0,
          "emotion": "Frustrated yet hopeful",
          "sentiment": 0.5,
          "quote": "It matters a good deal to _me_",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Pigeon",
          "role": "Dismissive and sulky towards Alice",
          "importance": 0.5,
          "emotion": "Irritated",
          "sentiment": -0.5,
          "quote": "Well, be off, then!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 8,
      "importance_rank": 6,
      "conflict_rank": 7
    },
    {
      "title": "Footmen's Invitation",
      "summary": "Alice observes two footmen delivering an invitation.",
      "chapter": "CHAPTER VI.",
      "first_line": 1,
      "last_line": 21,
      "text": "Pig and Pepper\nFor a minute or two she stood looking at the house, and wondering what\nto do next, when suddenly a footman in livery came running out of the\nwood—(she considered him to be a footman because he was in livery:\notherwise, judging by his face only, she would have called him a\nfish)—and rapped loudly at the door with his knuckles. It was opened by\nanother footman in livery, with a round face, and large eyes like a\nfrog; and both footmen, Alice noticed, had powdered hair that curled\nall over their heads. She felt very curious to know what it was all\nabout, and crept a little way out of the wood to listen.\nThe Fish-Footman began by producing from under his arm a great letter,\nnearly as large as himself, and this he handed over to the other,\nsaying, in a solemn tone, \"For the Duchess. An invitation from the\nQueen to play croquet.\" The Frog-Footman repeated, in the same solemn\ntone, only changing the order of the words a little, \"From the Queen.\nAn invitation for the Duchess to play croquet.\"\nThen they both bowed low, and their curls got entangled together.\nAlice laughed so much at this, that she had to run back into the wood\nfor fear of their hearing her; and when she next peeped out the\nFish-Footman was gone, and the other was sitting on the ground near the\ndoor, staring stupidly up into the sky.",
      "length": 1325,
      "num_lines": 21,
      "location": "Duchess's House",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious observer of the scene",
          "importance": 0.6,
          "emotion": "Amused and curious",
          "sentiment": 0.5,
          "quote": "Alice laughed so much at this, that she had to run back into the wood for fear of their hearing her.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Fish-footman",
          "role": "Deliverer of the invitation",
          "importance": 0.5,
          "emotion": "Solemn and serious",
          "sentiment": 0.2,
          "quote": "For the Duchess. An invitation from the Queen to play croquet.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Frog-footman",
          "role": "Receiver of the invitation",
          "importance": 0.5,
          "emotion": "Solemn and repetitive",
          "sentiment": 0.2,
          "quote": "From the Queen. An invitation for the Duchess to play croquet.",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 1,
      "importance_rank": 6,
      "conflict_rank": 7
    },
    {
      "title": "Knocking at the Door",
      "summary": "Alice tries to enter the house but is met with absurdity.",
      "chapter": "CHAPTER VI.",
      "first_line": 22,
      "last_line": 57,
      "text": "Alice went timidly up to the door, and knocked.\n\"There's no sort of use in knocking,\" said the Footman, \"and that for\ntwo reasons. First, because I'm on the same side of the door as you\nare; secondly, because they're making such a noise inside, no one could\npossibly hear you.\" And certainly there _was_ a most extraordinary\nnoise going on within—a constant howling and sneezing, and every now\nand then a great crash, as if a dish or kettle had been broken to\npieces.\n\"Please, then,\" said Alice, \"how am I to get in?\"\n\"There might be some sense in your knocking,\" the Footman went on\nwithout attending to her, \"if we had the door between us. For instance,\nif you were _inside_, you might knock, and I could let you out, you\nknow.\" He was looking up into the sky all the time he was speaking, and\nthis Alice thought decidedly uncivil. \"But perhaps he can't help it,\"\nshe said to herself; \"his eyes are so _very_ nearly at the top of his\nhead. But at any rate he might answer questions.—How am I to get in?\"\nshe repeated, aloud.\n\"I shall sit here,\" the Footman remarked, \"till tomorrow—\"\nAt this moment the door of the house opened, and a large plate came\nskimming out, straight at the Footman's head: it just grazed his nose,\nand broke to pieces against one of the trees behind him.\n\"—or next day, maybe,\" the Footman continued in the same tone, exactly\nas if nothing had happened.\n\"How am I to get in?\" asked Alice again, in a louder tone.\n\"_Are_ you to get in at all?\" said the Footman. \"That's the first\nquestion, you know.\"\nIt was, no doubt: only Alice did not like to be told so. \"It's really\ndreadful,\" she muttered to herself, \"the way all the creatures argue.\nIt's enough to drive one crazy!\"\nThe Footman seemed to think this a good opportunity for repeating his\nremark, with variations. \"I shall sit here,\" he said, \"on and off, for\ndays and days.\"\n\"But what am _I_ to do?\" said Alice.\n\"Anything you like,\" said the Footman, and began whistling.\n\"Oh, there's no use in talking to him,\" said Alice desperately: \"he's\nperfectly idiotic!\" And she opened the door and went in.",
      "length": 2080,
      "num_lines": 36,
      "location": "Duchess's House",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "Seeking entry and answers",
          "importance": 1.0,
          "emotion": "Frustrated and desperate",
          "sentiment": -0.5,
          "quote": "It's really dreadful, the way all the creatures argue. It's enough to drive one crazy!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Frog-footman",
          "role": "Dismissive and unhelpful",
          "importance": 0.8,
          "emotion": "Indifferent and sarcastic",
          "sentiment": -0.3,
          "quote": "I shall sit here, till tomorrow—",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 2,
      "importance_rank": 1,
      "conflict_rank": 1
    },
    {
      "title": "Inside the Kitchen",
      "summary": "Alice enters a chaotic kitchen with the Duchess and a cook.",
      "chapter": "CHAPTER VI.",
      "first_line": 58,
      "last_line": 68,
      "text": "The door led right into a large kitchen, which was full of smoke from\none end to the other: the Duchess was sitting on a three-legged stool\nin the middle, nursing a baby; the cook was leaning over the fire,\nstirring a large cauldron which seemed to be full of soup.\n\"There's certainly too much pepper in that soup!\" Alice said to\nherself, as well as she could for sneezing.\nThere was certainly too much of it in the air. Even the Duchess sneezed\noccasionally; and as for the baby, it was sneezing and howling\nalternately without a moment's pause. The only things in the kitchen\nthat did not sneeze, were the cook, and a large cat which was sitting\non the hearth and grinning from ear to ear.",
      "length": 691,
      "num_lines": 11,
      "location": "Duchess's House",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Duchess",
          "role": "Nursing a baby and sneezing",
          "importance": 0.6,
          "emotion": "Frustrated and distracted",
          "sentiment": -0.2,
          "quote": "The Duchess was sitting on a three-legged stool in the middle, nursing a baby;",
          "fake_quote": "I can't believe how much noise this baby makes!",
          "importance_rank": 1
        },
        {
          "name": "Cook",
          "role": "Stirring the soup and ignoring the chaos",
          "importance": 0.5,
          "emotion": "Indifferent and focused",
          "sentiment": 0.1,
          "quote": "No quote available",
          "fake_quote": "Just another day in the kitchen, nothing to worry about.",
          "importance_rank": 2
        },
        {
          "name": "Alice",
          "role": "Observing and commenting on the soup",
          "importance": 0.4,
          "emotion": "Annoyed and curious",
          "sentiment": -0.3,
          "quote": "There's certainly too much pepper in that soup!",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Baby",
          "role": "Crying and sneezing",
          "importance": 0.3,
          "emotion": "Distressed",
          "sentiment": -0.5,
          "quote": "the baby, it was sneezing and howling alternately without a moment's pause.",
          "fake_quote": "",
          "importance_rank": 4
        },
        {
          "name": "Cheshire Cat",
          "role": "Sitting and grinning, observing the chaos",
          "importance": 0.2,
          "emotion": "Amused",
          "sentiment": 0.3,
          "quote": "a large cat which was sitting on the hearth and grinning from ear to ear.",
          "fake_quote": "",
          "importance_rank": 5
        }
      ],
      "number": 3,
      "importance_rank": 7,
      "conflict_rank": 4
    },
    {
      "title": "Duchess and Baby",
      "summary": "Alice converses with the Duchess while chaos ensues.",
      "chapter": "CHAPTER VI.",
      "first_line": 69,
      "last_line": 100,
      "text": "\"Please would you tell me,\" said Alice, a little timidly, for she was\nnot quite sure whether it was good manners for her to speak first, \"why\nyour cat grins like that?\"\n\"It's a Cheshire cat,\" said the Duchess, \"and that's why. Pig!\"\nShe said the last word with such sudden violence that Alice quite\njumped; but she saw in another moment that it was addressed to the\nbaby, and not to her, so she took courage, and went on again:—\n\"I didn't know that Cheshire cats always grinned; in fact, I didn't\nknow that cats _could_ grin.\"\n\"They all can,\" said the Duchess; \"and most of 'em do.\"\n\"I don't know of any that do,\" Alice said very politely, feeling quite\npleased to have got into a conversation.\n\"You don't know much,\" said the Duchess; \"and that's a fact.\"\nAlice did not at all like the tone of this remark, and thought it would\nbe as well to introduce some other subject of conversation. While she\nwas trying to fix on one, the cook took the cauldron of soup off the\nfire, and at once set to work throwing everything within her reach at\nthe Duchess and the baby—the fire-irons came first; then followed a\nshower of saucepans, plates, and dishes. The Duchess took no notice of\nthem even when they hit her; and the baby was howling so much already,\nthat it was quite impossible to say whether the blows hurt it or not.\n\"Oh, _please_ mind what you're doing!\" cried Alice, jumping up and down\nin an agony of terror. \"Oh, there goes his _precious_ nose!\" as an\nunusually large saucepan flew close by it, and very nearly carried it\noff.\n\"If everybody minded their own business,\" the Duchess said in a hoarse\ngrowl, \"the world would go round a deal faster than it does.\"\n\"Which would _not_ be an advantage,\" said Alice, who felt very glad to\nget an opportunity of showing off a little of her knowledge. \"Just\nthink of what work it would make with the day and night! You see the\nearth takes twenty-four hours to turn round on its axis—\"\n\"Talking of axes,\" said the Duchess, \"chop off her head!\"",
      "length": 1987,
      "num_lines": 32,
      "location": "Duchess's House",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "Inquisitive and polite participant",
          "importance": 0.9,
          "emotion": "Timid and anxious",
          "sentiment": 0.2,
          "quote": "\"Please would you tell me, why your cat grins like that?\"",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Duchess",
          "role": "Dismissive and aggressive figure",
          "importance": 0.8,
          "emotion": "Indifferent and hostile",
          "sentiment": -0.5,
          "quote": "\"If everybody minded their own business, the world would go round a deal faster than it does.\"",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Cook",
          "role": "Aggressive and chaotic disruptor",
          "importance": 0.6,
          "emotion": "Frenzied and violent",
          "sentiment": -0.8,
          "quote": "No quote available",
          "fake_quote": "\"Take that, Duchess!\"",
          "importance_rank": 3
        }
      ],
      "number": 4,
      "importance_rank": 2,
      "conflict_rank": 2
    },
    {
      "title": "Duchess's Lullaby",
      "summary": "The Duchess sings a violent lullaby to the baby.",
      "chapter": "CHAPTER VI.",
      "first_line": 106,
      "last_line": 125,
      "text": "figures!\" And with that she began nursing her child again, singing a\nsort of lullaby to it as she did so, and giving it a violent shake at\nthe end of every line:\n\"Speak roughly to your little boy,\nAnd beat him when he sneezes:\nHe only does it to annoy,\nBecause he knows it teases.\"\nCHORUS.\n(In which the cook and the baby joined):\n\"Wow! wow! wow!\"\nWhile the Duchess sang the second verse of the song, she kept tossing\nthe baby violently up and down, and the poor little thing howled so,\nthat Alice could hardly hear the words:—\n\"I speak severely to my boy,\nI beat him when he sneezes;\nFor he can thoroughly enjoy\nThe pepper when he pleases!\"\nCHORUS.\n\"Wow! wow! wow!\"\n\"Here! you may nurse it a bit, if you like!\" the Duchess said to Alice,",
      "length": 738,
      "num_lines": 20,
      "location": "Duchess's House",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Duchess",
          "role": "Sings a lullaby while nursing her child",
          "importance": 0.9,
          "emotion": "Carefree yet violent",
          "sentiment": 0.2,
          "quote": "I speak severely to my boy, I beat him when he sneezes;",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Observes the Duchess and her child",
          "importance": 0.5,
          "emotion": "Concerned and confused",
          "sentiment": -0.2,
          "quote": "No quote available",
          "fake_quote": "What kind of mother treats her child this way?",
          "importance_rank": 3
        },
        {
          "name": "Baby",
          "role": "Cries in response to the Duchess's actions",
          "importance": 0.6,
          "emotion": "Distressed",
          "sentiment": -0.5,
          "quote": "Wow! wow! wow!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 5,
      "importance_rank": 8,
      "conflict_rank": 5
    },
    {
      "title": "Baby Turns to Pig",
      "summary": "Alice realizes the baby has transformed into a pig.",
      "chapter": "CHAPTER VI.",
      "first_line": 126,
      "last_line": 160,
      "text": "flinging the baby at her as she spoke. \"I must go and get ready to play\ncroquet with the Queen,\" and she hurried out of the room. The cook\nthrew a frying-pan after her as she went out, but it just missed her.\nAlice caught the baby with some difficulty, as it was a queer-shaped\nlittle creature, and held out its arms and legs in all directions,\n\"just like a star-fish,\" thought Alice. The poor little thing was\nsnorting like a steam-engine when she caught it, and kept doubling\nitself up and straightening itself out again, so that altogether, for\nthe first minute or two, it was as much as she could do to hold it.\nAs soon as she had made out the proper way of nursing it, (which was to\ntwist it up into a sort of knot, and then keep tight hold of its right\near and left foot, so as to prevent its undoing itself,) she carried it\nout into the open air. \"If I don't take this child away with me,\"\nthought Alice, \"they're sure to kill it in a day or two: wouldn't it be\nmurder to leave it behind?\" She said the last words out loud, and the\nlittle thing grunted in reply (it had left off sneezing by this time).\n\"Don't grunt,\" said Alice; \"that's not at all a proper way of\nexpressing yourself.\"\nThe baby grunted again, and Alice looked very anxiously into its face\nto see what was the matter with it. There could be no doubt that it had\na _very_ turn-up nose, much more like a snout than a real nose; also\nits eyes were getting extremely small for a baby: altogether Alice did\nnot like the look of the thing at all. \"But perhaps it was only\nsobbing,\" she thought, and looked into its eyes again, to see if there\nwere any tears.\nNo, there were no tears. \"If you're going to turn into a pig, my dear,\"\nsaid Alice, seriously, \"I'll have nothing more to do with you. Mind\nnow!\" The poor little thing sobbed again (or grunted, it was impossible\nto say which), and they went on for some while in silence.\nAlice was just beginning to think to herself, \"Now, what am I to do\nwith this creature when I get it home?\" when it grunted again, so\nviolently, that she looked down into its face in some alarm. This time\nthere could be _no_ mistake about it: it was neither more nor less than\na pig, and she felt that it would be quite absurd for her to carry it\nfurther.",
      "length": 2253,
      "num_lines": 35,
      "location": "Alice's Room",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to care for the baby",
          "importance": 1.0,
          "emotion": "Concerned and perplexed",
          "sentiment": 0.2,
          "quote": "If I don't take this child away with me, they're sure to kill it in a day or two: wouldn't it be murder to leave it behind?",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Baby",
          "role": "Unruly and confusing to Alice",
          "importance": 0.7,
          "emotion": "Distressed and odd",
          "sentiment": -0.3,
          "quote": "Don't grunt; that's not at all a proper way of expressing yourself.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 6,
      "importance_rank": 3,
      "conflict_rank": 3
    },
    {
      "title": "Cheshire Cat Encounter",
      "summary": "Alice meets the Cheshire Cat and discusses madness.",
      "chapter": "CHAPTER VI.",
      "first_line": 167,
      "last_line": 199,
      "text": "was a little startled by seeing the Cheshire Cat sitting on a bough of\na tree a few yards off.\nThe Cat only grinned when it saw Alice. It looked good-natured, she\nthought: still it had _very_ long claws and a great many teeth, so she\nfelt that it ought to be treated with respect.\n\"Cheshire Puss,\" she began, rather timidly, as she did not at all know\nwhether it would like the name: however, it only grinned a little\nwider. \"Come, it's pleased so far,\" thought Alice, and she went on.\n\"Would you tell me, please, which way I ought to go from here?\"\n\"That depends a good deal on where you want to get to,\" said the Cat.\n\"I don't much care where—\" said Alice.\n\"Then it doesn't matter which way you go,\" said the Cat.\n\"—so long as I get _somewhere_,\" Alice added as an explanation.\n\"Oh, you're sure to do that,\" said the Cat, \"if you only walk long\nenough.\"\nAlice felt that this could not be denied, so she tried another\nquestion. \"What sort of people live about here?\"\n\"In _that_ direction,\" the Cat said, waving its right paw round, \"lives\na Hatter: and in _that_ direction,\" waving the other paw, \"lives a\nMarch Hare. Visit either you like: they're both mad.\"\n\"But I don't want to go among mad people,\" Alice remarked.\n\"Oh, you can't help that,\" said the Cat: \"we're all mad here. I'm mad.\nYou're mad.\"\n\"How do you know I'm mad?\" said Alice.\n\"You must be,\" said the Cat, \"or you wouldn't have come here.\"\nAlice didn't think that proved it at all; however, she went on \"And how\ndo you know that you're mad?\"\n\"To begin with,\" said the Cat, \"a dog's not mad. You grant that?\"\n\"I suppose so,\" said Alice.\n\"Well, then,\" the Cat went on, \"you see, a dog growls when it's angry,\nand wags its tail when it's pleased. Now _I_ growl when I'm pleased,\nand wag my tail when I'm angry. Therefore I'm mad.\"\n\"_I_ call it purring, not growling,\" said Alice.",
      "length": 1842,
      "num_lines": 33,
      "location": "Meadow",
      "importance": 0.8,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Cheshire Cat",
          "role": "Provides guidance and insight",
          "importance": 1.0,
          "emotion": "Mischievous and playful",
          "sentiment": 0.5,
          "quote": "Oh, you're sure to do that, if you only walk long enough.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Seeks direction and understanding",
          "importance": 1.0,
          "emotion": "Curious and slightly confused",
          "sentiment": 0.2,
          "quote": "But I don't want to go among mad people.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 7,
      "importance_rank": 4,
      "conflict_rank": 6
    },
    {
      "title": "Cat's Vanishing Act",
      "summary": "The Cheshire Cat vanishes and reappears, discussing the baby.",
      "chapter": "CHAPTER VI.",
      "first_line": 204,
      "last_line": 212,
      "text": "\"You'll see me there,\" said the Cat, and vanished.\nAlice was not much surprised at this, she was getting so used to queer\nthings happening. While she was looking at the place where it had been,\nit suddenly appeared again.\n\"By-the-bye, what became of the baby?\" said the Cat. \"I'd nearly\nforgotten to ask.\"\n\"It turned into a pig,\" Alice quietly said, just as if it had come back\nin a natural way.\n\"I thought it would,\" said the Cat, and vanished again.",
      "length": 451,
      "num_lines": 9,
      "location": "Wonderland",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Cheshire Cat",
          "role": "Mysterious guide and questioner",
          "importance": 1.0,
          "emotion": "Playful and enigmatic",
          "sentiment": 0.5,
          "quote": "You'll see me there.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Curious and accepting of oddities",
          "importance": 1.0,
          "emotion": "Calm and matter-of-fact",
          "sentiment": 0.7,
          "quote": "It turned into a pig.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 8,
      "importance_rank": 5,
      "conflict_rank": 8
    },
    {
      "title": "March Hare's House",
      "summary": "Alice approaches the March Hare's house, feeling apprehensive.",
      "chapter": "CHAPTER VI.",
      "first_line": 228,
      "last_line": 234,
      "text": "She had not gone much farther before she came in sight of the house of\nthe March Hare: she thought it must be the right house, because the\nchimneys were shaped like ears and the roof was thatched with fur. It\nwas so large a house, that she did not like to go nearer till she had\nnibbled some more of the lefthand bit of mushroom, and raised herself\nto about two feet high: even then she walked up towards it rather\ntimidly, saying to herself \"Suppose it should be raving mad after all!",
      "length": 485,
      "num_lines": 7,
      "location": "House Of The March Hare",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and cautious visitor",
          "importance": 0.9,
          "emotion": "Timid and apprehensive",
          "sentiment": -0.2,
          "quote": "Suppose it should be raving mad after all!",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 9,
      "importance_rank": 9,
      "conflict_rank": 9
    },
    {
      "title": "Mad Tea-Party Begins",
      "summary": "Alice encounters the March Hare, Hatter, and Dormouse at a chaotic tea party.",
      "chapter": "CHAPTER VII.",
      "first_line": 1,
      "last_line": 217,
      "text": "A Mad Tea-Party\nThere was a table set out under a tree in front of the house, and the\nMarch Hare and the Hatter were having tea at it: a Dormouse was sitting\nbetween them, fast asleep, and the other two were using it as a\ncushion, resting their elbows on it, and talking over its head. \"Very\nuncomfortable for the Dormouse,\" thought Alice; \"only, as it's asleep,\nI suppose it doesn't mind.\"\nThe table was a large one, but the three were all crowded together at\none corner of it: \"No room! No room!\" they cried out when they saw\nAlice coming. \"There's _plenty_ of room!\" said Alice indignantly, and\nshe sat down in a large arm-chair at one end of the table.\n\"Have some wine,\" the March Hare said in an encouraging tone.\nAlice looked all round the table, but there was nothing on it but tea.\n\"I don't see any wine,\" she remarked.\n\"There isn't any,\" said the March Hare.\n\"Then it wasn't very civil of you to offer it,\" said Alice angrily.\n\"It wasn't very civil of you to sit down without being invited,\" said\nthe March Hare.\n\"I didn't know it was _your_ table,\" said Alice; \"it's laid for a great\nmany more than three.\"\n\"Your hair wants cutting,\" said the Hatter. He had been looking at\nAlice for some time with great curiosity, and this was his first\nspeech.\n\"You should learn not to make personal remarks,\" Alice said with some\nseverity; \"it's very rude.\"\nThe Hatter opened his eyes very wide on hearing this; but all he _said_\nwas, \"Why is a raven like a writing-desk?\"\n\"Come, we shall have some fun now!\" thought Alice. \"I'm glad they've\nbegun asking riddles.—I believe I can guess that,\" she added aloud.\n\"Do you mean that you think you can find out the answer to it?\" said\nthe March Hare.\n\"Exactly so,\" said Alice.\n\"Then you should say what you mean,\" the March Hare went on.\n\"I do,\" Alice hastily replied; \"at least—at least I mean what I\nsay—that's the same thing, you know.\"\n\"Not the same thing a bit!\" said the Hatter. \"You might just as well\nsay that 'I see what I eat' is the same thing as 'I eat what I see'!\"\n\"You might just as well say,\" added the March Hare, \"that 'I like what\nI get' is the same thing as 'I get what I like'!\"\n\"You might just as well say,\" added the Dormouse, who seemed to be\ntalking in his sleep, \"that 'I breathe when I sleep' is the same thing\nas 'I sleep when I breathe'!\"\n\"It _is_ the same thing with you,\" said the Hatter, and here the\nconversation dropped, and the party sat silent for a minute, while\nAlice thought over all she could remember about ravens and\nwriting-desks, which wasn't much.\nThe Hatter was the first to break the silence. \"What day of the month\nis it?\" he said, turning to Alice: he had taken his watch out of his\npocket, and was looking at it uneasily, shaking it every now and then,\nand holding it to his ear.\nAlice considered a little, and then said \"The fourth.\"\n\"Two days wrong!\" sighed the Hatter. \"I told you butter wouldn't suit\nthe works!\" he added looking angrily at the March Hare.\n\"It was the _best_ butter,\" the March Hare meekly replied.\n\"Yes, but some crumbs must have got in as well,\" the Hatter grumbled:\n\"you shouldn't have put it in with the bread-knife.\"\nThe March Hare took the watch and looked at it gloomily: then he dipped\nit into his cup of tea, and looked at it again: but he could think of\nnothing better to say than his first remark, \"It was the _best_ butter,\nyou know.\"\nAlice had been looking over his shoulder with some curiosity. \"What a\nfunny watch!\" she remarked. \"It tells the day of the month, and doesn't\ntell what o'clock it is!\"\n\"Why should it?\" muttered the Hatter. \"Does _your_ watch tell you what\nyear it is?\"\n\"Of course not,\" Alice replied very readily: \"but that's because it\nstays the same year for such a long time together.\"\n\"Which is just the case with _mine_,\" said the Hatter.\nAlice felt dreadfully puzzled. The Hatter's remark seemed to have no\nsort of meaning in it, and yet it was certainly English. \"I don't quite\nunderstand you,\" she said, as politely as she could.\n\"The Dormouse is asleep again,\" said the Hatter, and he poured a little\nhot tea upon its nose.\nThe Dormouse shook its head impatiently, and said, without opening its\neyes, \"Of course, of course; just what I was going to remark myself.\"\n\"Have you guessed the riddle yet?\" the Hatter said, turning to Alice\nagain.\n\"No, I give it up,\" Alice replied: \"what's the answer?\"\n\"I haven't the slightest idea,\" said the Hatter.\n\"Nor I,\" said the March Hare.\nAlice sighed wearily. \"I think you might do something better with the\ntime,\" she said, \"than waste it in asking riddles that have no\nanswers.\"\n\"If you knew Time as well as I do,\" said the Hatter, \"you wouldn't talk\nabout wasting _it_. It's _him_.\"\n\"I don't know what you mean,\" said Alice.\n\"Of course you don't!\" the Hatter said, tossing his head\ncontemptuously. \"I dare say you never even spoke to Time!\"\n\"Perhaps not,\" Alice cautiously replied: \"but I know I have to beat\ntime when I learn music.\"\n\"Ah! that accounts for it,\" said the Hatter. \"He won't stand beating.\nNow, if you only kept on good terms with him, he'd do almost anything\nyou liked with the clock. For instance, suppose it were nine o'clock in\nthe morning, just time to begin lessons: you'd only have to whisper a\nhint to Time, and round goes the clock in a twinkling! Half-past one,\ntime for dinner!\"\n(\"I only wish it was,\" the March Hare said to itself in a whisper.)\n\"That would be grand, certainly,\" said Alice thoughtfully: \"but then—I\nshouldn't be hungry for it, you know.\"\n\"Not at first, perhaps,\" said the Hatter: \"but you could keep it to\nhalf-past one as long as you liked.\"\n\"Is that the way _you_ manage?\" Alice asked.\nThe Hatter shook his head mournfully. \"Not I!\" he replied. \"We\nquarrelled last March—just before _he_ went mad, you know—\" (pointing\nwith his tea spoon at the March Hare,) \"—it was at the great concert\ngiven by the Queen of Hearts, and I had to sing\n'Twinkle, twinkle, little bat!\nHow I wonder what you're at!'\nYou know the song, perhaps?\"\n\"I've heard something like it,\" said Alice.\n\"It goes on, you know,\" the Hatter continued, \"in this way:—\n'Up above the world you fly,\nLike a tea-tray in the sky.\nTwinkle, twinkle—'\"\nHere the Dormouse shook itself, and began singing in its sleep\n\"_Twinkle, twinkle, twinkle, twinkle_—\" and went on so long that they\nhad to pinch it to make it stop.\n\"Well, I'd hardly finished the first verse,\" said the Hatter, \"when the\nQueen jumped up and bawled out, 'He's murdering the time! Off with his\nhead!'\"\n\"How dreadfully savage!\" exclaimed Alice.\n\"And ever since that,\" the Hatter went on in a mournful tone, \"he won't\ndo a thing I ask! It's always six o'clock now.\"\nA bright idea came into Alice's head. \"Is that the reason so many\ntea-things are put out here?\" she asked.\n\"Yes, that's it,\" said the Hatter with a sigh: \"it's always tea-time,\nand we've no time to wash the things between whiles.\"\n\"Then you keep moving round, I suppose?\" said Alice.\n\"Exactly so,\" said the Hatter: \"as the things get used up.\"\n\"But what happens when you come to the beginning again?\" Alice ventured\nto ask.\n\"Suppose we change the subject,\" the March Hare interrupted, yawning.\n\"I'm getting tired of this. I vote the young lady tells us a story.\"\n\"I'm afraid I don't know one,\" said Alice, rather alarmed at the\nproposal.\n\"Then the Dormouse shall!\" they both cried. \"Wake up, Dormouse!\" And\nthey pinched it on both sides at once.\nThe Dormouse slowly opened his eyes. \"I wasn't asleep,\" he said in a\nhoarse, feeble voice: \"I heard every word you fellows were saying.\"\n\"Tell us a story!\" said the March Hare.\n\"Yes, please do!\" pleaded Alice.\n\"And be quick about it,\" added the Hatter, \"or you'll be asleep again\nbefore it's done.\"\n\"Once upon a time there were three little sisters,\" the Dormouse began\nin a great hurry; \"and their names were Elsie, Lacie, and Tillie; and\nthey lived at the bottom of a well—\"\n\"What did they live on?\" said Alice, who always took a great interest\nin questions of eating and drinking.\n\"They lived on treacle,\" said the Dormouse, after thinking a minute or\ntwo.\n\"They couldn't have done that, you know,\" Alice gently remarked;\n\"they'd have been ill.\"\n\"So they were,\" said the Dormouse; \"_very_ ill.\"\nAlice tried to fancy to herself what such an extraordinary ways of\nliving would be like, but it puzzled her too much, so she went on: \"But\nwhy did they live at the bottom of a well?\"\n\"Take some more tea,\" the March Hare said to Alice, very earnestly.\n\"I've had nothing yet,\" Alice replied in an offended tone, \"so I can't\ntake more.\"\n\"You mean you can't take _less_,\" said the Hatter: \"it's very easy to\ntake _more_ than nothing.\"\n\"Nobody asked _your_ opinion,\" said Alice.\n\"Who's making personal remarks now?\" the Hatter asked triumphantly.\nAlice did not quite know what to say to this: so she helped herself to\nsome tea and bread-and-butter, and then turned to the Dormouse, and\nrepeated her question. \"Why did they live at the bottom of a well?\"\nThe Dormouse again took a minute or two to think about it, and then\nsaid, \"It was a treacle-well.\"\n\"There's no such thing!\" Alice was beginning very angrily, but the\nHatter and the March Hare went \"Sh! sh!\" and the Dormouse sulkily\nremarked, \"If you can't be civil, you'd better finish the story for\nyourself.\"\n\"No, please go on!\" Alice said very humbly; \"I won't interrupt again. I\ndare say there may be _one_.\"\n\"One, indeed!\" said the Dormouse indignantly. However, he consented to\ngo on. \"And so these three little sisters—they were learning to draw,\nyou know—\"\n\"What did they draw?\" said Alice, quite forgetting her promise.\n\"Treacle,\" said the Dormouse, without considering at all this time.\n\"I want a clean cup,\" interrupted the Hatter: \"let's all move one place\non.\"\nHe moved on as he spoke, and the Dormouse followed him: the March Hare\nmoved into the Dormouse's place, and Alice rather unwillingly took the\nplace of the March Hare. The Hatter was the only one who got any\nadvantage from the change: and Alice was a good deal worse off than\nbefore, as the March Hare had just upset the milk-jug into his plate.\nAlice did not wish to offend the Dormouse again, so she began very\ncautiously: \"But I don't understand. Where did they draw the treacle\nfrom?\"\n\"You can draw water out of a water-well,\" said the Hatter; \"so I should\nthink you could draw treacle out of a treacle-well—eh, stupid?\"\n\"But they were _in_ the well,\" Alice said to the Dormouse, not choosing\nto notice this last remark.\n\"Of course they were,\" said the Dormouse; \"—well in.\"\nThis answer so confused poor Alice, that she let the Dormouse go on for\nsome time without interrupting it.\n\"They were learning to draw,\" the Dormouse went on, yawning and rubbing\nits eyes, for it was getting very sleepy; \"and they drew all manner of\nthings—everything that begins with an M—\"\n\"Why with an M?\" said Alice.\n\"Why not?\" said the March Hare.\nAlice was silent.\nThe Dormouse had closed its eyes by this time, and was going off into a\ndoze; but, on being pinched by the Hatter, it woke up again with a\nlittle shriek, and went on: \"—that begins with an M, such as\nmouse-traps, and the moon, and memory, and muchness—you know you say\nthings are \"much of a muchness\"—did you ever see such a thing as a\ndrawing of a muchness?\"\n\"Really, now you ask me,\" said Alice, very much confused, \"I don't\nthink—\"\n\"Then you shouldn't talk,\" said the Hatter.\nThis piece of rudeness was more than Alice could bear: she got up in\ngreat disgust, and walked off; the Dormouse fell asleep instantly, and\nneither of the others took the least notice of her going, though she\nlooked back once or twice, half hoping that they would call after her:\nthe last time she saw them, they were trying to put the Dormouse into\nthe teapot.",
      "length": 11682,
      "num_lines": 217,
      "location": "Meadow",
      "importance": 0.9,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "A curious guest at the tea party, trying to engage with the others.",
          "importance": 1.0,
          "emotion": "Frustrated and confused",
          "sentiment": -0.5,
          "quote": "I didn't know it was _your_ table.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Hatter",
          "role": "A whimsical host who poses riddles and engages in nonsensical conversation.",
          "importance": 1.0,
          "emotion": "Mournful and whimsical",
          "sentiment": 0.2,
          "quote": "Not I! We quarrelled last March—just before _he_ went mad, you know—",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "March Hare",
          "role": "A lively participant in the tea party, often contradicting Alice and the Hatter.",
          "importance": 1.0,
          "emotion": "Playful and dismissive",
          "sentiment": 0.1,
          "quote": "It was the _best_ butter, you know.",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Dormouse",
          "role": "A sleepy character who adds to the absurdity of the conversation.",
          "importance": 0.8,
          "emotion": "Sleepy and indifferent",
          "sentiment": -0.1,
          "quote": "Of course, of course; just what I was going to remark myself.",
          "fake_quote": "",
          "importance_rank": 4
        }
      ],
      "number": 1,
      "importance_rank": 1,
      "conflict_rank": 1
    },
    {
      "title": "Alice Leaves the Tea Party",
      "summary": "Frustrated by the absurdity, Alice decides to leave the tea party.",
      "chapter": "CHAPTER VII.",
      "first_line": 218,
      "last_line": 224,
      "text": "\"At any rate I'll never go _there_ again!\" said Alice as she picked her\nway through the wood. \"It's the stupidest tea-party I ever was at in\nall my life!\"\nJust as she said this, she noticed that one of the trees had a door\nleading right into it. \"That's very curious!\" she thought. \"But\neverything's curious today. I think I may as well go in at once.\" And\nin she went.",
      "length": 369,
      "num_lines": 7,
      "location": "House Of The March Hare",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Expresses frustration and curiosity",
          "importance": 1.0,
          "emotion": "Frustrated and curious",
          "sentiment": -0.5,
          "quote": "At any rate I'll never go _there_ again!",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 2,
      "importance_rank": 3,
      "conflict_rank": 2
    },
    {
      "title": "Alice Enters the Garden",
      "summary": "Alice finds a door leading to a beautiful garden after leaving the tea party.",
      "chapter": "CHAPTER VII.",
      "first_line": 225,
      "last_line": 232,
      "text": "Once more she found herself in the long hall, and close to the little\nglass table. \"Now, I'll manage better this time,\" she said to herself,\nand began by taking the little golden key, and unlocking the door that\nled into the garden. Then she went to work nibbling at the mushroom\n(she had kept a piece of it in her pocket) till she was about a foot\nhigh: then she walked down the little passage: and _then_—she found\nherself at last in the beautiful garden, among the bright flower-beds\nand the cool fountains.",
      "length": 510,
      "num_lines": 8,
      "location": "Queen's Garden",
      "importance": 0.8,
      "conflict": 0.1,
      "characters": [
        {
          "name": "Alice",
          "role": "Determined to enter the garden",
          "importance": 1.0,
          "emotion": "Hopeful and determined",
          "sentiment": 0.8,
          "quote": "Now, I'll manage better this time.",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 3,
      "importance_rank": 2,
      "conflict_rank": 3
    },
    {
      "title": "Painting the Roses Red",
      "summary": "Alice observes gardeners painting roses red to avoid punishment.",
      "chapter": "CHAPTER VIII.",
      "first_line": 1,
      "last_line": 30,
      "text": "The Queen's Croquet-Ground\nA large rose-tree stood near the entrance of the garden: the roses\ngrowing on it were white, but there were three gardeners at it, busily\npainting them red. Alice thought this a very curious thing, and she\nwent nearer to watch them, and just as she came up to them she heard\none of them say, \"Look out now, Five! Don't go splashing paint over me\nlike that!\"\n\"I couldn't help it,\" said Five, in a sulky tone; \"Seven jogged my\nelbow.\"\nOn which Seven looked up and said, \"That's right, Five! Always lay the\nblame on others!\"\n\"_You'd_ better not talk!\" said Five. \"I heard the Queen say only\nyesterday you deserved to be beheaded!\"\n\"What for?\" said the one who had spoken first.\n\"That's none of _your_ business, Two!\" said Seven.\n\"Yes, it _is_ his business!\" said Five, \"and I'll tell him—it was for\nbringing the cook tulip-roots instead of onions.\"\nSeven flung down his brush, and had just begun \"Well, of all the unjust\nthings—\" when his eye chanced to fall upon Alice, as she stood watching\nthem, and he checked himself suddenly: the others looked round also,\nand all of them bowed low.\n\"Would you tell me,\" said Alice, a little timidly, \"why you are\npainting those roses?\"\nFive and Seven said nothing, but looked at Two. Two began in a low\nvoice, \"Why the fact is, you see, Miss, this here ought to have been a\n_red_ rose-tree, and we put a white one in by mistake; and if the Queen\nwas to find it out, we should all have our heads cut off, you know. So\nyou see, Miss, we're doing our best, afore she comes, to—\" At this\nmoment Five, who had been anxiously looking across the garden, called\nout \"The Queen! The Queen!\" and the three gardeners instantly threw",
      "length": 1685,
      "num_lines": 30,
      "location": "Queen's Garden",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious observer of the gardeners",
          "importance": 0.7,
          "emotion": "Timid curiosity",
          "sentiment": 0.5,
          "quote": "Would you tell me, said Alice, a little timidly, why you are painting those roses?",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Five",
          "role": "Gardener blaming others",
          "importance": 0.6,
          "emotion": "Sulky defensiveness",
          "sentiment": -0.5,
          "quote": "I couldn't help it, said Five, in a sulky tone; Seven jogged my elbow.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Seven",
          "role": "Gardener defending himself",
          "importance": 0.6,
          "emotion": "Defensive annoyance",
          "sentiment": -0.3,
          "quote": "That's right, Five! Always lay the blame on others!",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Two",
          "role": "Gardener explaining the situation",
          "importance": 0.5,
          "emotion": "Nervous explanation",
          "sentiment": 0.2,
          "quote": "Why the fact is, you see, Miss, this here ought to have been a red rose-tree, and we put a white one in by mistake; and if the Queen was to find it out, we should all have our heads cut off, you know.",
          "fake_quote": "",
          "importance_rank": 4
        }
      ],
      "number": 1,
      "importance_rank": 3,
      "conflict_rank": 6
    },
    {
      "title": "The Queen's Arrival",
      "summary": "The Queen arrives with a grand procession, causing chaos.",
      "chapter": "CHAPTER VIII.",
      "first_line": 31,
      "last_line": 50,
      "text": "themselves flat upon their faces. There was a sound of many footsteps,\nand Alice looked round, eager to see the Queen.\nFirst came ten soldiers carrying clubs; these were all shaped like the\nthree gardeners, oblong and flat, with their hands and feet at the\ncorners: next the ten courtiers; these were ornamented all over with\ndiamonds, and walked two and two, as the soldiers did. After these came\nthe royal children; there were ten of them, and the little dears came\njumping merrily along hand in hand, in couples: they were all\nornamented with hearts. Next came the guests, mostly Kings and Queens,\nand among them Alice recognised the White Rabbit: it was talking in a\nhurried nervous manner, smiling at everything that was said, and went\nby without noticing her. Then followed the Knave of Hearts, carrying\nthe King's crown on a crimson velvet cushion; and, last of all this\ngrand procession, came THE KING AND QUEEN OF HEARTS.\nAlice was rather doubtful whether she ought not to lie down on her face\nlike the three gardeners, but she could not remember ever having heard\nof such a rule at processions; \"and besides, what would be the use of a\nprocession,\" thought she, \"if people had all to lie down upon their\nfaces, so that they couldn't see it?\" So she stood still where she was,\nand waited.",
      "length": 1297,
      "num_lines": 20,
      "location": "Queen's Garden",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Observing the procession",
          "importance": 0.7,
          "emotion": "Curious and doubtful",
          "sentiment": 0.5,
          "quote": "what would be the use of a procession if people had all to lie down upon their faces, so that they couldn't see it?",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "White Rabbit",
          "role": "Hurrying past without noticing Alice",
          "importance": 0.5,
          "emotion": "Nervous and hurried",
          "sentiment": 0.2,
          "quote": "No quote available",
          "fake_quote": "I must hurry, I must hurry, or I'll be late!",
          "importance_rank": 3
        },
        {
          "name": "Knave Of Hearts",
          "role": "Carrying the King's crown",
          "importance": 0.4,
          "emotion": "Subservient and focused",
          "sentiment": 0.3,
          "quote": "No quote available",
          "fake_quote": "I hope I don't drop it this time!",
          "importance_rank": 4
        },
        {
          "name": "King Of Hearts",
          "role": "Leading the procession",
          "importance": 0.9,
          "emotion": "Regal and commanding",
          "sentiment": 0.6,
          "quote": "No quote available",
          "fake_quote": "Make way for the royal couple!",
          "importance_rank": 1
        }
      ],
      "number": 2,
      "importance_rank": 4,
      "conflict_rank": 8
    },
    {
      "title": "Confrontation with the Queen",
      "summary": "Alice meets the Queen and stands up to her demands.",
      "chapter": "CHAPTER VIII.",
      "first_line": 51,
      "last_line": 70,
      "text": "When the procession came opposite to Alice, they all stopped and looked\nat her, and the Queen said severely \"Who is this?\" She said it to the\nKnave of Hearts, who only bowed and smiled in reply.\n\"Idiot!\" said the Queen, tossing her head impatiently; and, turning to\nAlice, she went on, \"What's your name, child?\"\n\"My name is Alice, so please your Majesty,\" said Alice very politely;\nbut she added, to herself, \"Why, they're only a pack of cards, after\nall. I needn't be afraid of them!\"\n\"And who are _these?_\" said the Queen, pointing to the three gardeners\nwho were lying round the rose-tree; for, you see, as they were lying on\ntheir faces, and the pattern on their backs was the same as the rest of\nthe pack, she could not tell whether they were gardeners, or soldiers,\nor courtiers, or three of her own children.\n\"How should _I_ know?\" said Alice, surprised at her own courage. \"It's\nno business of _mine_.\"\nThe Queen turned crimson with fury, and, after glaring at her for a\nmoment like a wild beast, screamed \"Off with her head! Off—\"\n\"Nonsense!\" said Alice, very loudly and decidedly, and the Queen was\nsilent.\nThe King laid his hand upon her arm, and timidly said \"Consider, my",
      "length": 1185,
      "num_lines": 20,
      "location": "Queen's Garden",
      "importance": 0.9,
      "conflict": 0.8,
      "characters": [
        {
          "name": "Alice",
          "role": "Defiant and brave in the face of authority",
          "importance": 1.0,
          "emotion": "Courageous and slightly amused",
          "sentiment": 0.5,
          "quote": "My name is Alice, so please your Majesty.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Queen Of Hearts",
          "role": "Authoritative and furious",
          "importance": 1.0,
          "emotion": "Angry and commanding",
          "sentiment": -0.8,
          "quote": "Who is this?",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "King Of Hearts",
          "role": "Timid and conciliatory",
          "importance": 0.5,
          "emotion": "Nervous and hesitant",
          "sentiment": 0.2,
          "quote": "Consider, my dear.",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Knave Of Hearts",
          "role": "Submissive and passive",
          "importance": 0.3,
          "emotion": "Indifferent and compliant",
          "sentiment": 0.1,
          "quote": "No quote available",
          "fake_quote": "I am just here to serve.",
          "importance_rank": 4
        }
      ],
      "number": 3,
      "importance_rank": 1,
      "conflict_rank": 1
    },
    {
      "title": "Execution of Gardeners",
      "summary": "The Queen orders the beheading of the gardeners for their mistake.",
      "chapter": "CHAPTER VIII.",
      "first_line": 71,
      "last_line": 90,
      "text": "dear: she is only a child!\"\nThe Queen turned angrily away from him, and said to the Knave \"Turn\nthem over!\"\nThe Knave did so, very carefully, with one foot.\n\"Get up!\" said the Queen, in a shrill, loud voice, and the three\ngardeners instantly jumped up, and began bowing to the King, the Queen,\nthe royal children, and everybody else.\n\"Leave off that!\" screamed the Queen. \"You make me giddy.\" And then,\nturning to the rose-tree, she went on, \"What _have_ you been doing\nhere?\"\n\"May it please your Majesty,\" said Two, in a very humble tone, going\ndown on one knee as he spoke, \"we were trying—\"\n\"_I_ see!\" said the Queen, who had meanwhile been examining the roses.\n\"Off with their heads!\" and the procession moved on, three of the\nsoldiers remaining behind to execute the unfortunate gardeners, who ran\nto Alice for protection.\n\"You shan't be beheaded!\" said Alice, and she put them into a large\nflower-pot that stood near. The three soldiers wandered about for a\nminute or two, looking for them, and then quietly marched off after the\nothers.",
      "length": 1043,
      "num_lines": 20,
      "location": "Queen's Garden",
      "importance": 0.9,
      "conflict": 0.8,
      "characters": [
        {
          "name": "Queen Of Hearts",
          "role": "Commands execution of gardeners",
          "importance": 1.0,
          "emotion": "Angry and authoritative",
          "sentiment": -1.0,
          "quote": "Off with their heads!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Protects the gardeners from execution",
          "importance": 1.0,
          "emotion": "Defiant and protective",
          "sentiment": 1.0,
          "quote": "You shan't be beheaded!",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Knave Of Hearts",
          "role": "Obeys the Queen's orders",
          "importance": 0.5,
          "emotion": "Submissive",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "I will do as you command, Your Majesty.",
          "importance_rank": 3
        },
        {
          "name": "Two",
          "role": "Humbly explains their actions to the Queen",
          "importance": 0.5,
          "emotion": "Humble and fearful",
          "sentiment": -1.0,
          "quote": "May it please your Majesty, we were trying—",
          "fake_quote": "",
          "importance_rank": 4
        }
      ],
      "number": 4,
      "importance_rank": 2,
      "conflict_rank": 2
    },
    {
      "title": "Croquet Game Begins",
      "summary": "Alice joins the chaotic croquet game with unusual equipment.",
      "chapter": "CHAPTER VIII.",
      "first_line": 91,
      "last_line": 134,
      "text": "\"Are their heads off?\" shouted the Queen.\n\"Their heads are gone, if it please your Majesty!\" the soldiers shouted\nin reply.\n\"That's right!\" shouted the Queen. \"Can you play croquet?\"\nThe soldiers were silent, and looked at Alice, as the question was\nevidently meant for her.\n\"Yes!\" shouted Alice.\n\"Come on, then!\" roared the Queen, and Alice joined the procession,\nwondering very much what would happen next.\n\"It's—it's a very fine day!\" said a timid voice at her side. She was\nwalking by the White Rabbit, who was peeping anxiously into her face.\n\"Very,\" said Alice: \"—where's the Duchess?\"\n\"Hush! Hush!\" said the Rabbit in a low, hurried tone. He looked\nanxiously over his shoulder as he spoke, and then raised himself upon\ntiptoe, put his mouth close to her ear, and whispered \"She's under\nsentence of execution.\"\n\"What for?\" said Alice.\n\"Did you say 'What a pity!'?\" the Rabbit asked.\n\"No, I didn't,\" said Alice: \"I don't think it's at all a pity. I said\n'What for?'\"\n\"She boxed the Queen's ears—\" the Rabbit began. Alice gave a little\nscream of laughter. \"Oh, hush!\" the Rabbit whispered in a frightened\ntone. \"The Queen will hear you! You see, she came rather late, and the\nQueen said—\"\n\"Get to your places!\" shouted the Queen in a voice of thunder, and\npeople began running about in all directions, tumbling up against each\nother; however, they got settled down in a minute or two, and the game\nbegan. Alice thought she had never seen such a curious croquet-ground\nin her life; it was all ridges and furrows; the balls were live\nhedgehogs, the mallets live flamingoes, and the soldiers had to double\nthemselves up and to stand on their hands and feet, to make the arches.\nThe chief difficulty Alice found at first was in managing her flamingo:\nshe succeeded in getting its body tucked away, comfortably enough,\nunder her arm, with its legs hanging down, but generally, just as she\nhad got its neck nicely straightened out, and was going to give the\nhedgehog a blow with its head, it _would_ twist itself round and look\nup in her face, with such a puzzled expression that she could not help\nbursting out laughing: and when she had got its head down, and was\ngoing to begin again, it was very provoking to find that the hedgehog\nhad unrolled itself, and was in the act of crawling away: besides all\nthis, there was generally a ridge or furrow in the way wherever she\nwanted to send the hedgehog to, and, as the doubled-up soldiers were\nalways getting up and walking off to other parts of the ground, Alice\nsoon came to the conclusion that it was a very difficult game indeed.",
      "length": 2580,
      "num_lines": 44,
      "location": "Queen's Garden",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Queen Of Hearts",
          "role": "Commands the soldiers and initiates the game",
          "importance": 1.0,
          "emotion": "Authoritative and demanding",
          "sentiment": 0.8,
          "quote": "Get to your places!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Participates in the croquet game and expresses confusion",
          "importance": 1.0,
          "emotion": "Curious and amused",
          "sentiment": 0.5,
          "quote": "Oh, hush!",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "White Rabbit",
          "role": "Informs Alice about the Duchess's fate and expresses anxiety",
          "importance": 0.7,
          "emotion": "Anxious and fearful",
          "sentiment": -0.5,
          "quote": "She's under sentence of execution.",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 5,
      "importance_rank": 5,
      "conflict_rank": 7
    },
    {
      "title": "Alice Meets the Cheshire Cat",
      "summary": "Alice converses with the Cheshire Cat about the game and the Queen.",
      "chapter": "CHAPTER VIII.",
      "first_line": 135,
      "last_line": 170,
      "text": "The players all played at once without waiting for turns, quarrelling\nall the while, and fighting for the hedgehogs; and in a very short time\nthe Queen was in a furious passion, and went stamping about, and\nshouting \"Off with his head!\" or \"Off with her head!\" about once in a\nminute.\nAlice began to feel very uneasy: to be sure, she had not as yet had any\ndispute with the Queen, but she knew that it might happen any minute,\n\"and then,\" thought she, \"what would become of me? They're dreadfully\nfond of beheading people here; the great wonder is, that there's any\none left alive!\"\nShe was looking about for some way of escape, and wondering whether she\ncould get away without being seen, when she noticed a curious\nappearance in the air: it puzzled her very much at first, but, after\nwatching it a minute or two, she made it out to be a grin, and she said\nto herself \"It's the Cheshire Cat: now I shall have somebody to talk\nto.\"\n\"How are you getting on?\" said the Cat, as soon as there was mouth\nenough for it to speak with.\nAlice waited till the eyes appeared, and then nodded. \"It's no use\nspeaking to it,\" she thought, \"till its ears have come, or at least one\nof them.\" In another minute the whole head appeared, and then Alice put\ndown her flamingo, and began an account of the game, feeling very glad\nshe had someone to listen to her. The Cat seemed to think that there\nwas enough of it now in sight, and no more of it appeared.\n\"I don't think they play at all fairly,\" Alice began, in rather a\ncomplaining tone, \"and they all quarrel so dreadfully one can't hear\noneself speak—and they don't seem to have any rules in particular; at\nleast, if there are, nobody attends to them—and you've no idea how\nconfusing it is all the things being alive; for instance, there's the\narch I've got to go through next walking about at the other end of the\nground—and I should have croqueted the Queen's hedgehog just now, only\nit ran away when it saw mine coming!\"\n\"How do you like the Queen?\" said the Cat in a low voice.\n\"Not at all,\" said Alice: \"she's so extremely—\" Just then she noticed\nthat the Queen was close behind her, listening: so she went on,\n\"—likely to win, that it's hardly worth while finishing the game.\"",
      "length": 2218,
      "num_lines": 36,
      "location": "Queen's Garden",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Queen Of Hearts",
          "role": "Commands beheading and creates chaos",
          "importance": 1.0,
          "emotion": "Furious and authoritative",
          "sentiment": -1.0,
          "quote": "Off with his head!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Observes and complains about the game",
          "importance": 0.8,
          "emotion": "Uneasy and frustrated",
          "sentiment": -0.5,
          "quote": "I don't think they play at all fairly.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Cheshire Cat",
          "role": "Provides conversation and insight",
          "importance": 0.6,
          "emotion": "Calm and curious",
          "sentiment": 0.5,
          "quote": "How are you getting on?",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 6,
      "importance_rank": 6,
      "conflict_rank": 3
    },
    {
      "title": "The King's Curiosity",
      "summary": "The King questions Alice about the Cheshire Cat, leading to more chaos.",
      "chapter": "CHAPTER VIII.",
      "first_line": 171,
      "last_line": 190,
      "text": "The Queen smiled and passed on.\n\"Who _are_ you talking to?\" said the King, going up to Alice, and\nlooking at the Cat's head with great curiosity.\n\"It's a friend of mine—a Cheshire Cat,\" said Alice: \"allow me to\nintroduce it.\"\n\"I don't like the look of it at all,\" said the King: \"however, it may\nkiss my hand if it likes.\"\n\"I'd rather not,\" the Cat remarked.\n\"Don't be impertinent,\" said the King, \"and don't look at me like\nthat!\" He got behind Alice as he spoke.\n\"A cat may look at a king,\" said Alice. \"I've read that in some book,\nbut I don't remember where.\"\n\"Well, it must be removed,\" said the King very decidedly, and he called\nthe Queen, who was passing at the moment, \"My dear! I wish you would\nhave this cat removed!\"\nThe Queen had only one way of settling all difficulties, great or\nsmall. \"Off with his head!\" she said, without even looking round.\n\"I'll fetch the executioner myself,\" said the King eagerly, and he\nhurried off.\nAlice thought she might as well go back, and see how the game was going",
      "length": 1012,
      "num_lines": 20,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "Mediator between the King and Cat",
          "importance": 0.9,
          "emotion": "Confident and assertive",
          "sentiment": 0.5,
          "quote": "A cat may look at a king.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "King Of Hearts",
          "role": "Authority figure trying to assert control",
          "importance": 0.8,
          "emotion": "Nervous and indecisive",
          "sentiment": -0.5,
          "quote": "I don't like the look of it at all.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Queen Of Hearts",
          "role": "Decisive and ruthless authority",
          "importance": 0.7,
          "emotion": "Unyielding and commanding",
          "sentiment": -0.8,
          "quote": "Off with his head!",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Cheshire Cat",
          "role": "Mysterious observer",
          "importance": 0.6,
          "emotion": "Playful and indifferent",
          "sentiment": 0.2,
          "quote": "I'd rather not.",
          "fake_quote": "",
          "importance_rank": 4
        }
      ],
      "number": 7,
      "importance_rank": 7,
      "conflict_rank": 4
    },
    {
      "title": "Dispute Over the Cat",
      "summary": "A dispute arises about the Cheshire Cat's fate, causing confusion.",
      "chapter": "CHAPTER VIII.",
      "first_line": 191,
      "last_line": 231,
      "text": "on, as she heard the Queen's voice in the distance, screaming with\npassion. She had already heard her sentence three of the players to be\nexecuted for having missed their turns, and she did not like the look\nof things at all, as the game was in such confusion that she never knew\nwhether it was her turn or not. So she went in search of her hedgehog.\nThe hedgehog was engaged in a fight with another hedgehog, which seemed\nto Alice an excellent opportunity for croqueting one of them with the\nother: the only difficulty was, that her flamingo was gone across to\nthe other side of the garden, where Alice could see it trying in a\nhelpless sort of way to fly up into a tree.\nBy the time she had caught the flamingo and brought it back, the fight\nwas over, and both the hedgehogs were out of sight: \"but it doesn't\nmatter much,\" thought Alice, \"as all the arches are gone from this side\nof the ground.\" So she tucked it away under her arm, that it might not\nescape again, and went back for a little more conversation with her\nfriend.\nWhen she got back to the Cheshire Cat, she was surprised to find quite\na large crowd collected round it: there was a dispute going on between\nthe executioner, the King, and the Queen, who were all talking at once,\nwhile all the rest were quite silent, and looked very uncomfortable.\nThe moment Alice appeared, she was appealed to by all three to settle\nthe question, and they repeated their arguments to her, though, as they\nall spoke at once, she found it very hard indeed to make out exactly\nwhat they said.\nThe executioner's argument was, that you couldn't cut off a head unless\nthere was a body to cut it off from: that he had never had to do such a\nthing before, and he wasn't going to begin at _his_ time of life.\nThe King's argument was, that anything that had a head could be\nbeheaded, and that you weren't to talk nonsense.\nThe Queen's argument was, that if something wasn't done about it in\nless than no time she'd have everybody executed, all round. (It was\nthis last remark that had made the whole party look so grave and\nanxious.)\nAlice could think of nothing else to say but \"It belongs to the\nDuchess: you'd better ask _her_ about it.\"\n\"She's in prison,\" the Queen said to the executioner: \"fetch her here.\"\nAnd the executioner went off like an arrow.\nThe Cat's head began fading away the moment he was gone, and, by the\ntime he had come back with the Duchess, it had entirely disappeared; so\nthe King and the executioner ran wildly up and down looking for it,\nwhile the rest of the party went back to the game.",
      "length": 2557,
      "num_lines": 41,
      "location": "Queen's Garden",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Alice",
          "role": "Trying to mediate a dispute",
          "importance": 0.6,
          "emotion": "Confused and concerned",
          "sentiment": 0.1,
          "quote": "It belongs to the Duchess: you'd better ask her about it.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Queen Of Hearts",
          "role": "Demanding executions and chaos",
          "importance": 0.9,
          "emotion": "Angry and authoritative",
          "sentiment": -0.8,
          "quote": "If something wasn't done about it in less than no time she'd have everybody executed, all round.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Executioner",
          "role": "Reluctant to execute without a body",
          "importance": 0.5,
          "emotion": "Nervous and defiant",
          "sentiment": -0.3,
          "quote": "You couldn't cut off a head unless there was a body to cut it off from: that he had never had to do such a thing before, and he wasn't going to begin at his time of life.",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "King Of Hearts",
          "role": "Arguing for beheading regardless",
          "importance": 0.4,
          "emotion": "Frustrated and insistent",
          "sentiment": -0.2,
          "quote": "Anything that had a head could be beheaded, and that you weren't to talk nonsense.",
          "fake_quote": "",
          "importance_rank": 4
        },
        {
          "name": "Cheshire Cat",
          "role": "Observing the chaos",
          "importance": 0.3,
          "emotion": "Mysterious and detached",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "I see the chaos unfolding, but it amuses me.",
          "importance_rank": 5
        },
        {
          "name": "Duchess",
          "role": "Subject of the dispute",
          "importance": 0.2,
          "emotion": "Unseen and imprisoned",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "I wish I could help, but I'm stuck in here.",
          "importance_rank": 6
        }
      ],
      "number": 8,
      "importance_rank": 8,
      "conflict_rank": 5
    },
    {
      "title": "Duchess and Alice Reunite",
      "summary": "Alice meets the Duchess again, who is in a good mood.",
      "chapter": "CHAPTER IX.",
      "first_line": 2,
      "last_line": 4,
      "text": "\"You can't think how glad I am to see you again, you dear old thing!\"\nsaid the Duchess, as she tucked her arm affectionately into Alice's,\nand they walked off together.",
      "length": 168,
      "num_lines": 3,
      "location": "Path",
      "importance": 0.7,
      "conflict": 0.0,
      "characters": [
        {
          "name": "Duchess",
          "role": "Expresses joy at seeing Alice and shows affection",
          "importance": 0.8,
          "emotion": "Joyful and affectionate",
          "sentiment": 1.0,
          "quote": "You can't think how glad I am to see you again, you dear old thing!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Receives the Duchess's affection and walks with her",
          "importance": 0.6,
          "emotion": "Pleasantly surprised",
          "sentiment": 0.8,
          "quote": "No quote available",
          "fake_quote": "It's so nice to see you again!",
          "importance_rank": 2
        }
      ],
      "number": 1,
      "importance_rank": 5,
      "conflict_rank": 15
    },
    {
      "title": "Alice's Thoughts on Temper",
      "summary": "Alice reflects on the Duchess's previous temper and her own thoughts on food and emotions.",
      "chapter": "CHAPTER IX.",
      "first_line": 5,
      "last_line": 15,
      "text": "Alice was very glad to find her in such a pleasant temper, and thought\nto herself that perhaps it was only the pepper that had made her so\nsavage when they met in the kitchen.\n\"When _I'm_ a Duchess,\" she said to herself, (not in a very hopeful\ntone though), \"I won't have any pepper in my kitchen _at all_. Soup\ndoes very well without—Maybe it's always pepper that makes people\nhot-tempered,\" she went on, very much pleased at having found out a new\nkind of rule, \"and vinegar that makes them sour—and camomile that makes\nthem bitter—and—and barley-sugar and such things that make children\nsweet-tempered. I only wish people knew _that_: then they wouldn't be\nso stingy about it, you know—\"",
      "length": 690,
      "num_lines": 11,
      "location": "Alice's Kitchen",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Reflecting on her observations about temperaments",
          "importance": 0.9,
          "emotion": "Curious and contemplative",
          "sentiment": 0.5,
          "quote": "I only wish people knew _that_: then they wouldn't be so stingy about it, you know—",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 2,
      "importance_rank": 6,
      "conflict_rank": 8
    },
    {
      "title": "Duchess's Moralizing",
      "summary": "The Duchess shares her thoughts on morals, making Alice uncomfortable.",
      "chapter": "CHAPTER IX.",
      "first_line": 16,
      "last_line": 24,
      "text": "She had quite forgotten the Duchess by this time, and was a little\nstartled when she heard her voice close to her ear. \"You're thinking\nabout something, my dear, and that makes you forget to talk. I can't\ntell you just now what the moral of that is, but I shall remember it in\na bit.\"\n\"Perhaps it hasn't one,\" Alice ventured to remark.\n\"Tut, tut, child!\" said the Duchess. \"Everything's got a moral, if only\nyou can find it.\" And she squeezed herself up closer to Alice's side as\nshe spoke.",
      "length": 490,
      "num_lines": 9,
      "location": "Duchess's House",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Duchess",
          "role": "Encouraging Alice to think and talk",
          "importance": 0.8,
          "emotion": "Slightly condescending yet friendly",
          "sentiment": 0.5,
          "quote": "Everything's got a moral, if only you can find it.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Questioning the Duchess's statement",
          "importance": 0.6,
          "emotion": "Curious and slightly skeptical",
          "sentiment": 0.2,
          "quote": "Perhaps it hasn't one.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 3,
      "importance_rank": 7,
      "conflict_rank": 9
    },
    {
      "title": "Conversation on Flamingos",
      "summary": "The Duchess and Alice discuss flamingos and mustard, leading to more moral lessons.",
      "chapter": "CHAPTER IX.",
      "first_line": 30,
      "last_line": 48,
      "text": "\"The game's going on rather better now,\" she said, by way of keeping up\nthe conversation a little.\n\"'Tis so,\" said the Duchess: \"and the moral of that is—'Oh, 'tis love,\n'tis love, that makes the world go round!'\"\n\"Somebody said,\" Alice whispered, \"that it's done by everybody minding\ntheir own business!\"\n\"Ah, well! It means much the same thing,\" said the Duchess, digging her\nsharp little chin into Alice's shoulder as she added, \"and the moral of\n_that_ is—'Take care of the sense, and the sounds will take care of\nthemselves.'\"\n\"How fond she is of finding morals in things!\" Alice thought to\nherself.\n\"I dare say you're wondering why I don't put my arm round your waist,\"\nthe Duchess said after a pause: \"the reason is, that I'm doubtful about\nthe temper of your flamingo. Shall I try the experiment?\"\n\"He might bite,\" Alice cautiously replied, not feeling at all anxious\nto have the experiment tried.\n\"Very true,\" said the Duchess: \"flamingoes and mustard both bite. And\nthe moral of that is—'Birds of a feather flock together.'\"",
      "length": 1034,
      "num_lines": 19,
      "location": "Duchess's House",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Duchess",
          "role": "Provides whimsical commentary and morals",
          "importance": 0.9,
          "emotion": "Playful and philosophical",
          "sentiment": 0.5,
          "quote": "Ah, well! It means much the same thing.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Engages in conversation and questions the Duchess",
          "importance": 0.8,
          "emotion": "Curious and cautious",
          "sentiment": 0.3,
          "quote": "How fond she is of finding morals in things!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 4,
      "importance_rank": 8,
      "conflict_rank": 10
    },
    {
      "title": "Duchess's Confusing Morals",
      "summary": "The Duchess continues to share convoluted morals, frustrating Alice.",
      "chapter": "CHAPTER IX.",
      "first_line": 49,
      "last_line": 70,
      "text": "\"Only mustard isn't a bird,\" Alice remarked.\n\"Right, as usual,\" said the Duchess: \"what a clear way you have of\nputting things!\"\n\"It's a mineral, I _think_,\" said Alice.\n\"Of course it is,\" said the Duchess, who seemed ready to agree to\neverything that Alice said; \"there's a large mustard-mine near here.\nAnd the moral of that is—'The more there is of mine, the less there is\nof yours.'\"\n\"Oh, I know!\" exclaimed Alice, who had not attended to this last\nremark, \"it's a vegetable. It doesn't look like one, but it is.\"\n\"I quite agree with you,\" said the Duchess; \"and the moral of that\nis—'Be what you would seem to be'—or if you'd like it put more\nsimply—'Never imagine yourself not to be otherwise than what it might\nappear to others that what you were or might have been was not\notherwise than what you had been would have appeared to them to be\notherwise.'\"\n\"I think I should understand that better,\" Alice said very politely,\n\"if I had it written down: but I can't quite follow it as you say it.\"\n\"That's nothing to what I could say if I chose,\" the Duchess replied,\nin a pleased tone.\n\"Pray don't trouble yourself to say it any longer than that,\" said\nAlice.",
      "length": 1163,
      "num_lines": 22,
      "location": "Duchess's House",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Questioning the Duchess's logic",
          "importance": 0.8,
          "emotion": "Confused and curious",
          "sentiment": 0.2,
          "quote": "I think I should understand that better, if I had it written down: but I can't quite follow it as you say it.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Duchess",
          "role": "Agreeing with Alice and providing nonsensical wisdom",
          "importance": 0.7,
          "emotion": "Pleased and condescending",
          "sentiment": 0.1,
          "quote": "Of course it is.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 5,
      "importance_rank": 9,
      "conflict_rank": 11
    },
    {
      "title": "Queen's Arrival",
      "summary": "The Queen arrives, interrupting the Duchess and Alice's conversation.",
      "chapter": "CHAPTER IX.",
      "first_line": 81,
      "last_line": 86,
      "text": "the m—\"\nBut here, to Alice's great surprise, the Duchess's voice died away,\neven in the middle of her favourite word 'moral,' and the arm that was\nlinked into hers began to tremble. Alice looked up, and there stood the\nQueen in front of them, with her arms folded, frowning like a\nthunderstorm.",
      "length": 294,
      "num_lines": 6,
      "location": "Duchess's House",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Observing the Duchess and Queen",
          "importance": 0.6,
          "emotion": "Surprised and curious",
          "sentiment": 0.3,
          "quote": "Alice looked up, and there stood the Queen in front of them, with her arms folded, frowning like a thunderstorm.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Duchess",
          "role": "Linked to Alice, showing fear",
          "importance": 0.5,
          "emotion": "Trembling and fearful",
          "sentiment": -0.5,
          "quote": "the Duchess's voice died away, even in the middle of her favourite word 'moral,'",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Queen Of Hearts",
          "role": "Confronting Alice and the Duchess",
          "importance": 0.8,
          "emotion": "Angry and authoritative",
          "sentiment": -0.7,
          "quote": "frowning like a thunderstorm.",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 6,
      "importance_rank": 10,
      "conflict_rank": 3
    },
    {
      "title": "Duchess's Fate",
      "summary": "The Queen threatens the Duchess, who quickly disappears.",
      "chapter": "CHAPTER IX.",
      "first_line": 88,
      "last_line": 91,
      "text": "\"Now, I give you fair warning,\" shouted the Queen, stamping on the\nground as she spoke; \"either you or your head must be off, and that in\nabout half no time! Take your choice!\"\nThe Duchess took her choice, and was gone in a moment.",
      "length": 231,
      "num_lines": 4,
      "location": "King's Court",
      "importance": 0.9,
      "conflict": 0.8,
      "characters": [
        {
          "name": "Queen Of Hearts",
          "role": "Threatening the Duchess with execution",
          "importance": 1.0,
          "emotion": "Angry and commanding",
          "sentiment": -1.0,
          "quote": "Now, I give you fair warning,\" shouted the Queen, stamping on the ground as she spoke; \"either you or your head must be off, and that in about half no time! Take your choice!\"",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Duchess",
          "role": "Choosing to flee from danger",
          "importance": 0.8,
          "emotion": "Fearful and submissive",
          "sentiment": -1.0,
          "quote": "The Duchess took her choice, and was gone in a moment.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 7,
      "importance_rank": 1,
      "conflict_rank": 2
    },
    {
      "title": "Queen and Alice",
      "summary": "The Queen takes Alice back to the croquet game, where chaos ensues.",
      "chapter": "CHAPTER IX.",
      "first_line": 92,
      "last_line": 104,
      "text": "\"Let's go on with the game,\" the Queen said to Alice; and Alice was too\nmuch frightened to say a word, but slowly followed her back to the\ncroquet-ground.\nThe other guests had taken advantage of the Queen's absence, and were\nresting in the shade: however, the moment they saw her, they hurried\nback to the game, the Queen merely remarking that a moment's delay\nwould cost them their lives.\nAll the time they were playing the Queen never left off quarrelling\nwith the other players, and shouting \"Off with his head!\" or \"Off with\nher head!\" Those whom she sentenced were taken into custody by the\nsoldiers, who of course had to leave off being arches to do this, so\nthat by the end of half an hour or so there were no arches left, and\nall the players, except the King, the Queen, and Alice, were in custody",
      "length": 805,
      "num_lines": 13,
      "location": "Queen's Garden",
      "importance": 0.8,
      "conflict": 0.9,
      "characters": [
        {
          "name": "Queen Of Hearts",
          "role": "Commands and threatens players",
          "importance": 1.0,
          "emotion": "Angry and authoritative",
          "sentiment": -1.0,
          "quote": "Off with his head!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Frightened participant",
          "importance": 0.7,
          "emotion": "Fearful and submissive",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "I just want to go home.",
          "importance_rank": 2
        },
        {
          "name": "King Of Hearts",
          "role": "Passive observer",
          "importance": 0.5,
          "emotion": "Indifferent",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "Let's just keep playing.",
          "importance_rank": 3
        }
      ],
      "number": 8,
      "importance_rank": 2,
      "conflict_rank": 1
    },
    {
      "title": "Introduction to the Gryphon",
      "summary": "Alice meets the Gryphon after the Queen leaves to oversee executions.",
      "chapter": "CHAPTER IX.",
      "first_line": 116,
      "last_line": 123,
      "text": "They very soon came upon a Gryphon, lying fast asleep in the sun. (If\nyou don't know what a Gryphon is, look at the picture.) \"Up, lazy\nthing!\" said the Queen, \"and take this young lady to see the Mock\nTurtle, and to hear his history. I must go back and see after some\nexecutions I have ordered;\" and she walked off, leaving Alice alone\nwith the Gryphon. Alice did not quite like the look of the creature,\nbut on the whole she thought it would be quite as safe to stay with it\nas to go after that savage Queen: so she waited.",
      "length": 525,
      "num_lines": 8,
      "location": "Meadow",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Queen Of Hearts",
          "role": "Commands the Gryphon to assist Alice",
          "importance": 0.8,
          "emotion": "Authoritative and dismissive",
          "sentiment": -0.5,
          "quote": "Up, lazy thing!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Decides to stay with the Gryphon",
          "importance": 0.6,
          "emotion": "Apprehensive but curious",
          "sentiment": 0.2,
          "quote": "No quote available",
          "fake_quote": "I hope this creature is friendly.",
          "importance_rank": 2
        },
        {
          "name": "Gryphon",
          "role": "Awaits to be awakened by the Queen",
          "importance": 0.5,
          "emotion": "Indifferent and sleepy",
          "sentiment": 0.0,
          "quote": "No quote available",
          "fake_quote": "Just five more minutes of sleep.",
          "importance_rank": 3
        }
      ],
      "number": 9,
      "importance_rank": 11,
      "conflict_rank": 4
    },
    {
      "title": "Gryphon's Humor",
      "summary": "The Gryphon shares its humorous take on the Queen's threats.",
      "chapter": "CHAPTER IX.",
      "first_line": 125,
      "last_line": 129,
      "text": "she was out of sight: then it chuckled. \"What fun!\" said the Gryphon,\nhalf to itself, half to Alice.\n\"What _is_ the fun?\" said Alice.\n\"Why, _she_,\" said the Gryphon. \"It's all her fancy, that: they never\nexecutes nobody, you know. Come on!\"",
      "length": 240,
      "num_lines": 5,
      "location": "Unknown Location",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Gryphon",
          "role": "Encouraging Alice to join in the fun",
          "importance": 0.8,
          "emotion": "Playful and mischievous",
          "sentiment": 0.6,
          "quote": "What fun!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Inquisitive and confused about the fun",
          "importance": 0.6,
          "emotion": "Curious and slightly bewildered",
          "sentiment": 0.2,
          "quote": "What _is_ the fun?",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 10,
      "importance_rank": 12,
      "conflict_rank": 5
    },
    {
      "title": "Meeting the Mock Turtle",
      "summary": "Alice and the Gryphon find the Mock Turtle, who appears sad.",
      "chapter": "CHAPTER IX.",
      "first_line": 132,
      "last_line": 139,
      "text": "They had not gone far before they saw the Mock Turtle in the distance,\nsitting sad and lonely on a little ledge of rock, and, as they came\nnearer, Alice could hear him sighing as if his heart would break. She\npitied him deeply. \"What is his sorrow?\" she asked the Gryphon, and the\nGryphon answered, very nearly in the same words as before, \"It's all\nhis fancy, that: he hasn't got no sorrow, you know. Come on!\"\nSo they went up to the Mock Turtle, who looked at them with large eyes\nfull of tears, but said nothing.",
      "length": 515,
      "num_lines": 8,
      "location": "Ledge",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and empathetic towards the Mock Turtle",
          "importance": 0.8,
          "emotion": "Pity and concern",
          "sentiment": 0.5,
          "quote": "What is his sorrow?",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Gryphon",
          "role": "Dismissive and trying to move on",
          "importance": 0.6,
          "emotion": "Indifferent",
          "sentiment": -0.2,
          "quote": "It's all his fancy, that: he hasn't got no sorrow, you know. Come on!",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Mock Turtle",
          "role": "Sad and lonely character",
          "importance": 0.9,
          "emotion": "Sadness and loneliness",
          "sentiment": -0.7,
          "quote": "No quote available",
          "fake_quote": "I wish someone would understand my sorrow.",
          "importance_rank": 1
        }
      ],
      "number": 11,
      "importance_rank": 13,
      "conflict_rank": 6
    },
    {
      "title": "Mock Turtle's History",
      "summary": "The Mock Turtle begins to tell his story, asking for silence.",
      "chapter": "CHAPTER IX.",
      "first_line": 142,
      "last_line": 144,
      "text": "\"I'll tell it her,\" said the Mock Turtle in a deep, hollow tone: \"sit\ndown, both of you, and don't speak a word till I've finished.\"\nSo they sat down, and nobody spoke for some minutes. Alice thought to",
      "length": 202,
      "num_lines": 3,
      "location": "Mock Turtle's Area",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Mock Turtle",
          "role": "Narrator of a story",
          "importance": 0.8,
          "emotion": "Serious and commanding",
          "sentiment": 0.2,
          "quote": "I'll tell it her, sit down, both of you, and don't speak a word till I've finished.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Listener and participant",
          "importance": 0.5,
          "emotion": "Curious and attentive",
          "sentiment": 0.5,
          "quote": "No quote available",
          "fake_quote": "I wonder what story he will tell.",
          "importance_rank": 2
        }
      ],
      "number": 12,
      "importance_rank": 14,
      "conflict_rank": 12
    },
    {
      "title": "Mock Turtle's Education",
      "summary": "The Mock Turtle shares his educational background, leading to confusion.",
      "chapter": "CHAPTER IX.",
      "first_line": 147,
      "last_line": 160,
      "text": "\"Once,\" said the Mock Turtle at last, with a deep sigh, \"I was a real\nTurtle.\"\nThese words were followed by a very long silence, broken only by an\noccasional exclamation of \"Hjckrrh!\" from the Gryphon, and the constant\nheavy sobbing of the Mock Turtle. Alice was very nearly getting up and\nsaying, \"Thank you, sir, for your interesting story,\" but she could not\nhelp thinking there _must_ be more to come, so she sat still and said\nnothing.\n\"When we were little,\" the Mock Turtle went on at last, more calmly,\nthough still sobbing a little now and then, \"we went to school in the\nsea. The master was an old Turtle—we used to call him Tortoise—\"\n\"Why did you call him Tortoise, if he wasn't one?\" Alice asked.\n\"We called him Tortoise because he taught us,\" said the Mock Turtle\nangrily: \"really you are very dull!\"",
      "length": 813,
      "num_lines": 14,
      "location": "Underwater",
      "importance": 0.8,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Mock Turtle",
          "role": "Sharing his past experiences",
          "importance": 0.9,
          "emotion": "Nostalgic and sorrowful",
          "sentiment": -0.5,
          "quote": "Once, I was a real Turtle.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Curious listener",
          "importance": 0.6,
          "emotion": "Inquisitive and patient",
          "sentiment": 0.5,
          "quote": "Why did you call him Tortoise, if he wasn't one?",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Gryphon",
          "role": "Occasional interrupter",
          "importance": 0.3,
          "emotion": "Restless and frustrated",
          "sentiment": -0.2,
          "quote": "Hjckrrh!",
          "fake_quote": "I can't take this anymore!",
          "importance_rank": 3
        }
      ],
      "number": 13,
      "importance_rank": 3,
      "conflict_rank": 7
    },
    {
      "title": "Mock Turtle's Subjects",
      "summary": "The Mock Turtle lists his subjects, including the absurd 'Uglification.'",
      "chapter": "CHAPTER IX.",
      "first_line": 165,
      "last_line": 210,
      "text": "day about it!\" and he went on in these words:\n\"Yes, we went to school in the sea, though you mayn't believe it—\"\n\"I never said I didn't!\" interrupted Alice.\n\"You did,\" said the Mock Turtle.\n\"Hold your tongue!\" added the Gryphon, before Alice could speak again.\nThe Mock Turtle went on.\n\"We had the best of educations—in fact, we went to school every day—\"\n\"_I've_ been to a day-school, too,\" said Alice; \"you needn't be so\nproud as all that.\"\n\"With extras?\" asked the Mock Turtle a little anxiously.\n\"Yes,\" said Alice, \"we learned French and music.\"\n\"And washing?\" said the Mock Turtle.\n\"Certainly not!\" said Alice indignantly.\n\"Ah! then yours wasn't a really good school,\" said the Mock Turtle in a\ntone of great relief. \"Now at _ours_ they had at the end of the bill,\n'French, music, _and washing_—extra.'\"\n\"You couldn't have wanted it much,\" said Alice; \"living at the bottom\nof the sea.\"\n\"I couldn't afford to learn it.\" said the Mock Turtle with a sigh. \"I\nonly took the regular course.\"\n\"What was that?\" inquired Alice.\n\"Reeling and Writhing, of course, to begin with,\" the Mock Turtle\nreplied; \"and then the different branches of Arithmetic—Ambition,\nDistraction, Uglification, and Derision.\"\n\"I never heard of 'Uglification,'\" Alice ventured to say. \"What is it?\"\nThe Gryphon lifted up both its paws in surprise. \"What! Never heard of\nuglifying!\" it exclaimed. \"You know what to beautify is, I suppose?\"\n\"Yes,\" said Alice doubtfully: \"it means—to—make—anything—prettier.\"\n\"Well, then,\" the Gryphon went on, \"if you don't know what to uglify\nis, you _are_ a simpleton.\"\nAlice did not feel encouraged to ask any more questions about it, so\nshe turned to the Mock Turtle, and said \"What else had you to learn?\"\n\"Well, there was Mystery,\" the Mock Turtle replied, counting off the\nsubjects on his flappers, \"—Mystery, ancient and modern, with\nSeaography: then Drawling—the Drawling-master was an old conger-eel,\nthat used to come once a week: _he_ taught us Drawling, Stretching, and\nFainting in Coils.\"\n\"What was _that_ like?\" said Alice.\n\"Well, I can't show it you myself,\" the Mock Turtle said: \"I'm too\nstiff. And the Gryphon never learnt it.\"\n\"Hadn't time,\" said the Gryphon: \"I went to the Classics master,\nthough. He was an old crab, _he_ was.\"\n\"I never went to him,\" the Mock Turtle said with a sigh: \"he taught\nLaughing and Grief, they used to say.\"\n\"So he did, so he did,\" said the Gryphon, sighing in his turn; and both\ncreatures hid their faces in their paws.",
      "length": 2475,
      "num_lines": 46,
      "location": "Underwater",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious student engaging in conversation",
          "importance": 0.7,
          "emotion": "Indignant and curious",
          "sentiment": 0.2,
          "quote": "Certainly not!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mock Turtle",
          "role": "Proud yet anxious about education",
          "importance": 0.6,
          "emotion": "Relieved and nostalgic",
          "sentiment": 0.5,
          "quote": "Ah! then yours wasn't a really good school.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Gryphon",
          "role": "Defensive and surprised character",
          "importance": 0.5,
          "emotion": "Surprised and condescending",
          "sentiment": -0.1,
          "quote": "What! Never heard of uglifying!",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 14,
      "importance_rank": 4,
      "conflict_rank": 13
    },
    {
      "title": "Lessons and Games",
      "summary": "Alice inquires about the Mock Turtle's lessons, leading to a discussion about games.",
      "chapter": "CHAPTER IX.",
      "first_line": 211,
      "last_line": 224,
      "text": "\"And how many hours a day did you do lessons?\" said Alice, in a hurry\nto change the subject.\n\"Ten hours the first day,\" said the Mock Turtle: \"nine the next, and so\non.\"\n\"What a curious plan!\" exclaimed Alice.\n\"That's the reason they're called lessons,\" the Gryphon remarked:\n\"because they lessen from day to day.\"\nThis was quite a new idea to Alice, and she thought it over a little\nbefore she made her next remark. \"Then the eleventh day must have been\na holiday?\"\n\"Of course it was,\" said the Mock Turtle.\n\"And how did you manage on the twelfth?\" Alice went on eagerly.\n\"That's enough about lessons,\" the Gryphon interrupted in a very\ndecided tone: \"tell her something about the games now.\"",
      "length": 693,
      "num_lines": 14,
      "location": "Whimsical Scene",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious and eager to learn",
          "importance": 0.8,
          "emotion": "Inquisitive and engaged",
          "sentiment": 0.5,
          "quote": "What a curious plan!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mock Turtle",
          "role": "Explains lessons and engages",
          "importance": 0.7,
          "emotion": "Nostalgic and informative",
          "sentiment": 0.6,
          "quote": "Of course it was.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Gryphon",
          "role": "Redirects conversation to games",
          "importance": 0.6,
          "emotion": "Decisive and assertive",
          "sentiment": 0.4,
          "quote": "That's enough about lessons.",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 15,
      "importance_rank": 15,
      "conflict_rank": 14
    },
    {
      "title": "Mock Turtle's Sorrow",
      "summary": "The Mock Turtle expresses his sadness to Alice.",
      "chapter": "CHAPTER X.",
      "first_line": 2,
      "last_line": 33,
      "text": "The Mock Turtle sighed deeply, and drew the back of one flapper across\nhis eyes. He looked at Alice, and tried to speak, but for a minute or\ntwo sobs choked his voice. \"Same as if he had a bone in his throat,\"\nsaid the Gryphon: and it set to work shaking him and punching him in\nthe back. At last the Mock Turtle recovered his voice, and, with tears\nrunning down his cheeks, he went on again:—\n\"You may not have lived much under the sea—\" (\"I haven't,\" said\nAlice)—\"and perhaps you were never even introduced to a lobster—\"\n(Alice began to say \"I once tasted—\" but checked herself hastily, and\nsaid \"No, never\") \"—so you can have no idea what a delightful thing a\nLobster Quadrille is!\"\n\"No, indeed,\" said Alice. \"What sort of a dance is it?\"\n\"Why,\" said the Gryphon, \"you first form into a line along the\nsea-shore—\"\n\"Two lines!\" cried the Mock Turtle. \"Seals, turtles, salmon, and so on;\nthen, when you've cleared all the jelly-fish out of the way—\"\n\"_That_ generally takes some time,\" interrupted the Gryphon.\n\"—you advance twice—\"\n\"Each with a lobster as a partner!\" cried the Gryphon.\n\"Of course,\" the Mock Turtle said: \"advance twice, set to partners—\"\n\"—change lobsters, and retire in same order,\" continued the Gryphon.\n\"Then, you know,\" the Mock Turtle went on, \"you throw the—\"\n\"The lobsters!\" shouted the Gryphon, with a bound into the air.\n\"—as far out to sea as you can—\"\n\"Swim after them!\" screamed the Gryphon.\n\"Turn a somersault in the sea!\" cried the Mock Turtle, capering wildly\nabout.\n\"Change lobsters again!\" yelled the Gryphon at the top of its voice.\n\"Back to land again, and that's all the first figure,\" said the Mock\nTurtle, suddenly dropping his voice; and the two creatures, who had\nbeen jumping about like mad things all this time, sat down again very\nsadly and quietly, and looked at Alice.",
      "length": 1819,
      "num_lines": 32,
      "location": "Underwater",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Mock Turtle",
          "role": "Describes the Lobster Quadrille dance",
          "importance": 0.7,
          "emotion": "Nostalgic and sad",
          "sentiment": 0.2,
          "quote": "You may not have lived much under the sea—",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Gryphon",
          "role": "Assists Mock Turtle in explaining the dance",
          "importance": 0.6,
          "emotion": "Excited and playful",
          "sentiment": 0.5,
          "quote": "Each with a lobster as a partner!",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Alice",
          "role": "Inquisitive listener, engages with the Mock Turtle and Gryphon",
          "importance": 0.5,
          "emotion": "Curious and slightly confused",
          "sentiment": 0.3,
          "quote": "What sort of a dance is it?",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 1,
      "importance_rank": 1,
      "conflict_rank": 2
    },
    {
      "title": "Lobster Quadrille Explanation",
      "summary": "The Gryphon and Mock Turtle explain the Lobster Quadrille dance.",
      "chapter": "CHAPTER X.",
      "first_line": 34,
      "last_line": 80,
      "text": "\"It must be a very pretty dance,\" said Alice timidly.\n\"Would you like to see a little of it?\" said the Mock Turtle.\n\"Very much indeed,\" said Alice.\n\"Come, let's try the first figure!\" said the Mock Turtle to the\nGryphon. \"We can do without lobsters, you know. Which shall sing?\"\n\"Oh, _you_ sing,\" said the Gryphon. \"I've forgotten the words.\"\nSo they began solemnly dancing round and round Alice, every now and\nthen treading on her toes when they passed too close, and waving their\nforepaws to mark the time, while the Mock Turtle sang this, very slowly\nand sadly:—\n\"Will you walk a little faster?\" said a whiting to a snail.\n\"There's a porpoise close behind us, and he's treading on my tail.\nSee how eagerly the lobsters and the turtles all advance!\nThey are waiting on the shingle—will you come and join the dance?\nWill you, won't you, will you, won't you, will you join the dance?\nWill you, won't you, will you, won't you, won't you join the dance?\n\"You can really have no notion how delightful it will be\nWhen they take us up and throw us, with the lobsters, out to sea!\"\nBut the snail replied \"Too far, too far!\" and gave a look askance—\nSaid he thanked the whiting kindly, but he would not join the dance.\nWould not, could not, would not, could not, would not join the dance.\nWould not, could not, would not, could not, could not join the dance.\n\"What matters it how far we go?\" his scaly friend replied.\n\"There is another shore, you know, upon the other side.\nThe further off from England the nearer is to France—\nThen turn not pale, beloved snail, but come and join the dance.\nWill you, won't you, will you, won't you, will you join the dance?\nWill you, won't you, will you, won't you, won't you join the dance?\"\n\"Thank you, it's a very interesting dance to watch,\" said Alice,\nfeeling very glad that it was over at last: \"and I do so like that\ncurious song about the whiting!\"\n\"Oh, as to the whiting,\" said the Mock Turtle, \"they—you've seen them,\nof course?\"\n\"Yes,\" said Alice, \"I've often seen them at dinn—\" she checked herself\nhastily.\n\"I don't know where Dinn may be,\" said the Mock Turtle, \"but if you've\nseen them so often, of course you know what they're like.\"\n\"I believe so,\" Alice replied thoughtfully. \"They have their tails in\ntheir mouths—and they're all over crumbs.\"\n\"You're wrong about the crumbs,\" said the Mock Turtle: \"crumbs would\nall wash off in the sea. But they _have_ their tails in their mouths;\nand the reason is—\" here the Mock Turtle yawned and shut his\neyes.—\"Tell her about the reason and all that,\" he said to the Gryphon.\n\"The reason is,\" said the Gryphon, \"that they _would_ go with the\nlobsters to the dance. So they got thrown out to sea. So they had to\nfall a long way. So they got their tails fast in their mouths. So they\ncouldn't get them out again. That's all.\"",
      "length": 2811,
      "num_lines": 47,
      "location": "Whimsical Scene",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious observer of the dance",
          "importance": 0.7,
          "emotion": "Timid and intrigued",
          "sentiment": 0.5,
          "quote": "\"It must be a very pretty dance,\" said Alice timidly.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Mock Turtle",
          "role": "Leader of the dance and singer",
          "importance": 0.8,
          "emotion": "Melancholic and nostalgic",
          "sentiment": -0.3,
          "quote": "\"Will you walk a little faster?\" said a whiting to a snail.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Gryphon",
          "role": "Supportive partner to the Mock Turtle",
          "importance": 0.6,
          "emotion": "Playful and slightly forgetful",
          "sentiment": 0.2,
          "quote": "\"Oh, _you_ sing,\" said the Gryphon. \"I've forgotten the words.\"",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 2,
      "importance_rank": 2,
      "conflict_rank": 3
    },
    {
      "title": "Alice's Adventures Recap",
      "summary": "Alice begins recounting her adventures to the Gryphon and Mock Turtle.",
      "chapter": "CHAPTER X.",
      "first_line": 109,
      "last_line": 174,
      "text": "\"I could tell you my adventures—beginning from this morning,\" said\nAlice a little timidly: \"but it's no use going back to yesterday,\nbecause I was a different person then.\"\n\"Explain all that,\" said the Mock Turtle.\n\"No, no! The adventures first,\" said the Gryphon in an impatient tone:\n\"explanations take such a dreadful time.\"\nSo Alice began telling them her adventures from the time when she first\nsaw the White Rabbit. She was a little nervous about it just at first,\nthe two creatures got so close to her, one on each side, and opened\ntheir eyes and mouths so _very_ wide, but she gained courage as she\nwent on. Her listeners were perfectly quiet till she got to the part\nabout her repeating \"_You are old, Father William_,\" to the\nCaterpillar, and the words all coming different, and then the Mock\nTurtle drew a long breath, and said \"That's very curious.\"\n\"It's all about as curious as it can be,\" said the Gryphon.\n\"It all came different!\" the Mock Turtle repeated thoughtfully. \"I\nshould like to hear her try and repeat something now. Tell her to\nbegin.\" He looked at the Gryphon as if he thought it had some kind of\nauthority over Alice.\n\"Stand up and repeat ''_Tis the voice of the sluggard_,'\" said the\nGryphon.\n\"How the creatures order one about, and make one repeat lessons!\"\nthought Alice; \"I might as well be at school at once.\" However, she got\nup, and began to repeat it, but her head was so full of the Lobster\nQuadrille, that she hardly knew what she was saying, and the words came\nvery queer indeed:—\n\"'Tis the voice of the Lobster; I heard him declare,\n\"You have baked me too brown, I must sugar my hair.\"\nAs a duck with its eyelids, so he with his nose\nTrims his belt and his buttons, and turns out his toes.\"\n[later editions continued as follows\nWhen the sands are all dry, he is gay as a lark,\nAnd will talk in contemptuous tones of the Shark,\nBut, when the tide rises and sharks are around,\nHis voice has a timid and tremulous sound.]\n\"That's different from what _I_ used to say when I was a child,\" said\nthe Gryphon.\n\"Well, I never heard it before,\" said the Mock Turtle; \"but it sounds\nuncommon nonsense.\"\nAlice said nothing; she had sat down with her face in her hands,\nwondering if anything would _ever_ happen in a natural way again.\n\"I should like to have it explained,\" said the Mock Turtle.\n\"She can't explain it,\" said the Gryphon hastily. \"Go on with the next\nverse.\"\n\"But about his toes?\" the Mock Turtle persisted. \"How _could_ he turn\nthem out with his nose, you know?\"\n\"It's the first position in dancing.\" Alice said; but was dreadfully\npuzzled by the whole thing, and longed to change the subject.\n\"Go on with the next verse,\" the Gryphon repeated impatiently: \"it\nbegins '_I passed by his garden_.'\"\nAlice did not dare to disobey, though she felt sure it would all come\nwrong, and she went on in a trembling voice:—\n\"I passed by his garden, and marked, with one eye,\nHow the Owl and the Panther were sharing a pie—\"\n[later editions continued as follows\nThe Panther took pie-crust, and gravy, and meat,\nWhile the Owl had the dish as its share of the treat.\nWhen the pie was all finished, the Owl, as a boon,\nWas kindly permitted to pocket the spoon:\nWhile the Panther received knife and fork with a growl,\nAnd concluded the banquet—]\n\"What _is_ the use of repeating all that stuff,\" the Mock Turtle\ninterrupted, \"if you don't explain it as you go on? It's by far the\nmost confusing thing _I_ ever heard!\"\n\"Yes, I think you'd better leave off,\" said the Gryphon: and Alice was\nonly too glad to do so.",
      "length": 3540,
      "num_lines": 66,
      "location": "Whimsical Scene",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Narrator of her adventures",
          "importance": 0.9,
          "emotion": "Nervous yet determined",
          "sentiment": 0.2,
          "quote": "I might as well be at school at once.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mock Turtle",
          "role": "Curious listener and questioner",
          "importance": 0.7,
          "emotion": "Confused and inquisitive",
          "sentiment": -0.1,
          "quote": "That's very curious.",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Gryphon",
          "role": "Impatient guide and authority",
          "importance": 0.8,
          "emotion": "Impatient and commanding",
          "sentiment": -0.2,
          "quote": "Go on with the next verse.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 3,
      "importance_rank": 3,
      "conflict_rank": 1
    },
    {
      "title": "Mock Turtle's Song Request",
      "summary": "Alice requests a song from the Mock Turtle.",
      "chapter": "CHAPTER X.",
      "first_line": 175,
      "last_line": 205,
      "text": "\"Shall we try another figure of the Lobster Quadrille?\" the Gryphon\nwent on. \"Or would you like the Mock Turtle to sing you a song?\"\n\"Oh, a song, please, if the Mock Turtle would be so kind,\" Alice\nreplied, so eagerly that the Gryphon said, in a rather offended tone,\n\"Hm! No accounting for tastes! Sing her '_Turtle Soup_,' will you, old\nfellow?\"\nThe Mock Turtle sighed deeply, and began, in a voice sometimes choked\nwith sobs, to sing this:—\n\"Beautiful Soup, so rich and green,\nWaiting in a hot tureen!\nWho for such dainties would not stoop?\nSoup of the evening, beautiful Soup!\nSoup of the evening, beautiful Soup!\nBeau—ootiful Soo—oop!\nBeau—ootiful Soo—oop!\nSoo—oop of the e—e—evening,\nBeautiful, beautiful Soup!\n\"Beautiful Soup! Who cares for fish,\nGame, or any other dish?\nWho would not give all else for two p\nennyworth only of beautiful Soup?\nPennyworth only of beautiful Soup?\nBeau—ootiful Soo—oop!\nBeau—ootiful Soo—oop!\nSoo—oop of the e—e—evening,\nBeautiful, beauti—FUL SOUP!\"\n\"Chorus again!\" cried the Gryphon, and the Mock Turtle had just begun\nto repeat it, when a cry of \"The trial's beginning!\" was heard in the\ndistance.\n\"Come on!\" cried the Gryphon, and, taking Alice by the hand, it hurried\noff, without waiting for the end of the song.",
      "length": 1254,
      "num_lines": 31,
      "location": "Whimsical Scene",
      "importance": 0.8,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Gryphon",
          "role": "Encourages the Mock Turtle to sing",
          "importance": 0.7,
          "emotion": "Offended and eager",
          "sentiment": -0.2,
          "quote": "Hm! No accounting for tastes! Sing her '_Turtle Soup_,' will you, old fellow?",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Mock Turtle",
          "role": "Sings a song about soup",
          "importance": 0.6,
          "emotion": "Melancholic and nostalgic",
          "sentiment": -0.3,
          "quote": "Beautiful Soup, so rich and green,",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Alice",
          "role": "Requests a song from the Mock Turtle",
          "importance": 0.5,
          "emotion": "Eager and enthusiastic",
          "sentiment": 0.5,
          "quote": "Oh, a song, please, if the Mock Turtle would be so kind.",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 4,
      "importance_rank": 4,
      "conflict_rank": 4
    },
    {
      "title": "Courtroom Assembly",
      "summary": "The King and Queen preside over the court with the Knave in chains.",
      "chapter": "CHAPTER XI.",
      "first_line": 1,
      "last_line": 12,
      "text": "Who Stole the Tarts?\nThe King and Queen of Hearts were seated on their throne when they\narrived, with a great crowd assembled about them—all sorts of little\nbirds and beasts, as well as the whole pack of cards: the Knave was\nstanding before them, in chains, with a soldier on each side to guard\nhim; and near the King was the White Rabbit, with a trumpet in one\nhand, and a scroll of parchment in the other. In the very middle of the\ncourt was a table, with a large dish of tarts upon it: they looked so\ngood, that it made Alice quite hungry to look at them—\"I wish they'd\nget the trial done,\" she thought, \"and hand round the refreshments!\"\nBut there seemed to be no chance of this, so she began looking at\neverything about her, to pass away the time.",
      "length": 752,
      "num_lines": 12,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "King Of Hearts",
          "role": "Presiding over the trial",
          "importance": 0.9,
          "emotion": "Authoritative and impatient",
          "sentiment": 0.2,
          "quote": "No quote available",
          "fake_quote": "Justice must be served swiftly!",
          "importance_rank": 1
        },
        {
          "name": "Queen Of Hearts",
          "role": "Demanding order and justice",
          "importance": 0.9,
          "emotion": "Angry and commanding",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "Off with their heads!",
          "importance_rank": 2
        },
        {
          "name": "Knave Of Hearts",
          "role": "Accused of stealing tarts",
          "importance": 0.8,
          "emotion": "Nervous and defensive",
          "sentiment": -0.3,
          "quote": "No quote available",
          "fake_quote": "I didn't take them, I swear!",
          "importance_rank": 3
        },
        {
          "name": "White Rabbit",
          "role": "Announcing the trial proceedings",
          "importance": 0.7,
          "emotion": "Flustered and anxious",
          "sentiment": -0.2,
          "quote": "No quote available",
          "fake_quote": "Order! Order in the court!",
          "importance_rank": 4
        },
        {
          "name": "Alice",
          "role": "Observer and participant in the trial",
          "importance": 0.6,
          "emotion": "Hungry and impatient",
          "sentiment": 0.1,
          "quote": "I wish they'd get the trial done.",
          "fake_quote": "",
          "importance_rank": 5
        }
      ],
      "number": 1,
      "importance_rank": 2,
      "conflict_rank": 3
    },
    {
      "title": "Alice Observes",
      "summary": "Alice observes the court proceedings and identifies the roles of characters.",
      "chapter": "CHAPTER XI.",
      "first_line": 13,
      "last_line": 26,
      "text": "Alice had never been in a court of justice before, but she had read\nabout them in books, and she was quite pleased to find that she knew\nthe name of nearly everything there. \"That's the judge,\" she said to\nherself, \"because of his great wig.\"\nThe judge, by the way, was the King; and as he wore his crown over the\nwig, (look at the frontispiece if you want to see how he did it,) he\ndid not look at all comfortable, and it was certainly not becoming.\n\"And that's the jury-box,\" thought Alice, \"and those twelve creatures,\"\n(she was obliged to say \"creatures,\" you see, because some of them were\nanimals, and some were birds,) \"I suppose they are the jurors.\" She\nsaid this last word two or three times over to herself, being rather\nproud of it: for she thought, and rightly too, that very few little\ngirls of her age knew the meaning of it at all. However, \"jury-men\"\nwould have done just as well.",
      "length": 897,
      "num_lines": 14,
      "location": "King's Court",
      "importance": 0.7,
      "conflict": 0.2,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious observer of the court",
          "importance": 0.8,
          "emotion": "Pleased and proud",
          "sentiment": 0.6,
          "quote": "That's the judge, because of his great wig.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "King Of Hearts",
          "role": "Judge presiding over the court",
          "importance": 0.6,
          "emotion": "Uncomfortable and unbefitting",
          "sentiment": -0.3,
          "quote": "No quote available",
          "fake_quote": "I wish I could wear this crown without the wig.",
          "importance_rank": 2
        }
      ],
      "number": 2,
      "importance_rank": 6,
      "conflict_rank": 8
    },
    {
      "title": "Jurors' Confusion",
      "summary": "Alice questions the jurors' actions as they write down nonsense.",
      "chapter": "CHAPTER XI.",
      "first_line": 27,
      "last_line": 40,
      "text": "The twelve jurors were all writing very busily on slates. \"What are\nthey doing?\" Alice whispered to the Gryphon. \"They can't have anything\nto put down yet, before the trial's begun.\"\n\"They're putting down their names,\" the Gryphon whispered in reply,\n\"for fear they should forget them before the end of the trial.\"\n\"Stupid things!\" Alice began in a loud, indignant voice, but she\nstopped hastily, for the White Rabbit cried out, \"Silence in the\ncourt!\" and the King put on his spectacles and looked anxiously round,\nto make out who was talking.\nAlice could see, as well as if she were looking over their shoulders,\nthat all the jurors were writing down \"stupid things!\" on their slates,\nand she could even make out that one of them didn't know how to spell\n\"stupid,\" and that he had to ask his neighbour to tell him. \"A nice\nmuddle their slates'll be in before the trial's over!\" thought Alice.",
      "length": 894,
      "num_lines": 14,
      "location": "King's Court",
      "importance": 0.7,
      "conflict": 0.3,
      "characters": [
        {
          "name": "Alice",
          "role": "Questioning the jurors' actions",
          "importance": 0.8,
          "emotion": "Indignant and curious",
          "sentiment": -0.5,
          "quote": "Stupid things!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Gryphon",
          "role": "Explaining the jurors' behavior",
          "importance": 0.5,
          "emotion": "Calm and informative",
          "sentiment": 0.5,
          "quote": "They're putting down their names, for fear they should forget them before the end of the trial.",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "White Rabbit",
          "role": "Maintaining order in the court",
          "importance": 0.6,
          "emotion": "Authoritative and commanding",
          "sentiment": 0.5,
          "quote": "Silence in the court!",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "King Of Hearts",
          "role": "Observing the court proceedings",
          "importance": 0.4,
          "emotion": "Anxious and concerned",
          "sentiment": 0.2,
          "quote": "No quote available",
          "fake_quote": "I must see who is causing this disturbance!",
          "importance_rank": 4
        }
      ],
      "number": 3,
      "importance_rank": 7,
      "conflict_rank": 7
    },
    {
      "title": "Accusation Read",
      "summary": "The White Rabbit reads the accusation against the Knave.",
      "chapter": "CHAPTER XI.",
      "first_line": 48,
      "last_line": 54,
      "text": "\"Herald, read the accusation!\" said the King.\nOn this the White Rabbit blew three blasts on the trumpet, and then\nunrolled the parchment scroll, and read as follows:—\n\"The Queen of Hearts, she made some tarts,\nAll on a summer day:\nThe Knave of Hearts, he stole those tarts,\nAnd took them quite away!\"",
      "length": 300,
      "num_lines": 7,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "King Of Hearts",
          "role": "Commands the proceedings",
          "importance": 0.9,
          "emotion": "Authoritative",
          "sentiment": 0.5,
          "quote": "Herald, read the accusation!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Reads the accusation",
          "importance": 0.7,
          "emotion": "Nervous",
          "sentiment": 0.2,
          "quote": "No quote available",
          "fake_quote": "I hope I don't mess this up!",
          "importance_rank": 3
        },
        {
          "name": "Queen Of Hearts",
          "role": "Accused of wrongdoing",
          "importance": 0.8,
          "emotion": "Indignant",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "How dare they accuse me!",
          "importance_rank": 2
        },
        {
          "name": "Knave Of Hearts",
          "role": "Accused of theft",
          "importance": 0.7,
          "emotion": "Defensive",
          "sentiment": -0.3,
          "quote": "No quote available",
          "fake_quote": "I didn't take anything!",
          "importance_rank": 4
        }
      ],
      "number": 4,
      "importance_rank": 3,
      "conflict_rank": 4
    },
    {
      "title": "Hatter's Testimony",
      "summary": "The Hatter is called as the first witness and struggles to answer.",
      "chapter": "CHAPTER XI.",
      "first_line": 60,
      "last_line": 130,
      "text": "The first witness was the Hatter. He came in with a teacup in one hand\nand a piece of bread-and-butter in the other. \"I beg pardon, your\nMajesty,\" he began, \"for bringing these in: but I hadn't quite finished\nmy tea when I was sent for.\"\n\"You ought to have finished,\" said the King. \"When did you begin?\"\nThe Hatter looked at the March Hare, who had followed him into the\ncourt, arm-in-arm with the Dormouse. \"Fourteenth of March, I _think_ it\nwas,\" he said.\n\"Fifteenth,\" said the March Hare.\n\"Sixteenth,\" added the Dormouse.\n\"Write that down,\" the King said to the jury, and the jury eagerly\nwrote down all three dates on their slates, and then added them up, and\nreduced the answer to shillings and pence.\n\"Take off your hat,\" the King said to the Hatter.\n\"It isn't mine,\" said the Hatter.\n\"_Stolen!_\" the King exclaimed, turning to the jury, who instantly made\na memorandum of the fact.\n\"I keep them to sell,\" the Hatter added as an explanation; \"I've none\nof my own. I'm a hatter.\"\nHere the Queen put on her spectacles, and began staring at the Hatter,\nwho turned pale and fidgeted.\n\"Give your evidence,\" said the King; \"and don't be nervous, or I'll\nhave you executed on the spot.\"\nThis did not seem to encourage the witness at all: he kept shifting\nfrom one foot to the other, looking uneasily at the Queen, and in his\nconfusion he bit a large piece out of his teacup instead of the\nbread-and-butter.\nJust at this moment Alice felt a very curious sensation, which puzzled\nher a good deal until she made out what it was: she was beginning to\ngrow larger again, and she thought at first she would get up and leave\nthe court; but on second thoughts she decided to remain where she was\nas long as there was room for her.\n\"I wish you wouldn't squeeze so.\" said the Dormouse, who was sitting\nnext to her. \"I can hardly breathe.\"\n\"I can't help it,\" said Alice very meekly: \"I'm growing.\"\n\"You've no right to grow _here_,\" said the Dormouse.\n\"Don't talk nonsense,\" said Alice more boldly: \"you know you're growing\ntoo.\"\n\"Yes, but _I_ grow at a reasonable pace,\" said the Dormouse: \"not in\nthat ridiculous fashion.\" And he got up very sulkily and crossed over\nto the other side of the court.\nAll this time the Queen had never left off staring at the Hatter, and,\njust as the Dormouse crossed the court, she said to one of the officers\nof the court, \"Bring me the list of the singers in the last concert!\"\non which the wretched Hatter trembled so, that he shook both his shoes\noff.\n\"Give your evidence,\" the King repeated angrily, \"or I'll have you\nexecuted, whether you're nervous or not.\"\n\"I'm a poor man, your Majesty,\" the Hatter began, in a trembling voice,\n\"—and I hadn't begun my tea—not above a week or so—and what with the\nbread-and-butter getting so thin—and the twinkling of the tea—\"\n\"The twinkling of the _what?_\" said the King.\n\"It _began_ with the tea,\" the Hatter replied.\n\"Of course twinkling begins with a T!\" said the King sharply. \"Do you\ntake me for a dunce? Go on!\"\n\"I'm a poor man,\" the Hatter went on, \"and most things twinkled after\nthat—only the March Hare said—\"\n\"I didn't!\" the March Hare interrupted in a great hurry.\n\"You did!\" said the Hatter.\n\"I deny it!\" said the March Hare.\n\"He denies it,\" said the King: \"leave out that part.\"\n\"Well, at any rate, the Dormouse said—\" the Hatter went on, looking\nanxiously round to see if he would deny it too: but the Dormouse denied\nnothing, being fast asleep.\n\"After that,\" continued the Hatter, \"I cut some more bread-and-butter—\"\n\"But what did the Dormouse say?\" one of the jury asked.\n\"That I can't remember,\" said the Hatter.\n\"You _must_ remember,\" remarked the King, \"or I'll have you executed.\"\nThe miserable Hatter dropped his teacup and bread-and-butter, and went\ndown on one knee. \"I'm a poor man, your Majesty,\" he began.\n\"You're a _very_ poor _speaker_,\" said the King.",
      "length": 3847,
      "num_lines": 71,
      "location": "King's Court",
      "importance": 0.9,
      "conflict": 0.8,
      "characters": [
        {
          "name": "Hatter",
          "role": "Witness in the court, nervous and confused",
          "importance": 1.0,
          "emotion": "Nervous and anxious",
          "sentiment": -0.5,
          "quote": "I'm a poor man, your Majesty.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "King Of Hearts",
          "role": "Authority figure, demanding answers",
          "importance": 1.0,
          "emotion": "Impatient and authoritative",
          "sentiment": -0.7,
          "quote": "Give your evidence, or I'll have you executed, whether you're nervous or not.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "March Hare",
          "role": "Witness, interjecting and denying accusations",
          "importance": 0.7,
          "emotion": "Defensive and hurried",
          "sentiment": -0.3,
          "quote": "I didn't!",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Dormouse",
          "role": "Passive witness, sleepy and sulky",
          "importance": 0.5,
          "emotion": "Sleepy and annoyed",
          "sentiment": -0.2,
          "quote": "I can hardly breathe.",
          "fake_quote": "",
          "importance_rank": 5
        },
        {
          "name": "Queen Of Hearts",
          "role": "Observing and intimidating presence",
          "importance": 0.6,
          "emotion": "Intimidating and focused",
          "sentiment": -0.6,
          "quote": "Bring me the list of the singers in the last concert!",
          "fake_quote": "",
          "importance_rank": 4
        }
      ],
      "number": 5,
      "importance_rank": 1,
      "conflict_rank": 1
    },
    {
      "title": "Guinea-Pig Incident",
      "summary": "A guinea-pig cheers and is suppressed, amusing Alice.",
      "chapter": "CHAPTER XI.",
      "first_line": 131,
      "last_line": 139,
      "text": "Here one of the guinea-pigs cheered, and was immediately suppressed by\nthe officers of the court. (As that is rather a hard word, I will just\nexplain to you how it was done. They had a large canvas bag, which tied\nup at the mouth with strings: into this they slipped the guinea-pig,\nhead first, and then sat upon it.)\n\"I'm glad I've seen that done,\" thought Alice. \"I've so often read in\nthe newspapers, at the end of trials, \"There was some attempts at\napplause, which was immediately suppressed by the officers of the\ncourt,\" and I never understood what it meant till now.\"",
      "length": 575,
      "num_lines": 9,
      "location": "King's Court",
      "importance": 0.7,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Observer of the court proceedings",
          "importance": 0.8,
          "emotion": "Curious and amused",
          "sentiment": 0.5,
          "quote": "I'm glad I've seen that done.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Guinea-pig",
          "role": "Victim of suppression",
          "importance": 0.6,
          "emotion": "Surprised and silenced",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "I just wanted to cheer!",
          "importance_rank": 2
        },
        {
          "name": "Officers Of The Court",
          "role": "Suppressors of applause",
          "importance": 0.5,
          "emotion": "Authoritative and stern",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "Silence! We will not tolerate applause!",
          "importance_rank": 3
        }
      ],
      "number": 6,
      "importance_rank": 8,
      "conflict_rank": 5
    },
    {
      "title": "Next Witness Called",
      "summary": "The Duchess's cook enters, causing chaos with pepper.",
      "chapter": "CHAPTER XI.",
      "first_line": 155,
      "last_line": 172,
      "text": "The next witness was the Duchess's cook. She carried the pepper-box in\nher hand, and Alice guessed who it was, even before she got into the\ncourt, by the way the people near the door began sneezing all at once.\n\"Give your evidence,\" said the King.\n\"Shan't,\" said the cook.\nThe King looked anxiously at the White Rabbit, who said in a low voice,\n\"Your Majesty must cross-examine _this_ witness.\"\n\"Well, if I must, I must,\" the King said, with a melancholy air, and,\nafter folding his arms and frowning at the cook till his eyes were\nnearly out of sight, he said in a deep voice, \"What are tarts made of?\"\n\"Pepper, mostly,\" said the cook.\n\"Treacle,\" said a sleepy voice behind her.\n\"Collar that Dormouse,\" the Queen shrieked out. \"Behead that Dormouse!\nTurn that Dormouse out of court! Suppress him! Pinch him! Off with his\nwhiskers!\"\nFor some minutes the whole court was in confusion, getting the Dormouse\nturned out, and, by the time they had settled down again, the cook had\ndisappeared.",
      "length": 988,
      "num_lines": 18,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.7,
      "characters": [
        {
          "name": "Cook",
          "role": "Refuses to give evidence",
          "importance": 0.8,
          "emotion": "Defiant and dismissive",
          "sentiment": -0.5,
          "quote": "\"Shan't,\" said the cook.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "King Of Hearts",
          "role": "Attempts to question the cook",
          "importance": 0.6,
          "emotion": "Melancholy and anxious",
          "sentiment": -0.3,
          "quote": "\"Well, if I must, I must,\" the King said, with a melancholy air.",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "White Rabbit",
          "role": "Advises the King to cross-examine",
          "importance": 0.5,
          "emotion": "Supportive but cautious",
          "sentiment": 0.2,
          "quote": "\"Your Majesty must cross-examine _this_ witness.\"",
          "fake_quote": "",
          "importance_rank": 4
        },
        {
          "name": "Queen Of Hearts",
          "role": "Commands chaos in court",
          "importance": 0.7,
          "emotion": "Angry and commanding",
          "sentiment": -0.8,
          "quote": "\"Behead that Dormouse!\" the Queen shrieked out.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Dormouse",
          "role": "Innocently interrupts the proceedings",
          "importance": 0.4,
          "emotion": "Sleepy and confused",
          "sentiment": 0.0,
          "quote": "\"Treacle,\" said a sleepy voice behind her.",
          "fake_quote": "",
          "importance_rank": 5
        }
      ],
      "number": 7,
      "importance_rank": 4,
      "conflict_rank": 2
    },
    {
      "title": "Alice's Surprise",
      "summary": "Alice is shocked to hear her name called as the next witness.",
      "chapter": "CHAPTER XI.",
      "first_line": 177,
      "last_line": 181,
      "text": "Alice watched the White Rabbit as he fumbled over the list, feeling\nvery curious to see what the next witness would be like, \"—for they\nhaven't got much evidence _yet_,\" she said to herself. Imagine her\nsurprise, when the White Rabbit read out, at the top of his shrill\nlittle voice, the name \"Alice!\"",
      "length": 301,
      "num_lines": 5,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Curious observer of the trial",
          "importance": 0.9,
          "emotion": "Surprised and curious",
          "sentiment": 0.5,
          "quote": "Imagine her surprise, when the White Rabbit read out, at the top of his shrill little voice, the name \"Alice!\"",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Announcer of witnesses",
          "importance": 0.7,
          "emotion": "Nervous and flustered",
          "sentiment": -0.2,
          "quote": "No quote available",
          "fake_quote": "I hope I don't mess this up!",
          "importance_rank": 2
        }
      ],
      "number": 8,
      "importance_rank": 5,
      "conflict_rank": 6
    },
    {
      "title": "Alice Upsets the Jury",
      "summary": "Alice accidentally tips over the jury-box, causing chaos.",
      "chapter": "CHAPTER XII.",
      "first_line": 2,
      "last_line": 27,
      "text": "\"Here!\" cried Alice, quite forgetting in the flurry of the moment how\nlarge she had grown in the last few minutes, and she jumped up in such\na hurry that she tipped over the jury-box with the edge of her skirt,\nupsetting all the jurymen on to the heads of the crowd below, and there\nthey lay sprawling about, reminding her very much of a globe of\ngoldfish she had accidentally upset the week before.\n\"Oh, I _beg_ your pardon!\" she exclaimed in a tone of great dismay, and\nbegan picking them up again as quickly as she could, for the accident\nof the goldfish kept running in her head, and she had a vague sort of\nidea that they must be collected at once and put back into the\njury-box, or they would die.\n\"The trial cannot proceed,\" said the King in a very grave voice, \"until\nall the jurymen are back in their proper places—_all_,\" he repeated\nwith great emphasis, looking hard at Alice as he said so.\nAlice looked at the jury-box, and saw that, in her haste, she had put\nthe Lizard in head downwards, and the poor little thing was waving its\ntail about in a melancholy way, being quite unable to move. She soon\ngot it out again, and put it right; \"not that it signifies much,\" she\nsaid to herself; \"I should think it would be _quite_ as much use in the\ntrial one way up as the other.\"\nAs soon as the jury had a little recovered from the shock of being\nupset, and their slates and pencils had been found and handed back to\nthem, they set to work very diligently to write out a history of the\naccident, all except the Lizard, who seemed too much overcome to do\nanything but sit with its mouth open, gazing up into the roof of the\ncourt.",
      "length": 1635,
      "num_lines": 26,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "Alice",
          "role": "Accidentally disrupts the trial",
          "importance": 1.0,
          "emotion": "Dismayed and hurried",
          "sentiment": -0.5,
          "quote": "Oh, I _beg_ your pardon!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "King Of Hearts",
          "role": "Maintains order in the trial",
          "importance": 0.8,
          "emotion": "Serious and authoritative",
          "sentiment": 0.5,
          "quote": "The trial cannot proceed until all the jurymen are back in their proper places—_all_",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Lizard",
          "role": "Victim of Alice's accident",
          "importance": 0.5,
          "emotion": "Overcome and helpless",
          "sentiment": -0.5,
          "quote": "No quote available",
          "fake_quote": "I wish I could move again.",
          "importance_rank": 3
        }
      ],
      "number": 1,
      "importance_rank": 2,
      "conflict_rank": 4
    },
    {
      "title": "The King's Inquiry",
      "summary": "The King questions Alice about her knowledge of the case.",
      "chapter": "CHAPTER XII.",
      "first_line": 28,
      "last_line": 41,
      "text": "\"What do you know about this business?\" the King said to Alice.\n\"Nothing,\" said Alice.\n\"Nothing _whatever?_\" persisted the King.\n\"Nothing whatever,\" said Alice.\n\"That's very important,\" the King said, turning to the jury. They were\njust beginning to write this down on their slates, when the White\nRabbit interrupted: \"_Un_important, your Majesty means, of course,\" he\nsaid in a very respectful tone, but frowning and making faces at him as\nhe spoke.\n\"_Un_important, of course, I meant,\" the King hastily said, and went on\nto himself in an undertone,\n\"important—unimportant—unimportant—important—\" as if he were trying\nwhich word sounded best.\nSome of the jury wrote it down \"important,\" and some \"unimportant.\"",
      "length": 711,
      "num_lines": 14,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "King Of Hearts",
          "role": "Interrogating Alice about her knowledge",
          "importance": 1.0,
          "emotion": "Confused and anxious",
          "sentiment": -0.5,
          "quote": "That's very important",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Responding to the King's questions",
          "importance": 1.0,
          "emotion": "Defensive and straightforward",
          "sentiment": 0.5,
          "quote": "Nothing whatever",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "White Rabbit",
          "role": "Clarifying the King's statement",
          "importance": 0.5,
          "emotion": "Respectful yet critical",
          "sentiment": 0.2,
          "quote": "Unimportant, your Majesty means, of course",
          "fake_quote": "",
          "importance_rank": 3
        }
      ],
      "number": 2,
      "importance_rank": 3,
      "conflict_rank": 5
    },
    {
      "title": "The Rabbit's Discovery",
      "summary": "The White Rabbit presents a mysterious paper to the court.",
      "chapter": "CHAPTER XII.",
      "first_line": 57,
      "last_line": 71,
      "text": "\"There's more evidence to come yet, please your Majesty,\" said the\nWhite Rabbit, jumping up in a great hurry; \"this paper has just been\npicked up.\"\n\"What's in it?\" said the Queen.\n\"I haven't opened it yet,\" said the White Rabbit, \"but it seems to be a\nletter, written by the prisoner to—to somebody.\"\n\"It must have been that,\" said the King, \"unless it was written to\nnobody, which isn't usual, you know.\"\n\"Who is it directed to?\" said one of the jurymen.\n\"It isn't directed at all,\" said the White Rabbit; \"in fact, there's\nnothing written on the _outside_.\" He unfolded the paper as he spoke,\nand added \"It isn't a letter, after all: it's a set of verses.\"\n\"Are they in the prisoner's handwriting?\" asked another of the jurymen.\n\"No, they're not,\" said the White Rabbit, \"and that's the queerest\nthing about it.\" (The jury all looked puzzled.)",
      "length": 845,
      "num_lines": 15,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "White Rabbit",
          "role": "Brings evidence to the court",
          "importance": 0.9,
          "emotion": "Anxious and hurried",
          "sentiment": 0.2,
          "quote": "There's more evidence to come yet, please your Majesty.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Queen Of Hearts",
          "role": "Inquisitive and authoritative",
          "importance": 0.7,
          "emotion": "Impatient and demanding",
          "sentiment": -0.3,
          "quote": "What's in it?",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "King Of Hearts",
          "role": "Clarifies the situation",
          "importance": 0.6,
          "emotion": "Confused but trying to be logical",
          "sentiment": 0.0,
          "quote": "It must have been that, unless it was written to nobody, which isn't usual, you know.",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Juryman",
          "role": "Questions the evidence",
          "importance": 0.5,
          "emotion": "Curious and skeptical",
          "sentiment": 0.0,
          "quote": "Who is it directed to?",
          "fake_quote": "",
          "importance_rank": 4
        },
        {
          "name": "Another Juryman",
          "role": "Seeks clarification",
          "importance": 0.5,
          "emotion": "Puzzled",
          "sentiment": 0.0,
          "quote": "Are they in the prisoner's handwriting?",
          "fake_quote": "",
          "importance_rank": 5
        }
      ],
      "number": 3,
      "importance_rank": 4,
      "conflict_rank": 6
    },
    {
      "title": "The Knave's Defense",
      "summary": "The Knave claims he didn't write the verses, causing confusion.",
      "chapter": "CHAPTER XII.",
      "first_line": 74,
      "last_line": 80,
      "text": "\"Please your Majesty,\" said the Knave, \"I didn't write it, and they\ncan't prove I did: there's no name signed at the end.\"\n\"If you didn't sign it,\" said the King, \"that only makes the matter\nworse. You _must_ have meant some mischief, or else you'd have signed\nyour name like an honest man.\"\nThere was a general clapping of hands at this: it was the first really\nclever thing the King had said that day.",
      "length": 403,
      "num_lines": 7,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "Knave Of Hearts",
          "role": "Defending himself against accusations",
          "importance": 0.9,
          "emotion": "Defensive and anxious",
          "sentiment": -0.5,
          "quote": "Please your Majesty, I didn't write it, and they can't prove I did: there's no name signed at the end.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "King Of Hearts",
          "role": "Accusing the Knave of wrongdoing",
          "importance": 0.9,
          "emotion": "Assertive and critical",
          "sentiment": -0.3,
          "quote": "If you didn't sign it, that only makes the matter worse. You must have meant some mischief, or else you'd have signed your name like an honest man.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 4,
      "importance_rank": 5,
      "conflict_rank": 2
    },
    {
      "title": "Alice Challenges the Evidence",
      "summary": "Alice disputes the meaning of the verses presented.",
      "chapter": "CHAPTER XII.",
      "first_line": 114,
      "last_line": 122,
      "text": "\"That's the most important piece of evidence we've heard yet,\" said the\nKing, rubbing his hands; \"so now let the jury—\"\n\"If any one of them can explain it,\" said Alice, (she had grown so\nlarge in the last few minutes that she wasn't a bit afraid of\ninterrupting him,) \"I'll give him sixpence. _I_ don't believe there's\nan atom of meaning in it.\"\nThe jury all wrote down on their slates, \"_She_ doesn't believe there's\nan atom of meaning in it,\" but none of them attempted to explain the\npaper.",
      "length": 493,
      "num_lines": 9,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.5,
      "characters": [
        {
          "name": "King Of Hearts",
          "role": "Presiding over the jury's decision",
          "importance": 0.7,
          "emotion": "Confident and authoritative",
          "sentiment": 0.5,
          "quote": "That's the most important piece of evidence we've heard yet.",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Alice",
          "role": "Challenging the jury's understanding",
          "importance": 0.8,
          "emotion": "Defiant and skeptical",
          "sentiment": -0.5,
          "quote": "I don't believe there's an atom of meaning in it.",
          "fake_quote": "",
          "importance_rank": 1
        }
      ],
      "number": 5,
      "importance_rank": 6,
      "conflict_rank": 7
    },
    {
      "title": "The King's Interpretation",
      "summary": "The King attempts to make sense of the verses, leading to absurd conclusions.",
      "chapter": "CHAPTER XII.",
      "first_line": 125,
      "last_line": 146,
      "text": "know,\" he went on, spreading out the verses on his knee, and looking at\nthem with one eye; \"I seem to see some meaning in them, after all.\n\"—_said I could not swim_—\" you can't swim, can you?\" he added, turning\nto the Knave.\nThe Knave shook his head sadly. \"Do I look like it?\" he said. (Which he\ncertainly did _not_, being made entirely of cardboard.)\n\"All right, so far,\" said the King, and he went on muttering over the\nverses to himself: \"'_We know it to be true_—' that's the jury, of\ncourse—'_I gave her one, they gave him two_—' why, that must be what he\ndid with the tarts, you know—\"\n\"But, it goes on '_they all returned from him to you_,'\" said Alice.\n\"Why, there they are!\" said the King triumphantly, pointing to the\ntarts on the table. \"Nothing can be clearer than _that_. Then\nagain—'_before she had this fit_—' you never had fits, my dear, I\nthink?\" he said to the Queen.\n\"Never!\" said the Queen furiously, throwing an inkstand at the Lizard\nas she spoke. (The unfortunate little Bill had left off writing on his\nslate with one finger, as he found it made no mark; but he now hastily\nbegan again, using the ink, that was trickling down his face, as long\nas it lasted.)\n\"Then the words don't _fit_ you,\" said the King, looking round the\ncourt with a smile. There was a dead silence.",
      "length": 1296,
      "num_lines": 22,
      "location": "King's Court",
      "importance": 0.8,
      "conflict": 0.6,
      "characters": [
        {
          "name": "King Of Hearts",
          "role": "Interpreting verses and questioning others",
          "importance": 0.9,
          "emotion": "Confident and somewhat amused",
          "sentiment": 0.7,
          "quote": "Nothing can be clearer than _that_.",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Knave Of Hearts",
          "role": "Responding to the King's questions",
          "importance": 0.6,
          "emotion": "Sad and resigned",
          "sentiment": -0.5,
          "quote": "Do I look like it?",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Queen Of Hearts",
          "role": "Reacting angrily to the situation",
          "importance": 0.8,
          "emotion": "Furious and aggressive",
          "sentiment": -0.8,
          "quote": "Never!",
          "fake_quote": "",
          "importance_rank": 2
        },
        {
          "name": "Bill",
          "role": "Attempting to write amidst chaos",
          "importance": 0.4,
          "emotion": "Frustrated and confused",
          "sentiment": -0.3,
          "quote": "No quote available",
          "fake_quote": "I just want to finish my writing!",
          "importance_rank": 4
        }
      ],
      "number": 6,
      "importance_rank": 7,
      "conflict_rank": 3
    },
    {
      "title": "The Queen's Ultimatum",
      "summary": "The Queen demands a sentence before the verdict, leading to Alice's defiance.",
      "chapter": "CHAPTER XII.",
      "first_line": 150,
      "last_line": 158,
      "text": "\"No, no!\" said the Queen. \"Sentence first—verdict afterwards.\"\n\"Stuff and nonsense!\" said Alice loudly. \"The idea of having the\nsentence first!\"\n\"Hold your tongue!\" said the Queen, turning purple.\n\"I won't!\" said Alice.\n\"Off with her head!\" the Queen shouted at the top of her voice. Nobody\nmoved.\n\"Who cares for you?\" said Alice, (she had grown to her full size by\nthis time.) \"You're nothing but a pack of cards!\"",
      "length": 415,
      "num_lines": 9,
      "location": "King's Court",
      "importance": 0.9,
      "conflict": 0.8,
      "characters": [
        {
          "name": "Queen Of Hearts",
          "role": "Commands the court and demands Alice's execution",
          "importance": 1.0,
          "emotion": "Angry and authoritative",
          "sentiment": -1.0,
          "quote": "Off with her head!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice",
          "role": "Defies the Queen and challenges her authority",
          "importance": 1.0,
          "emotion": "Defiant and bold",
          "sentiment": 1.0,
          "quote": "Who cares for you? You're nothing but a pack of cards!",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 7,
      "importance_rank": 1,
      "conflict_rank": 1
    },
    {
      "title": "Alice Awakens",
      "summary": "Alice wakes from her dream, recounting her adventures to her sister.",
      "chapter": "CHAPTER XII.",
      "first_line": 161,
      "last_line": 175,
      "text": "tried to beat them off, and found herself lying on the bank, with her\nhead in the lap of her sister, who was gently brushing away some dead\nleaves that had fluttered down from the trees upon her face.\n\"Wake up, Alice dear!\" said her sister; \"Why, what a long sleep you've\nhad!\"\n\"Oh, I've had such a curious dream!\" said Alice, and she told her\nsister, as well as she could remember them, all these strange\nAdventures of hers that you have just been reading about; and when she\nhad finished, her sister kissed her, and said, \"It _was_ a curious\ndream, dear, certainly: but now run in to your tea; it's getting late.\"\nSo Alice got up and ran off, thinking while she ran, as well she might,\nwhat a wonderful dream it had been.\nBut her sister sat still just as she left her, leaning her head on her\nhand, watching the setting sun, and thinking of little Alice and all\nher wonderful Adventures, till she too began dreaming after a fashion,",
      "length": 934,
      "num_lines": 15,
      "location": "Riverbank",
      "importance": 0.8,
      "conflict": 0.1,
      "characters": [
        {
          "name": "Alice",
          "role": "Describes her curious dream",
          "importance": 0.9,
          "emotion": "Curious and reflective",
          "sentiment": 0.5,
          "quote": "Oh, I've had such a curious dream!",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "Alice's Sister",
          "role": "Listens and encourages Alice",
          "importance": 0.7,
          "emotion": "Supportive and contemplative",
          "sentiment": 0.6,
          "quote": "It _was_ a curious dream, dear, certainly: but now run in to your tea; it's getting late.",
          "fake_quote": "",
          "importance_rank": 2
        }
      ],
      "number": 8,
      "importance_rank": 8,
      "conflict_rank": 8
    },
    {
      "title": "Sister's Reflection",
      "summary": "Alice's sister reflects on Alice's adventures as she dreams.",
      "chapter": "CHAPTER XII.",
      "first_line": 176,
      "last_line": 212,
      "text": "and this was her dream:—\nFirst, she dreamed of little Alice herself, and once again the tiny\nhands were clasped upon her knee, and the bright eager eyes were\nlooking up into hers—she could hear the very tones of her voice, and\nsee that queer little toss of her head to keep back the wandering hair\nthat _would_ always get into her eyes—and still as she listened, or\nseemed to listen, the whole place around her became alive with the\nstrange creatures of her little sister's dream.\nThe long grass rustled at her feet as the White Rabbit hurried by—the\nfrightened Mouse splashed his way through the neighbouring pool—she\ncould hear the rattle of the teacups as the March Hare and his friends\nshared their never-ending meal, and the shrill voice of the Queen\nordering off her unfortunate guests to execution—once more the pig-baby\nwas sneezing on the Duchess's knee, while plates and dishes crashed\naround it—once more the shriek of the Gryphon, the squeaking of the\nLizard's slate-pencil, and the choking of the suppressed guinea-pigs,\nfilled the air, mixed up with the distant sobs of the miserable Mock\nTurtle.\nSo she sat on, with closed eyes, and half believed herself in\nWonderland, though she knew she had but to open them again, and all\nwould change to dull reality—the grass would be only rustling in the\nwind, and the pool rippling to the waving of the reeds—the rattling\nteacups would change to tinkling sheep-bells, and the Queen's shrill\ncries to the voice of the shepherd boy—and the sneeze of the baby, the\nshriek of the Gryphon, and all the other queer noises, would change\n(she knew) to the confused clamour of the busy farm-yard—while the\nlowing of the cattle in the distance would take the place of the Mock\nTurtle's heavy sobs.\nLastly, she pictured to herself how this same little sister of hers\nwould, in the after-time, be herself a grown woman; and how she would\nkeep, through all her riper years, the simple and loving heart of her\nchildhood: and how she would gather about her other little children,\nand make _their_ eyes bright and eager with many a strange tale,\nperhaps even with the dream of Wonderland of long ago: and how she\nwould feel with all their simple sorrows, and find a pleasure in all\ntheir simple joys, remembering her own child-life, and the happy summer\ndays.",
      "length": 2299,
      "num_lines": 37,
      "location": "Wonderland",
      "importance": 0.8,
      "conflict": 0.1,
      "characters": [
        {
          "name": "Alice",
          "role": "Dreaming of her childhood",
          "importance": 1.0,
          "emotion": "Nostalgic and reflective",
          "sentiment": 0.7,
          "quote": "she could hear the very tones of her voice, and see that queer little toss of her head to keep back the wandering hair that would always get into her eyes",
          "fake_quote": "",
          "importance_rank": 1
        },
        {
          "name": "White Rabbit",
          "role": "Symbol of her childhood imagination",
          "importance": 0.5,
          "emotion": "Urgent and busy",
          "sentiment": 0.2,
          "quote": "No quote available",
          "fake_quote": "I must hurry, or I'll be late!",
          "importance_rank": 2
        },
        {
          "name": "Queen Of Hearts",
          "role": "Embodiment of chaos in her dreams",
          "importance": 0.5,
          "emotion": "Authoritative and demanding",
          "sentiment": -0.5,
          "quote": "the shrill voice of the Queen ordering off her unfortunate guests to execution",
          "fake_quote": "",
          "importance_rank": 3
        },
        {
          "name": "Mock Turtle",
          "role": "Representation of sadness in her dreams",
          "importance": 0.5,
          "emotion": "Mournful and sorrowful",
          "sentiment": -0.6,
          "quote": "the distant sobs of the miserable Mock Turtle",
          "fake_quote": "",
          "importance_rank": 4
        },
        {
          "name": "March Hare",
          "role": "Part of the whimsical chaos",
          "importance": 0.4,
          "emotion": "Carefree and chaotic",
          "sentiment": 0.1,
          "quote": "the rattle of the teacups as the March Hare and his friends shared their never-ending meal",
          "fake_quote": "",
          "importance_rank": 5
        }
      ],
      "number": 9,
      "importance_rank": 9,
      "conflict_rank": 9
    }
  ],
  "characters": [
    {
      "name": "Alice",
      "quote": "\"and what is the use of a book,\" thought Alice \"without pictures or conversations?\"",
      "group": "Main Characters",
      "color": "rgb(255, 182, 193)",
      "explanation": "Alice is often seen as curious and adventurous, which is represented by a soft pink that embodies her innocence and wonder."
    },
    {
      "name": "White Rabbit",
      "quote": "\"Oh dear! Oh dear! I shall be late!\"",
      "group": "Main Characters",
      "color": "rgb(255, 228, 196)",
      "explanation": "The White Rabbit's anxious and hurried nature is reflected in a light peach color, symbolizing his frantic energy."
    },
    {
      "name": "Dinah",
      "quote": "Dinah'll miss me very much to-night, I should think!",
      "group": "Main Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Mabel",
      "quote": "I'm sure I can't be Mabel, for I know all sorts of things, and she, oh! she knows such a very little!",
      "group": "Main Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Mouse",
      "quote": "\"Not like cats!\" cried the Mouse, in a shrill, passionate voice. \"Would _you_ like cats if you were me?\"",
      "group": "Talking Animals",
      "color": "rgb(169, 169, 169)",
      "explanation": "The Mouse's timid and cautious demeanor is represented by a soft gray, embodying its small and unassuming nature."
    },
    {
      "name": "Dodo",
      "quote": "\"I move that the meeting adjourn, for the immediate adoption of more energetic remedies—\"",
      "group": "Talking Animals",
      "color": "rgb(255, 255, 0)",
      "explanation": "The Dodo's quirky and humorous character is represented by a bright yellow, symbolizing its cheerful absurdity."
    },
    {
      "name": "Duck",
      "quote": "No quote available",
      "group": "Talking Animals",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Lory",
      "quote": "\"I am older than you, and must know better;\"",
      "group": "Talking Animals",
      "color": "rgb(255, 140, 0)",
      "explanation": "The Lory's lively and colorful personality is represented by a bright orange, reflecting its vibrant nature."
    },
    {
      "name": "Eaglet",
      "quote": "No quote available",
      "group": "Talking Animals",
      "color": "rgb(255, 255, 224)",
      "explanation": "The Eaglet's youthful and innocent nature is represented by a pale yellow, indicating its naivety."
    },
    {
      "name": "Magpie",
      "quote": "No quote available",
      "group": "Talking Animals",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Canary",
      "quote": "No quote available",
      "group": "Talking Animals",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Magic Bottle",
      "quote": "No quote available",
      "group": "Inanimate Objects",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Bill",
      "quote": "\"Oh! So Bill's got to come down the chimney, has he?\" said Alice to herself.",
      "group": "Talking Animals",
      "color": "rgb(0, 255, 127)",
      "explanation": "Bill's hardworking and somewhat clumsy nature is represented by a bright green, symbolizing his earthy character."
    },
    {
      "name": "Enormous Puppy",
      "quote": "\"Poor little thing!\" said Alice, in a coaxing tone.",
      "group": "Talking Animals",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Blue Caterpillar",
      "quote": "\"Who are _you?_\" said the Caterpillar.",
      "group": "Talking Animals",
      "color": "rgb(0, 0, 255)",
      "explanation": "The Blue Caterpillar's calm and contemplative demeanor is represented by a deep blue, reflecting its wisdom."
    },
    {
      "name": "Pigeon",
      "quote": "\"Serpent!\" screamed the Pigeon.",
      "group": "Talking Animals",
      "color": "rgb(192, 192, 192)",
      "explanation": "The Pigeon's cautious and protective nature is represented by a light gray, symbolizing its wariness."
    },
    {
      "name": "Fish-footman",
      "quote": "\"For the Duchess. An invitation from the Queen to play croquet.\"",
      "group": "Talking Animals",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Frog-footman",
      "quote": "\"From the Queen. An invitation for the Duchess to play croquet.\"",
      "group": "Talking Animals",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Duchess",
      "quote": "\"If everybody minded their own business, the world would go round a deal faster than it does.\"",
      "group": "Talking Animals",
      "color": "rgb(255, 105, 180)",
      "explanation": "The Duchess's chaotic and whimsical character is represented by a vibrant pink, reflecting her unpredictable nature."
    },
    {
      "name": "Cook",
      "quote": "No quote available",
      "group": "Talking Animals",
      "color": "rgb(139, 69, 19)",
      "explanation": "The Cook's chaotic and frenzied character is represented by a brown, indicating her grounded yet messy nature."
    },
    {
      "name": "Baby",
      "quote": "the baby, it was sneezing and howling alternately without a moment's pause.",
      "group": "Main Characters",
      "color": "rgb(240, 230, 140)",
      "explanation": "The Baby's innocent and helpless nature is represented by a soft light yellow, symbolizing its vulnerability."
    },
    {
      "name": "Cheshire Cat",
      "quote": "Oh, you're sure to do that, if you only walk long enough.",
      "group": "Main Characters",
      "color": "rgb(148, 0, 211)",
      "explanation": "The Cheshire Cat's enigmatic and playful personality is captured in a vibrant violet, symbolizing its mysterious nature."
    },
    {
      "name": "Hatter",
      "quote": "I'm a poor man, your Majesty.",
      "group": "Main Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "March Hare",
      "quote": "It was the _best_ butter, you know.",
      "group": "Main Characters",
      "color": "rgb(255, 20, 147)",
      "explanation": "The March Hare's eccentric and lively personality is represented by a bright magenta, reflecting its whimsical nature."
    },
    {
      "name": "Dormouse",
      "quote": "I can hardly breathe.",
      "group": "Main Characters",
      "color": "rgb(160, 82, 45)",
      "explanation": "The Dormouse's sleepy and passive demeanor is represented by a warm brown, symbolizing its lethargy."
    },
    {
      "name": "Five",
      "quote": "I couldn't help it, said Five, in a sulky tone; Seven jogged my elbow.",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Seven",
      "quote": "That's right, Five! Always lay the blame on others!",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Two",
      "quote": "Why the fact is, you see, Miss, this here ought to have been a red rose-tree, and we put a white one in by mistake; and if the Queen was to find it out, we should all have our heads cut off, you know.",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Knave Of Hearts",
      "quote": "Please your Majesty, I didn't write it, and they can't prove I did: there's no name signed at the end.",
      "group": "Court Characters",
      "color": "rgb(255, 215, 0)",
      "explanation": "The Knave's mischievous and somewhat guilty nature is represented by a bright gold, indicating his trickster qualities."
    },
    {
      "name": "King Of Hearts",
      "quote": "Off with her head!",
      "group": "Court Characters",
      "color": "rgb(255, 165, 0)",
      "explanation": "The King, often overshadowed by the Queen, is represented by a warm orange, indicating his more subdued yet supportive nature."
    },
    {
      "name": "Queen Of Hearts",
      "quote": "Who is this?",
      "group": "Court Characters",
      "color": "rgb(255, 0, 0)",
      "explanation": "The Queen's fierce and commanding personality is represented by a bold red, signifying her authority and temper."
    },
    {
      "name": "Executioner",
      "quote": "No quote available",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Gryphon",
      "quote": "What fun!",
      "group": "Main Characters",
      "color": "rgb(128, 0, 128)",
      "explanation": "The Gryphon's mythical and majestic presence is captured in a regal purple, symbolizing its grandeur."
    },
    {
      "name": "Mock Turtle",
      "quote": "Once, I was a real Turtle.",
      "group": "Main Characters",
      "color": "rgb(0, 128, 0)",
      "explanation": "The Mock Turtle's melancholy and whimsical traits are represented by a deep green, symbolizing his connection to nature and sadness."
    },
    {
      "name": "Guinea-pig",
      "quote": "No quote available",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Officers Of The Court",
      "quote": "No quote available",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Lizard",
      "quote": "No quote available",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Juryman",
      "quote": "No quote available",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Another Juryman",
      "quote": "No quote available",
      "group": "Court Characters",
      "color": "",
      "explanation": ""
    },
    {
      "name": "Alice's Sister",
      "quote": "It _was_ a curious dream, dear, certainly: but now run in to your tea; it's getting late.",
      "group": "Main Characters",
      "color": "",
      "explanation": ""
    }
  ],
  "locations": [
    {
      "name": "Riverbank",
      "quote": "Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do.",
      "emoji": "🏞️"
    },
    {
      "name": "Rabbit-hole",
      "quote": "In another moment down went Alice after it, never once considering how in the world she was to get out again.",
      "emoji": "🐇"
    },
    {
      "name": "Hall",
      "quote": "Suddenly she came upon a little three-legged table, all made of solid glass; there was nothing on it except a tiny golden key.",
      "emoji": "🏛️"
    },
    {
      "name": "Wonderland",
      "quote": "Alice ventured to taste it, and finding it very nice, she very soon finished it off.",
      "emoji": "🌈"
    },
    {
      "name": "Alice's Room",
      "quote": "She found she had forgotten the little golden key, and when she went back to the table for it, she found she could not possibly reach it.",
      "emoji": "🛏️"
    },
    {
      "name": "Under The Table",
      "quote": "Soon her eye fell on a little glass box that was lying under the table: she opened it, and found in it a very small cake.",
      "emoji": "🍰"
    },
    {
      "name": "Pool Of Tears",
      "quote": "I wish I hadn't cried so much! said Alice, as she swam about, trying to find her way out.",
      "emoji": "💧"
    },
    {
      "name": "Clearing",
      "quote": "They were indeed a queer-looking party that assembled on the bank—the birds with draggled feathers, the animals with their fur clinging close to them, and all dripping wet, cross, and uncomfortable.",
      "emoji": "🌳"
    },
    {
      "name": "Rabbit's House",
      "quote": "He took me for his housemaid, she said to herself as she ran.",
      "emoji": "🏠"
    },
    {
      "name": "Wood",
      "quote": "The first thing I've got to do, said Alice to herself, as she wandered about in the wood, is to grow to my right size again.",
      "emoji": "🌲"
    },
    {
      "name": "Caterpillar's Garden",
      "quote": "There was a large mushroom growing near her, about the same height as herself.",
      "emoji": "🍄"
    },
    {
      "name": "Duchess's House",
      "quote": "The Duchess was sitting on a three-legged stool in the middle, nursing a baby; the cook was leaning over the fire, stirring a large cauldron which seemed to be full of soup.",
      "emoji": "🏡"
    },
    {
      "name": "Meadow",
      "quote": "Oh, you're sure to do that, said the Cat, if you only walk long enough.",
      "emoji": "🌼"
    },
    {
      "name": "House Of The March Hare",
      "quote": "She had not gone much farther before she came in sight of the house of the March Hare.",
      "emoji": "🏠"
    },
    {
      "name": "Queen's Garden",
      "quote": "Alice confronted the Queen amidst chaos, witnessing the gardeners' punishment.",
      "emoji": "🌹"
    },
    {
      "name": "King's Court",
      "quote": "Alice witnessed the chaotic court proceedings where the Knave is on trial.",
      "emoji": "⚖️"
    },
    {
      "name": "Path",
      "quote": "Alice was walking along a path when she encountered the Cheshire Cat.",
      "emoji": "🛤️"
    },
    {
      "name": "Alice's Kitchen",
      "quote": "Alice entered a chaotic kitchen with the Duchess and a cook.",
      "emoji": "🍳"
    },
    {
      "name": "Unknown Location",
      "quote": "Alice found herself in an unknown location, confused and lost.",
      "emoji": "❓"
    },
    {
      "name": "Ledge",
      "quote": "Alice stood on the ledge, contemplating her next move in Wonderland.",
      "emoji": "🪂"
    },
    {
      "name": "Mock Turtle's Area",
      "quote": "Alice met the Mock Turtle, who shared his melancholic tales.",
      "emoji": "🐢"
    },
    {
      "name": "Underwater",
      "quote": "Alice found herself underwater, swimming through her own tears.",
      "emoji": "🌊"
    },
    {
      "name": "Whimsical Scene",
      "quote": "Alice marveled at the whimsical scene unfolding before her eyes.",
      "emoji": "🎠"
    }
  ]
}
