{
  "title": "Alice's Adventures in Wonderland",
  "type": "Book",
  "author": "Lewis Carroll",
  "year": 1865,
  "url": "https://www.gutenberg.org/ebooks/11",
  "image": "https://m.media-amazon.com/images/I/71PdNDqqDzL._AC_UF1000,1000_QL80_.jpg",
  "scenes": [
    {
      "number": 1,
      "name": "Alice Spots the White Rabbit",
      "summary": "Alice notices a White Rabbit with pink eyes and decides to follow it down a rabbit-hole.",
      "ratings": {
        "importance": 4,
        "conflict": 0.2,
        "sentiment": 0.4
      },
      "location": "Rabbit Hole",
      "firstLine": "Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do: once or twice she had peeped into the book her sister was reading, but it had no pictures or conversations in it, 'and what is the use of a book,' thought Alice 'without pictures or conversations?'",
      "lastLine": "In another moment down went Alice after it, never once considering how in the world she was to get out again.",
      "numLines": 26,
      "chapter": "1",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Curious and Bored",
          "quote": "Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do.",
          "rating": 0.3
        },
        {
          "name": "White Rabbit",
          "importance": 2,
          "emotion": "Anxious and In a Hurry",
          "quote": "'Oh dear! Oh dear! I shall be late!'",
          "rating": -0.1
        }
      ]
    },
    {
      "number": 2,
      "name": "Falling Down the Rabbit-Hole",
      "summary": "Alice falls down the rabbit-hole and finds herself in a strange hallway with many locked doors.",
      "ratings": {
        "importance": 5,
        "conflict": 0.4,
        "sentiment": -0.1
      },
      "location": "Hall with Locked Doors",
      "firstLine": "The rabbit-hole went straight on like a tunnel for some way, and then dipped suddenly down, so suddenly that Alice had not a moment to think about stopping herself before she found herself falling down a very deep well.",
      "lastLine": "Alice opened the door and found that it led into a small passage, not much larger than a rat-hole: she knelt down and looked along the passage into the loveliest garden you ever saw.",
      "numLines": 45,
      "chapter": "1",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Amazed and Curious",
          "quote": "Either the well was very deep, or she fell very slowly, for she had plenty of time as she went down to look about her and to wonder what was going to happen next.",
          "rating": 0.2
        }
      ]
    },
    {
      "number": 3,
      "name": "Alice Drinks from the Bottle",
      "summary": "Alice drinks from a bottle labeled 'DRINK ME' and shrinks to a very small size.",
      "ratings": {
        "importance": 6,
        "conflict": 0.3,
        "sentiment": 0.1
      },
      "location": "Hall with Locked Doors",
      "firstLine": "There seemed to be no use in waiting by the little door, so she went back to the table, half hoping she might find another key on it, or at any rate a book of rules for shutting people up like telescopes: this time she found a little bottle on it, ('which certainly was not here before,' said Alice,) and round the neck of the bottle was a paper label, with the words 'DRINK ME,' beautifully printed on it in large letters.",
      "lastLine": "Finding that nothing more happened, she decided on going into the garden at once; but, alas for poor Alice! when she got to the door, she found she had forgotten the little golden key, and when she went back to the table for it, she found she could not possibly reach it: she could see it quite plainly through the glass, and she tried her best to climb up one of the legs of the table, but it was too slippery; and when she had tired herself out with trying, the poor little thing sat down and cried.",
      "numLines": 41,
      "chapter": "1",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Curious and Anxious",
          "quote": "Alice ventured to taste it, and finding it very nice, (it had, in fact, a sort of mixed flavour of cherry-tart, custard, pine-apple, roast turkey, toffee, and hot buttered toast,) she very soon finished it off.",
          "rating": 0.3
        }
      ]
    },
    {
      "number": 4,
      "name": "Alice in the Pool of Tears",
      "summary": "Alice finds herself swimming in a pool of her own tears and meets a Mouse.",
      "ratings": {
        "importance": 7,
        "conflict": 0.5,
        "sentiment": -0.2
      },
      "location": "Pool of Tears",
      "firstLine": "As she said these words her foot slipped, and in another moment, splash! she was up to her chin in salt water.",
      "lastLine": "Alice led the way, and the whole party swam to the shore.",
      "numLines": 32,
      "chapter": "2",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Worried and Regretful",
          "quote": "'I wish I hadn’t cried so much!' said Alice, as she swam about, trying to find her way out.",
          "rating": -0.3
        },
        {
          "name": "Mouse",
          "importance": 2,
          "emotion": "Inquisitive and Upset",
          "quote": "The Mouse looked at her rather inquisitively, and seemed to her to wink with one of its little eyes, but it said nothing.",
          "rating": -0.2
        }
      ]
    },
    {
      "number": 5,
      "name": "Caucus Race",
      "summary": "Alice and a group of animals participate in a chaotic race to get dry.",
      "ratings": {
        "importance": 12,
        "conflict": 0.4,
        "sentiment": 0.2
      },
      "location": "Pool of Tears",
      "firstLine": "They were indeed a queer-looking party that assembled on the bank—the birds with draggled feathers, the animals with their fur clinging close to them, and all dripping wet, cross, and uncomfortable.",
      "lastLine": "Alice replied eagerly, for she was always ready to talk about her pet: 'Dinah’s our cat. And she’s such a capital one for catching mice you can’t think!'",
      "numLines": 23,
      "chapter": "3",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Eager and Enthusiastic",
          "quote": "Alice replied eagerly, for she was always ready to talk about her pet.",
          "rating": 0.4
        },
        {
          "name": "Mouse",
          "importance": 2,
          "emotion": "Annoyed and Authoritative",
          "quote": "The Mouse, who seemed to be a person of authority among them, called out, 'Sit down, all of you, and listen to me! I'll soon make you dry enough!'",
          "rating": -0.2
        },
        {
          "name": "Lory",
          "importance": 3,
          "emotion": "Sulky and Argumentative",
          "quote": "The Lory, who at last turned sulky, and would only say, 'I am older than you, and must know better.'",
          "rating": -0.1
        }
      ]
    },
    {
      "number": 6,
      "name": "Alice and the White Rabbit's House",
      "summary": "Alice enters the White Rabbit's house and grows large after drinking from another bottle.",
      "ratings": {
        "importance": 10,
        "conflict": 0.6,
        "sentiment": -0.1
      },
      "location": "House of the Duchess",
      "firstLine": "It was the White Rabbit, trotting slowly back again, and looking anxiously about as it went, as if it had lost something; and she heard it muttering to itself 'The Duchess! The Duchess! Oh my dear paws! Oh my fur and whiskers! She’ll get me executed, as sure as ferrets are ferrets! Where _can_ I have dropped them, I wonder?'",
      "lastLine": "She set off at once, and ran till she was quite tired and out of breath, and till the puppy’s bark sounded quite faint in the distance.",
      "numLines": 30,
      "chapter": "4",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Desperate and Determined",
          "quote": "Alice felt so desperate that she was ready to ask help of any one; so, when the Rabbit came near her, she began, in a low, timid voice, 'If you please, sir—'",
          "rating": -0.1
        },
        {
          "name": "White Rabbit",
          "importance": 2,
          "emotion": "Anxious and Rushed",
          "quote": "'Oh! the Duchess, the Duchess! Oh! won’t she be savage if I’ve kept her waiting!'",
          "rating": -0.2
        }
      ]
    },
    {
      "number": 7,
      "name": "Alice and the Enormous Puppy",
      "summary": "Alice encounters an enormous puppy and plays with it while trying to avoid being trampled.",
      "ratings": {
        "importance": 13,
        "conflict": 0.5,
        "sentiment": 0.1
      },
      "location": "Wood",
      "firstLine": "The first thing I’ve got to do,” said Alice to herself, as she wandered about in the wood, “is to grow to my right size again; and the second thing is to find my way into that lovely garden. I think that will be the best plan.",
      "lastLine": "The great question certainly was, what?",
      "numLines": 35,
      "chapter": "4",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Frightened and Amused",
          "quote": "And yet what a dear little puppy it was!” said Alice, as she leant against a buttercup to rest herself, and fanned herself with one of the leaves.",
          "rating": 0.3
        }
      ]
    },
    {
      "number": 8,
      "name": "Advice from a Caterpillar",
      "summary": "Alice meets a Caterpillar who gives her cryptic advice and tells her how to change her size by eating from a mushroom.",
      "ratings": {
        "importance": 3,
        "conflict": 0.6,
        "sentiment": 0.1
      },
      "location": "Wood",
      "firstLine": "The Caterpillar and Alice looked at each other for some time in silence: at last the Caterpillar took the hookah out of its mouth, and addressed her in a languid, sleepy voice.",
      "lastLine": "One side will make you grow taller, and the other side will make you grow shorter.",
      "numLines": 55,
      "chapter": "5",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Confused and Frustrated",
          "quote": "'I’m afraid I can’t put it more clearly,' Alice replied very politely, 'for I can’t understand it myself to begin with; and being so many different sizes in a day is very confusing.'",
          "rating": -0.2
        },
        {
          "name": "Caterpillar",
          "importance": 2,
          "emotion": "Indifferent and Cryptic",
          "quote": "The Caterpillar took the hookah out of its mouth and addressed her in a languid, sleepy voice.",
          "rating": 0
        }
      ]
    },
    {
      "number": 9,
      "name": "Pig and Pepper",
      "summary": "Alice visits the house of the Duchess, where she encounters a chaotic scene with a baby who turns into a pig.",
      "ratings": {
        "importance": 9,
        "conflict": 0.7,
        "sentiment": -0.3
      },
      "location": "House of the Duchess",
      "firstLine": "For a minute or two she stood looking at the house, and wondering what to do next, when suddenly a footman in livery came running out of the wood—(she considered him to be a footman because he was in livery: otherwise, judging by his face only, she would have called him a fish)—and rapped loudly at the door with his knuckles.",
      "lastLine": "If it had grown up, it would have made a dreadfully ugly child: but it makes rather a handsome pig, I think.",
      "numLines": 60,
      "chapter": "6",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Surprised and Concerned",
          "quote": "I do wonder what _can_ have happened to me!",
          "rating": -0.1
        },
        {
          "name": "Duchess",
          "importance": 2,
          "emotion": "Chaotic and Irate",
          "quote": "The Duchess was sitting on a three-legged stool in the middle, nursing a baby; the cook was leaning over the fire, stirring a large cauldron which seemed to be full of soup.",
          "rating": -0.4
        }
      ]
    },
    {
      "number": 10,
      "name": "The Cheshire Cat",
      "summary": "Alice meets the Cheshire Cat, who gives her cryptic advice and tells her to visit the Mad Hatter or the March Hare.",
      "ratings": {
        "importance": 8,
        "conflict": 0.4,
        "sentiment": 0
      },
      "location": "Wood",
      "firstLine": "She was a little startled by seeing the Cheshire Cat sitting on a bough of a tree a few yards off.",
      "lastLine": "Well! I’ve often seen a cat without a grin, thought Alice; but a grin without a cat! It’s the most curious thing I ever saw in my life!",
      "numLines": 35,
      "chapter": "6",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Confused and Curious",
          "quote": "Would you tell me, please, which way I ought to go from here?",
          "rating": 0
        },
        {
          "name": "Cheshire Cat",
          "importance": 2,
          "emotion": "Amused and Cryptic",
          "quote": "We’re all mad here. I’m mad. You’re mad.",
          "rating": 0.1
        }
      ]
    },
    {
      "number": 11,
      "name": "A Mad Tea-Party",
      "summary": "Alice attends a chaotic tea-party with the Mad Hatter, the March Hare, and the Dormouse.",
      "ratings": {
        "importance": 2,
        "conflict": 0.8,
        "sentiment": 0.1
      },
      "location": "House of the Duchess",
      "firstLine": "There was a table set out under a tree in front of the house, and the March Hare and the Hatter were having tea at it: a Dormouse was sitting between them, fast asleep, and the other two were using it as a cushion, resting their elbows on it, and talking over its head.",
      "lastLine": "At any rate I’ll never go _there_ again!” said Alice as she picked her way through the wood.",
      "numLines": 55,
      "chapter": "7",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Annoyed and Confused",
          "quote": "At any rate I’ll never go _there_ again!” said Alice as she picked her way through the wood.",
          "rating": -0.2
        },
        {
          "name": "Mad Hatter",
          "importance": 2,
          "emotion": "Erratic and Amused",
          "quote": "The Hatter opened his eyes very wide on hearing this; but all he said was, 'Why is a raven like a writing-desk?'",
          "rating": 0
        },
        {
          "name": "March Hare",
          "importance": 3,
          "emotion": "Rude and Dismissive",
          "quote": "'Have some wine,' the March Hare said in an encouraging tone.",
          "rating": -0.1
        },
        {
          "name": "Dormouse",
          "importance": 4,
          "emotion": "Sleepy and Disoriented",
          "quote": "The Dormouse had closed its eyes by this time, and was going off into a doze; but, on being pinched by the Hatter, it woke up again with a little shriek.",
          "rating": -0.2
        }
      ]
    },
    {
      "number": 12,
      "name": "The Queen's Croquet-Ground",
      "summary": "Alice finally enters the lovely garden and meets the Queen of Hearts, who invites her to play croquet.",
      "ratings": {
        "importance": 11,
        "conflict": 0.5,
        "sentiment": 0.2
      },
      "location": "Queen's Croquet-Ground",
      "firstLine": "A large rose-tree stood near the entrance of the garden: the roses growing on it were white, but there were three gardeners at it, busily painting them red.",
      "lastLine": "At this moment Five, who had been anxiously looking across the garden, called out “The Queen! The Queen!” and the three gardeners instantly threw themselves flat upon their faces.",
      "numLines": 35,
      "chapter": "8",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Curious and Nervous",
          "quote": "Would you tell me,” said Alice, a little timidly, “why you are painting those roses?",
          "rating": 0.1
        },
        {
          "name": "Queen of Hearts",
          "importance": 2,
          "emotion": "Authoritative and Fierce",
          "quote": "The Queen turned crimson with fury, and, after glaring at her for a moment like a wild beast, screamed “Off with her head! Off—”",
          "rating": -0.4
        }
      ]
    },
    {
      "number": 13,
      "name": "Alice and the Gryphon",
      "summary": "Alice meets the Gryphon, who takes her to see the Mock Turtle.",
      "ratings": {
        "importance": 14,
        "conflict": 0.2,
        "sentiment": 0.2
      },
      "location": "Wood",
      "firstLine": "They very soon came upon a Gryphon, lying fast asleep in the sun.",
      "lastLine": "The Gryphon sat up and rubbed its eyes: then it watched the Queen till she was out of sight: then it chuckled. 'What fun!' said the Gryphon, half to itself, half to Alice.",
      "numLines": 18,
      "chapter": "9",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Curious and Cautious",
          "quote": "Alice did not quite like the look of the creature, but on the whole she thought it would be quite as safe to stay with it as to go after that savage Queen.",
          "rating": 0
        },
        {
          "name": "Gryphon",
          "importance": 2,
          "emotion": "Amused and Nonchalant",
          "quote": "'What fun!' said the Gryphon, half to itself, half to Alice.",
          "rating": 0.2
        },
        {
          "name": "Queen of Hearts",
          "importance": 3,
          "emotion": "Authoritative and Determined",
          "quote": "'Up, lazy thing!' said the Queen, 'and take this young lady to see the Mock Turtle, and to hear his history.'",
          "rating": -0.2
        }
      ]
    },
    {
      "number": 14,
      "name": "The Mock Turtle's Story",
      "summary": "The Mock Turtle tells Alice and the Gryphon about his education under the sea.",
      "ratings": {
        "importance": 15,
        "conflict": 0.2,
        "sentiment": -0.1
      },
      "location": "Wood",
      "firstLine": "'Come on!' cried the Gryphon, and, taking Alice by the hand, it hurried off, without waiting for the end of the song.",
      "lastLine": "The Mock Turtle sighed deeply, and drew the back of one flapper across his eyes. He looked at Alice and tried to speak, but for a minute or two sobs choked his voice.",
      "numLines": 40,
      "chapter": "9",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Sympathetic and Engaged",
          "quote": "Alice could not help laughing at him, even though she felt sorry for him.",
          "rating": -0.1
        },
        {
          "name": "Gryphon",
          "importance": 2,
          "emotion": "Indifferent and Impatient",
          "quote": "The Gryphon lifted up both its paws in surprise. 'What? Never heard of uglification!' it exclaimed.",
          "rating": 0
        },
        {
          "name": "Mock Turtle",
          "importance": 3,
          "emotion": "Sad and Reflective",
          "quote": "The Mock Turtle sighed deeply, and drew the back of one flapper across his eyes.",
          "rating": -0.3
        }
      ]
    },
    {
      "number": 15,
      "name": "The Lobster Quadrille",
      "summary": "The Mock Turtle and the Gryphon teach Alice a dance called the Lobster Quadrille.",
      "ratings": {
        "importance": 16,
        "conflict": 0.2,
        "sentiment": 0.1
      },
      "location": "Wood",
      "firstLine": "'Will you walk a little faster?' said a whiting to a snail, 'There's a porpoise close behind us, and he's treading on my tail.'",
      "lastLine": "'Thank you,' said Alice, 'it's very interesting. I never knew so much about a whiting before.'",
      "numLines": 30,
      "chapter": "10",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Amused and Curious",
          "quote": "'Thank you,' said Alice, 'it's very interesting. I never knew so much about a whiting before.'",
          "rating": 0.2
        },
        {
          "name": "Gryphon",
          "importance": 2,
          "emotion": "Enthusiastic and Encouraging",
          "quote": "'What matters it how far we go?' his scaly friend replied.",
          "rating": 0.1
        },
        {
          "name": "Mock Turtle",
          "importance": 3,
          "emotion": "Melancholic and Reflective",
          "quote": "The Mock Turtle sighed deeply, and began, in a voice choked with sobs, to sing this: 'Beautiful Soup, so rich and green, Waiting in a hot tureen!'",
          "rating": -0.2
        }
      ]
    },
    {
      "number": 16,
      "name": "The Trial of the Knave of Hearts",
      "summary": "Alice attends the trial of the Knave of Hearts, who is accused of stealing the Queen's tarts.",
      "ratings": {
        "importance": 1,
        "conflict": 0.8,
        "sentiment": -0.2
      },
      "location": "Hall with Locked Doors",
      "firstLine": "The King and Queen of Hearts were seated on their throne when they arrived, with a great crowd assembled about them—all sorts of little birds and beasts, as well as the whole pack of cards.",
      "lastLine": "Alice had never been in a court of justice before, but she had read about them in books, and she was quite pleased to find that she knew the name of nearly everything there.",
      "numLines": 55,
      "chapter": "11",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Curious and Observant",
          "quote": "Alice had never been in a court of justice before, but she had read about them in books, and she was quite pleased to find that she knew the name of nearly everything there.",
          "rating": 0
        },
        {
          "name": "King of Hearts",
          "importance": 2,
          "emotion": "Authoritative and Confused",
          "quote": "'Consider your verdict,' the King said to the jury.",
          "rating": -0.1
        },
        {
          "name": "Queen of Hearts",
          "importance": 3,
          "emotion": "Furious and Impatient",
          "quote": "'Off with his head!' she said, without even looking round.",
          "rating": -0.4
        },
        {
          "name": "Knave of Hearts",
          "importance": 4,
          "emotion": "Nervous and Defiant",
          "quote": "The Knave was standing before them, in chains, with a soldier on each side to guard him.",
          "rating": -0.2
        }
      ]
    },
    {
      "number": 17,
      "name": "Alice's Evidence",
      "summary": "Alice is called as a witness in the trial, where she grows to an enormous size and challenges the court's absurdity.",
      "ratings": {
        "importance": 3,
        "conflict": 0.9,
        "sentiment": 0
      },
      "location": "Hall with Locked Doors",
      "firstLine": "'Here!' cried Alice, quite forgetting in the flurry of the moment how large she had grown in the last few minutes.",
      "lastLine": "'Who cares for you?' said Alice (she had grown to her full size by this time). 'You're nothing but a pack of cards!'",
      "numLines": 65,
      "chapter": "12",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Defiant and Empowered",
          "quote": "'You're nothing but a pack of cards!'",
          "rating": 0.2
        },
        {
          "name": "King of Hearts",
          "importance": 2,
          "emotion": "Bewildered and Overwhelmed",
          "quote": "'The trial cannot proceed,' said the King in a very grave voice, 'until all the jurymen are back in their proper places—_all_,' he repeated with great emphasis, looking hard at Alice as he said so.",
          "rating": -0.2
        },
        {
          "name": "Queen of Hearts",
          "importance": 3,
          "emotion": "Furious and Authoritative",
          "quote": "'Off with her head!' the Queen shouted at the top of her voice. Nobody moved.",
          "rating": -0.4
        }
      ]
    },
    {
      "number": 18,
      "name": "Alice Awakens",
      "summary": "Alice wakes up from her dream and finds herself back on the riverbank with her sister.",
      "ratings": {
        "importance": 7,
        "conflict": 0,
        "sentiment": 0.4
      },
      "location": "Riverbank",
      "firstLine": "Alice gave a little scream of laughter.",
      "lastLine": "So Alice got up and ran off, thinking while she ran, as well she might, what a wonderful dream it had been.",
      "numLines": 20,
      "chapter": "12",
      "characters": [
        {
          "name": "Alice",
          "importance": 1,
          "emotion": "Content and Reflective",
          "quote": "So Alice got up and ran off, thinking while she ran, as well she might, what a wonderful dream it had been.",
          "rating": 0.5
        }
      ]
    }
  ],
  "locations": [
    {
      "name": "Rabbit Hole",
      "key": "rabbit-hole",
      "quote": "The rabbit-hole went straight on like a tunnel for some way, and then dipped suddenly down, so suddenly that Alice had not a moment to think about stopping herself before she found herself falling down a very deep well."
    },
    {
      "name": "Hall with Locked Doors",
      "key": "hall",
      "quote": "There were doors all round the hall, but they were all locked; and when Alice had been all the way down one side and up the other, trying every door, she walked sadly down the middle, wondering how she was ever to get out again."
    },
    {
      "name": "Pool of Tears",
      "key": "pool-of-tears",
      "quote": "However, she soon made out that she was in the pool of tears which she had wept when she was nine feet high."
    },
    {
      "name": "Queen's Croquet-Ground",
      "key": "queens-croquet-ground",
      "quote": "Alice thought she had never seen such a curious croquet-ground in her life; it was all ridges and furrows; the balls were live hedgehogs, the mallets live flamingoes, and the soldiers had to double themselves up and to stand on their hands and feet, to make the arches."
    },
    {
      "name": "House of the Duchess",
      "key": "duchess-kitchen",
      "quote": "The door led right into a large kitchen, which was full of smoke from one end to the other: the Duchess was sitting on a three-legged stool in the middle, nursing a baby; the cook was leaning over the fire, stirring a large cauldron which seemed to be full of soup."
    },
    {
      "name": "Wood",
      "key": "march-hares-house",
      "quote": "As she said this, she came suddenly upon an open place, with a little house in it about four feet high."
    },
    {
      "name": "Riverbank",
      "key": "riverbank",
      "quote": "Alice gave a little scream of laughter."
    }
  ],
  "characters": [
    {
      "character": "Alice",
      "key": "alice",
      "quote": "Alice was beginning to get very tired of sitting by her sister on the bank, and of having nothing to do.",
      "group": "Main Characters",
      "color": "rgb(120, 186, 232)",
      "explanation": "A serene sky blue, reflecting Alice's curiosity and her journey through the whimsical world."
    },
    {
      "character": "White Rabbit",
      "key": "white-rabbit",
      "quote": "Suddenly a White Rabbit with pink eyes ran close by her.",
      "group": "Eccentric Characters",
      "color": "rgb(233, 221, 198)",
      "explanation": "A soft, warm off-white with a hint of pink, mirroring the rabbit's fur and pink eyes."
    },
    {
      "character": "Mouse",
      "key": "mouse",
      "quote": "'Mine is a long and sad tale!' said the Mouse.",
      "group": "Creatures of Wisdom or Mystique",
      "color": "rgb(153, 153, 153)",
      "explanation": "A neutral gray, reflecting the Mouse's role as a more subdued character, and its actual color as a mouse."
    },
    {
      "character": "Lory",
      "key": "lory",
      "quote": "The Lory, who at last turned sulky, and would only say, 'I am older than you, and must know better.'",
      "group": "Creatures of Wisdom or Mystique",
      "color": "rgb(144, 238, 144)",
      "explanation": "A light green, representing a hint of wisdom and stubbornness."
    },
    {
      "character": "Duchess",
      "key": "duchess",
      "quote": "The Duchess was sitting on a three-legged stool in the middle, nursing a baby.",
      "group": "Authority Figures",
      "color": "rgb(255, 160, 122)",
      "explanation": "A light coral, symbolizing the chaotic and nurturing yet slightly bizarre nature of the Duchess."
    },
    {
      "character": "Cheshire Cat",
      "key": "cheshire-cat",
      "quote": "'It's a Cheshire cat,' said the Duchess, 'and that's why. Pig!'",
      "group": "Eccentric Characters",
      "color": "rgb(255, 105, 180)",
      "explanation": "A vibrant, mystical pink, embodying the cat's enigmatic and mischievous nature."
    },
    {
      "character": "Caterpillar",
      "key": "caterpillar",
      "quote": "'Who are _you_?' said the Caterpillar.",
      "group": "Creatures of Wisdom or Mystique",
      "color": "rgb(75, 0, 130)",
      "explanation": "A deep indigo, representing the Caterpillar's mysterious and contemplative nature."
    },
    {
      "character": "March Hare",
      "key": "march-hare",
      "quote": "'Have some wine,' the March Hare said in an encouraging tone.",
      "group": "Eccentric Characters",
      "color": "rgb(184, 134, 11)",
      "explanation": "A golden brown, reflecting the hare's energetic and slightly mad personality."
    },
    {
      "character": "Mad Hatter",
      "key": "mad-hatter",
      "quote": "'Your hair wants cutting,' said the Hatter.",
      "group": "Eccentric Characters",
      "color": "rgb(139, 69, 19)",
      "explanation": "A rich, dark brown, echoing the Hatter's tea-stained attire and eccentric personality."
    },
    {
      "character": "Dormouse",
      "key": "dormouse",
      "quote": "'I wasn't asleep,' he said in a hoarse, feeble voice: 'I heard every word you fellows were saying.'",
      "group": "Eccentric Characters",
      "color": "rgb(205, 133, 63)",
      "explanation": "A lighter, warm brown, capturing the Dormouse's sleepy disposition and its cozy, fur-like appearance."
    },
    {
      "character": "Queen of Hearts",
      "key": "queen-of-hearts",
      "quote": "'Off with his head!' she said, without even looking round.",
      "group": "Authority Figures",
      "color": "rgb(220, 20, 60)",
      "explanation": "A bold, striking red, symbolizing the Queen's fiery temper and the theme of hearts running through her domain."
    },
    {
      "character": "King of Hearts",
      "key": "king-of-hearts",
      "quote": "'Consider my dear: she is only a child!' the King said.",
      "group": "Authority Figures",
      "color": "rgb(255, 215, 0)",
      "explanation": "A royal gold, highlighting the King's authority but also his more amiable and less imposing nature compared to the Queen."
    },
    {
      "character": "Gryphon",
      "key": "gryphon",
      "quote": "'Will you, won't you, will you, won't you, will you join the dance?'",
      "group": "Eccentric Characters",
      "color": "rgb(255, 140, 0)",
      "explanation": "A vivid orange, reflective of the Gryphon's bold and somewhat flamboyant role in guiding Alice."
    },
    {
      "character": "Mock Turtle",
      "key": "mock-turtle",
      "quote": "'When we were little,' the Mock Turtle went on at last, more calmly, though still sobbing a little now and then, 'we went to school in the sea.'",
      "group": "Creatures of Wisdom or Mystique",
      "color": "rgb(70, 130, 180)",
      "explanation": "A sea blue, nodding to the Mock Turtle's oceanic origins and his melancholic, reflective tales of the sea."
    },
    {
      "character": "Knave of Hearts",
      "key": "knave-of-hearts",
      "quote": "'I haven't done anything wrong,' said the Knave of Hearts, 'and I don't deserve to be punished.'",
      "group": "Eccentric Characters",
      "color": "rgb(240, 128, 128)",
      "explanation": "A light, soft red, echoing the theme of hearts but in a more subdued, innocent manner."
    }
  ]
}
